{
    "APP": {
        "BACK": "Back",
        "WORKSHEETS": "Worksheets",
        "LOGIN": "Log In"
    },
    "ABOUT": {
        "TITLE": "Machine Learning for Kids",
        "IN6SECS": "In 6 seconds...",
        "IN20MINS": "In 20 minutes...",
        "WHAT": {
            "TITLE": "What?",
            "BODY" : "This tool introduces machine learning by providing hands-on experiences for training machine learning systems and building things with them.        <br/><br/>It provides an easy-to-use guided environment for training machine learning models for classifying text, numbers or recognising images.<br/><br/>This builds on existing efforts to introduce and teach coding to children, by adding these models to <a href='https://scratch.mit.edu/about' target='_blank'>Scratch</a> (a widely used educational coding platform), allowing children to create projects and build games with the machine learning models that they've trained.<br/><br/>To learn more, look at:"
        },
        "WHY": {
            "TITLE": "Why?",
            "BODY": "Machine learning is all around us. We all use machine learning systems every day - such as spam filters, recommendation engines, language translation services, chatbots and digital assistants, search engines, and fraud detection systems.<br/><br/>It will soon be normal for machine learning systems to drive our cars, and help doctors to diagnose and treat our illnesses.<br/><br/>It's important that kids are aware of how our world works. The best way to understand the capabilities and implications is to be able to build with this technology for themselves.<br/><br/>To learn more, read: <a target='_blank' class='btn btn-primary' href='http://dalelane.co.uk/blog/?p=3513'>'Introducing Machine Learning to kids'</a>"
        },
        "TECH": {
            "TITLE": "Tech",
            "BODY": "The tool is entirely web-based and requires no installs or complicated setup to be able to use.<br/><br/>It was designed for use in the classroom by schools and volunteer-run coding groups for children,and provides an admin page for teachers or group leaders to be able to manage and administer access for their students.<br/><br/>It is being built by <a target='_blank' href='http://dalelane.co.uk/'>Dale Lane</a> using APIs from <a target='_blank' href='https://www.ibm.com/watson/developercloud/'>IBM Watson Developer Cloud</a>.",
            "LOGIN": "To get started: "
        }
    },
    "WELCOME": {
        "TITLE": "Teach a computer to play a game",
        "GET_STARTED": "Get started",
        "LEARN_MORE": "Learn more",
        "ADMIN_LABEL": "Go to your <strong>Admin Page</strong>",
        "PROJECT_LABEL": "Go to your <strong>Projects</strong>",
        "STEP_1_TEXT": "Collect examples of things you want to be able to recognise",
        "STEP_2_TEXT": "Use the examples to train a computer to be able to recognise them",
        "STEP_3_TEXT": "Make a game in Scratch that uses the computer's ability to recognise them"
    },
    "LOGIN": {
        "TITLE": "Get started with machine learning",
        "WELCOME": "Welcome!  It's great that you're interested in having an account to log in to Machine Learning for Kids.",
        "ALREADY_LOGGEDIN": "<strong>Info: </strong> Already logged in",
        "ERROR": "<strong>Error:</strong> {{ message }}",
        "ERROR_HELP": "If this keeps happening, please visit our help section",
        "FIRST_TIME": "First time here?",
        "SIGN_UP": "Sign up",
        "WHY_REGISTER": "Why register?",
        "ALREADY_REGISTERED": "Already registered?",
        "LOGIN": "Log in",
        "FORGOT_DETAILS": "Forgot your details?",
        "TRY_TITLE": "Try without registering",
        "TRY_NOW": "Try it now",
        "BACK": "@:APP.BACK",
        "WHO_YOU": "Who are you?",
        "TEACHER": "A teacher or leader of a coding club",
        "STUDENT": "A student",
        "FORGOT_TEXT": "Forgot your username or password? That's okay - we all forget things sometimes."
    },
    "SIGNUP": {
        "TEACHER": {
            "TITLE": "Are you a teacher or leader of a coding club?",
            "INFO1": "If you would like access for your students, please create a class account below.",
            "INFO2": "There are two types of class account - depending on who sets it up."
        }
    }
}
