{
    "APP": {
        "TITLE": "Aprendizaje Automático para Niños",

        "BACK": "Volver",
        "BACKTOPROJECT": "&lt; Volver al proyecto",
        "ERROR": "Error:",
        "WARNING": "Advertencia:",
        "INFO": "Info:",

        "ADD": "Agregar",
        "CANCEL": "Cancelar",

        "ABOUT": "Acerca de",
        "TEACHER": "Maestro",
        "PROJECTS": "Proyectos",
        "WORKSHEETS": "Ejercicios",
        "NEWS": "Novedades",
        "HELP": "Ayuda",
        "LOGIN": "Ingresar",
        "LOGOUT": "Salir",

        "BETA": "Beta",
        "INCOMPLETE": "Incompleto!"
    },
    "ABOUT": {
        "TITLE": "Aprendizaje Automático para Niños",
        "IN6SECS": "En 6 segundos...",
        "IN20MINS": "En 20 minutos...",
        "WHAT": {
            "TITLE": "¿Qué?",
            "BODY" : "Esta herramienta provee una introducción al aprendizaje automático a través de experiencias prácticas para entrenar sistemas de aprendizaje automático y construir cosas con ellos. <br/><br/>Provee un ambiente guidado fácil de usar para entrenar modelos de aprendizaje automático para clasificar texto, números o reconocimiento de imágenes. <br/><br/>Esto complementa los esfuerzos existentes para introducir y enseñar a programar a los niños, agregando estos modelos a <a href='https://scratch.mit.edu/about' target='_blank'>Scratch</a> (la plataforma de programación educacional utilizada mundialmente), permitiendo a los niños crear proyectos y construir juegos con los modelos de aprendizaje automático que ellos mismos han entrenado. <br/><br/>Para aprender más, ver:"
        },
        "WHY": {
            "TITLE": "¿Por qué?",
            "BODY": "El aprendizaje automático está por todos lados. Usamos sistemas de aprendizaje automático todos los días - como ser filtros de detección de correo basura, sistemas de recomendación, servicios de traducciones entre idiomas, chatbots y assitentes digitales, motores de búsqueda, y sistemas de detección de fraude.<br/><br/>Pronto será normal que los sistemas de aprendizaje automático manejen nuestros automóbiles, y ayuden a los médicos a diagnosticas y tratar nuestras enfermedades. <br/><br/>Es importante que los niños conozcan cómos es que funciona el mundo. La mejor manera de comprender las capacidades e implicaciones es poder construir utilizando esta tecnología ellos mismos. <br/><br/>Para aprender más, leer: <a target='_blank' class='btn btn-primary' href='http://dalelane.co.uk/blog/?p=3513'>'Introducción a Aprendizaje Automático para niños'</a>"
        },
        "TECH": {
            "TITLE": "Tecnolog´ʼʼ",
            "BODY": "La herramienta está basada enteramente en la web y no requiere ni instalación ni configuración compleja para usarse. <br/><br/>Fue diseñada para su uso en el aula tanto en escuelas como en clubes de programación para niños dirigidos por voluntarios, y proporciona una página de administración para que los maestros o líderes de grupos puedan administrar y gestionar el acceso de sus estudiantes.<br/><br/>El desarrollo está a cargo de <a target='_blank' href='http://dalelane.co.uk/'>Dale Lane</a> utilizando APIs de <a target='_blank' href='https://www.ibm.com/watson/developercloud/'>IBM Watson Developer Cloud</a>.",
            "LOGIN": "Para comenzar: "
        }
    },
    "NEWS": {
        "TITLE": "Novedades",
        "UPDATES": {
            "TITLE": "Novedades y actualizaciones",
            "DESCRIPTION": "Novedades y actualizaciones de @MLforKids"
        },
        "MENTIONS": {
            "TITLE": "Menciones & Media",
            "DESCRIPTION": "cargando Menciones &amp; Media desde wakelet.com"
        }
    },
    "ERRORS": {
        "PAGENOTFOUND": "Página no encontrada",
        "NOTLOGGEDIN": "Sin iniciar sesión",

        "MISSINGPROJECTID": "Falta el id del proyecto. Volver a ",
        "IFPERSISTENT": "Si esto sigue sucediendo, por favor ",

        "LETMEKNOW": "házmelo saber"
    },
    "WELCOME": {
        "TITLE": "Enséñale a una computadora a jugar un juego",
        "GET_STARTED": "Empezar",
        "LEARN_MORE": "Aprender más",
        "ADMIN_LABEL": "Ir a tu <strong>Página de Administración</strong>",
        "PROJECT_LABEL": "Ir a tus <strong>Proyectos</strong>",
        "STEP_1_TEXT": "Reúne ejemplos de cosas que quieres poder reconocer",
        "STEP_2_TEXT": "Usa ejemplos para entrenar una computadora para poder reconocerlos",
        "STEP_3_TEXT": "Haz un juego en Scratch que use la habilidad de la computadora para reconocerlos"
    },
    "LOGIN": {
        "TITLE": "Empezar con el aprendizaje automático.",
        "WELCOME": "¡Bienvenido! Es fantástico que estés interesado en tener una cuenta para iniciar sesión en Aprendizaje Automático para Niños.",
        "ALREADY_LOGGEDIN": "<strong>Info: </strong> Ya estás conectado",
        "ERROR": "<strong>Error:</strong> {{ message }}",
        "ERROR_HELP": "Si esto sigue sucediendo, por favor visite nuestra sección de ayuda",
        "FIRST_TIME": "¿Primera vez aquí?",
        "SIGN_UP": "Regístrate",
        "WHY_REGISTER": "¿Por qué registrarse?",
        "WHY_REGISTER_INTRO_1": "<strong> No es necesario registrarse ni crear una cuenta </strong> para usar Aprendizaje Automático para Niños, pero si lo haces, se desbloquean algunas características de la herramienta.",
        "WHY_REGISTER_INTRO_2": "La siguiente grilla explica la diferencia entre lo que puedes hacer si haces clic en \"Pruébalo ahora\" sin registrarte, y qué puedes hacer si creas una cuenta para iniciar sesión.",
        "ALREADY_REGISTERED": "¿Ya registrado?",
        "LOGIN": "Inicia sesión",
        "FORGOT_DETAILS": "¿Olvidaste tus datos?",
        "TRY_TITLE": "Prueba sin registrarte",
        "TRY_NOW": "Pruébalo ahora",
        "BACK": "@:APP.BACK",
        "WHO_YOU": "¿Quién eres tú?",
        "TEACHER": "Un maestro o líder de un club de codificación",
        "STUDENT": "Un estudiante",
        "FORGOT_TEXT": "¿Haz olvidado tu nombre de usuario o contraseña? Está bien, todos olvidamos cosas a veces."
    },
    "SIGNUP": {
        "TEACHER": {
            "TITLE": "¿Eres profesor o líder de un club de codificación?",
            "INFO1": "Si deseas acceso para tus estudiantes, crea una cuenta de clase a continuación.",
            "INFO2": "Hay dos tipos de cuentas de clase, dependiendo de quién lo configure."
        },
        "UNMANAGED": {
            "TITLE": "Crea una cuenta de clase <strong> no administrada </strong>",
            "INTRO": "Si quieres configurar y administrar la cuenta de la clase tú mismo, ¡puedes hacerlo ahora!",
            "LISTINTRO": "Necesitarás:",
            "LIST_CREATEACCOUNT": "Crear una cuenta en IBM Cloud",
            "LIST_CREATEAPIKEYS": "Crear clave/s de la API de servicios en la nube Watson necesarios para entrenar modelos de aprendizaje automático",
            "LIST_ENTERAPIKEYS": "Ingresar las claves de la API en esta herramienta de Aprendizaje Automático para Niños",
            "HELP": "Las instrucciones paso a paso (con capturas de pantalla) están disponibles para todo esto."
        },
        "MANAGED": {
            "TITLE": "Crea una cuenta de clase <strong> administrada </strong>",
            "INTRO": "Si deseas que Dale configure la cuenta de la clase, usa el botón a continuación para enviar un correo electrónico con la siguiente información:",
            "LIST_NUMBEROFSTUDENTS": "Aproximadamente cuántas cuentas de estudiante necesitarás",
            "LIST_NAMEOFSCHOOL": "El nombre de la escuela o grupo de codificación para el que es la cuenta.",
            "EMAIL": "Email"
        }
    },
    "PROJECTS": {
        "TITLE": "Tus proyectos de aprendizaje automático",
        "ADDNEWPROJECT": "Añadir un nuevo proyecto",
        "CREATEFIRSTPROJECT": "Haz clic en el botón 'más' a la izquierda para crear tu primer proyecto.",
        "RECOGNISING": "Reconociendo",
        "AS": "como"
    },
    "NEWPROJECT": {
        "TITLE": "Iniciar un nuevo proyecto de aprendizaje automático",
        "PROJECT_NAME": {
            "TITLE": "Nombre del proyecto",
            "NOTES": "Asigna un nombre a tu proyecto para describir qué tipo de cosas tratarás de enseñarle a la computadora a reconocer."
        },
        "WHOLE_CLASS_PROJECT": {
            "TITLE": "¿Proyecto de toda la clase?",
            "NOTES_1": "Marca esto si deseas que toda tu clase pueda trabajar en este proyecto juntos.",
            "NOTES_2": "Esto es útil para los proyectos que enseñan la participación colectiva como un enfoque para entrenar proyectos de aprendizaje automático."
        },
        "TYPES": {
            "LABEL": "Reconociendo",
            "NOTES_1": "¿Qué tipo de cosas quieres enseñar a la computadora a reconocer?",
            "NOTES_2": "Para palabras, oraciones o párrafos, elige \"texto\"",
            "NOTES_3": "Para fotos, diagramas e imágenes, elige \"imágenes\"",
            "NOTES_4": "Para conjuntos de números u opciones múltiples, elija \"números\""
        },
        "LANGUAGE": {
            "LABEL": "Lenguaje",
            "NOTES": "¿En qué idioma será el texto en este proyecto?"
        },
        "FIELDS": {
            "TYPE": {
                "TITLE": "Tipo de valor",
                "NUMBER": "número",
                "MULTIPLE_CHOICE": "opción multiple"
            },
            "CHOICES": {
                "TITLE": "Opciones:",
                "LABEL": "Agregar una opción"
            },
            "NEWFIELD": {
                "DESCRIBE_FIELD": "Asigna un nombre a este campo para describir el valor",
                "MULTICHOICE": "Si se puede describir como elegir entre algunas opciones, elige \"opción múltiple\".",
                "ADD_FIRST_FIELD": "Escribe una opción para usar en tu lista de opciones múltiples, luego presiona Enter.",
                "ADD_ANOTHER_FIELD": "Escribe otra opción para usar en su lista de opciones múltiples, luego presiona Enter."
            },
            "NEWVALUE": {
                "ADD_FIRST_VALUE": "Comienza a describir los valores que incluirás en cada ejemplo para entrenar la computadora haciendo clic en el botón 'Agregar un valor'.",
                "VALUES_LIMIT": "No se permiten más de 10 valores en un proyecto."
            }
        },
        "CREATE": "Crear"
    },
    "PROJECT": {
        "TRAIN": {
            "TITLE": "Entrenar",
            "BODY": "Recoge ejemplos de lo que quieres que la computadora reconozca"
        },
        "LEARNANDTEST": {
            "TITLE": "Aprender &amp; Probar",
            "BODY": "Usa los ejemplos para entrenar la computadora para reconocer"
        },
        "MAKES": {
            "TITLE": "Make",
            "BODY": "Usa el modelo de aprendizaje automático que has entrenado para crear un juego o una aplicación, en Scratch o en Python"
        },
        "SCRATCH": {
            "TITLE": "Scratch",
            "BODY": "Usa el modelo de aprendizaje automático que has entrenado para hacer un juego en Scratch"
        },
        "PYTHON": {
            "TITLE": "Python",
            "BODY": "Usa el modelo de aprendizaje automático que has entrenado en un programa de Python"
        },
        "APPINVENTOR": {
            "TITLE": "Inventor de aplicaciones",
            "BODY": "Haz una aplicación móvil que use tu modelo de aprendizaje automático"
        },
        "SCRATCH3": {
            "TITLE": "Scratch 3",
            "BODY": "Usa tu modelo de aprendizaje automático en la nueva versión de Scratch"
        }
    },
    "TRAINING": {
        "TITLE": "Training",
        "ADDLABEL": "Add new label",
        "CREATEFIRSTLABEL": "Click on the 'plus' button on the right to add your first bucket.",
        "CROWDSOURCEDEMPTY": "Refresh this page after your teacher has created the training buckets.",
        "ADDEXAMPLE": "Add example",
        "ADDURL": "www",
        "ADDWEBCAM": "webcam",
        "ADDDRAWING": "draw",
        "DRAGIMAGES": "Drag pictures from other browser windows and drop them here",
        "NEWLABEL": {
            "INTRO": "Enter new label to recognise",
            "ERROR": "Only use letters and numbers in labels"
        },
        "NEWEXAMPLE": {
            "INTRO": "Enter an example of ",
            "INTROURL": "Enter the URL of a picture that is an example of",
            "INTRODRAWING": "Draw a new example of",
            "INTROWEBCAM": "Add new example of",
            "ERROR": "You're not allowed to use tabs or newlines.",
            "REQUIRED": "You have to include values for all fields in an example",
            "PATTERNNUMBER": "This doesn't look like a number",
            "PATTERNURL": "This needs to be the web address of a picture",
            "WEBCAMFAIL": "Sorry! We weren't able to get a webcam to work for you.",
            "WEBCAMERROR": "The message we got from your web browser was:"
        }
    },
    "MODELS": {
        "TITLE": "Machine learning models",
        "TRAIN": "Train new machine learning model",
        "CANCEL": "Cancel training",
        "DELETE": "Delete this model",
        "WHATHAVEYOUDONE": {
            "TITLE": "What have you done?",
            "PLEASEWAIT": "This normally takes a few minutes, but can take a little longer if the training computer is very busy.",
            "FAIL": "Unfortunately, something went wrong.",

            "TRAINING" : {
                "CROWDSOURCED" : {
                    "TEXT" : "Your class is training a machine learning model using the examples of text that you all collected.",
                    "IMAGES" : "Your class is training a machine learning model using the examples of images that you all collected.",
                    "NUMBERS" : "Your class is training a machine learning model using the examples of numbers that you all collected."
                },
                "INDIVIDUAL" : {
                    "TEXT" : "You've started training a machine learning model using the examples of text that you collected.",
                    "IMAGES" : "You've started training a machine learning model using the examples of images that you collected.",
                    "NUMBERS" : "You've started training a machine learning model using the examples of numbers that you collected."
                },
                "SINCE": "It's been training since"
            },
            "READY" : {
                "CROWDSOURCED" : {
                    "TEXT" : "Your class has trained a machine learning model to recognise when text is ",
                    "IMAGES" : "Your class has trained a machine learning model to recognise when images are ",
                    "NUMBERS" : "Your class has trained a machine learning model to recognise when numbers are "
                },
                "INDIVIDUAL" : {
                    "TEXT" : "You have trained a machine learning model to recognise when text is ",
                    "IMAGES" : "You have trained a machine learning model to recognise when images are ",
                    "NUMBERS" : "You have trained a machine learning model to recognise when numbers are "
                },
                "CREATED" : {
                    "TEACHER" : "Your teacher created the model on ",
                    "YOU" : "You created the model on "
                },
                "TRAINING" : {
                    "CLASS" : "Your class has collected: ",
                    "YOU" : "You have collected: "
                }
            },
            "ERROR": {
                "CROWDSOURCED" : {
                    "CLASS" : {
                        "TEXT" : "Your teacher tried training a machine learning model using the examples of text that your class collected.",
                        "IMAGES" : "Your teacher tried training a machine learning model using the examples of images that your class collected.",
                        "NUMBERS" : "Your teacher tried training a machine learning model using the examples of numbers that your class collected."
                    },
                    "YOU" : {
                        "TEXT" : "You tried training a machine learning model using the examples of text that your class collected.",
                        "IMAGES" : "You tried training a machine learning model using the examples of images that your class collected.",
                        "NUMBERS" : "You tried training a machine learning model using the examples of numbers that your class collected."
                    }
                },
                "INDIVIDUAL" : {
                    "TEXT" : "You tried training a machine learning model using the examples of text that you collected.",
                    "IMAGES" : "You tried training a machine learning model using the examples of images that you collected.",
                    "NUMBERS" : "You tried training a machine learning model using the examples of numbers that you collected."
                }
            },
            "IDLE" : {
                "NOLABELS" : {
                    "CROWDSOURCED" : {
                        "TEXT" : "Your class said you want to collect examples of text.",
                        "IMAGES" : "Your class said you want to collect examples of images.",
                        "NUMBERS" : "Your class said you want to collect examples of numbers."
                    },
                    "INDIVIDUAL" : {
                        "TEXT" : "You've said you want to collect examples of text.",
                        "IMAGES" : "You've said you want to collect examples of images.",
                        "NUMBERS" : "You've said you want to collect examples of numbers."
                    }
                },
                "NODATA" : {
                    "CROWDSOURCED" : {
                        "TEXT" : "Your class said that you want to collect examples of text for a computer to recognise when text is ",
                        "IMAGES" : "Your class said that you want to collect examples of images for a computer to recognise when images are ",
                        "NUMBERS" : "Your class said that you want to collect examples of numbers for a computer to recognise when numbers are "
                    },
                    "INDIVIDUAL" : {
                        "TEXT" : "You said that you want to collect examples of text for a computer to recognise when text is ",
                        "IMAGES" : "You said that you want to collect examples of images for a computer to recognise when images are ",
                        "NUMBERS" : "You said that you want to collect examples of numbers for a computer to recognise when numbers are "
                    }
                },
                "NOEXAMPLES" : {
                    "CLASS" : "So far, your class haven't collected any examples yet.",
                    "YOU" : "So far, you haven't collected any examples yet."
                },
                "DATA" : {
                    "CROWDSOURCED" : {
                        "TEXT" : "Your class has collected examples of text for a computer to use to recognise when text is ",
                        "IMAGES" : "Your class has collected examples of images for a computer to use to recognise when images are ",
                        "NUMBERS" : "Your class has collected examples of numbers for a computer to use to recognise when numbers are "
                    },
                    "INDIVIDUAL" : {
                        "TEXT" : "You have collected examples of text for a computer to use to recognise when text is ",
                        "IMAGES" : "You have collected examples of images for a computer to use to recognise when images are ",
                        "NUMBERS" : "You have collected examples of numbers for a computer to use to recognise when numbers are "
                    },
                    "COLLECTED" : {
                        "CLASS" : "They've collected: ",
                        "YOU" : "You've collected: "
                    }
                }
            }
        },
        "WHATSNEXT": {
            "TITLE": "What's next?",
            "PLEASEWAIT": "You could wait for the machine learning model to finish being trained.",
            "OFFERQUIZ": "Or, you could try the machine learning quiz below, to check what you've learned.",
            "FAIL": "The error message from the training computer is shown below. If that makes sense to you, try and fix the problem. Otherwise, it might be worth trying again in case it was just a random error.",

            "IDLE": {
                "NOLABELS" : "The next step is to go to the <a href='{{ urls.train }}'>Train</a> page. Add some labels for each of the things that you want to teach the computer to be able to recognise.",
                "ONELABEL" : {
                    "EXPLANATION": "You've only said one thing that you want the computer to be able to recognise: {{ label }}",
                    "ISTHATALL": "Is that the only thing you want the computer to be able to recognise?",
                    "NO": "<strong>No?</strong><br/>Go back to the <a href='{{ urls.train }}'>Train</a> page.<br/>Add more labels for each of the things that you want to teach the computer to be able to recognise.<br/><br/>",
                    "YES": "<strong>Yes?</strong><br/>You need to do a little more work first.<br/>For the computer to be able to learn how to recognise \"{{ label }}\", you need to give it some examples of things that aren't {{ label }}.<br/>Go back to the <a href='{{ urls.train }}'>Train</a> page and create a new label for examples of things that aren't {{ label }}. You could call it \"not-{{ label }}\"."
                },
                "LABELS" : {
                    "NO_DATA" : "The next step is to go to the <a href='{{ urls.train }}'>Train</a> page. Add examples for each of the labels.",
                    "MORE_DATA" : {
                        "KEEP_GOING": "Keep going!",
                        "MORE_EXAMPLES" : {
                            "YOU": "Go back to the <a href='{{ urls.train }}'>Train</a> page and collect more examples for each of the labels.",
                            "CLASS": "Ask your class to go back to the <a href='{{ urls.train }}'>Train</a> page and collect more examples for each of the labels."
                        },
                        "MORE_IS_BETTER" : "The more you can get, the better it should learn, but you need at least {{ minimumExamples }} examples of each as an absolute minimum."
                    },
                    "ENOUGH_DATA" : {
                        "READY_TO_START" : "Ready to start the computer's training?",
                        "START_TRAINING" : {
                            "CROWDSOURCED" : "Click the button below to start training a machine learning model using the examples your class have collected so far",
                            "INDIVIDUAL" : "Click the button below to start training a machine learning model using the examples you have collected so far"
                        },
                        "MORE_EXAMPLES" : {
                            "CROWDSOURCED" : "(Or ask your class to go back to the <a href='{{ urls.train }}'>Train</a> page if you want them to collect more examples first.)",
                            "INDIVIDUAL" : "(Or go back to the <a href='{{ urls.train }}'>Train</a> page if you want to collect some more examples first.)"
                        },
                        "WAITING_FOR_TEACHER" : "Waiting for your teacher to start the computer's training."
                    }
                }
            },
            "READY" : {
                "TEST" : {
                    "TEXT" : "Try testing the machine learning model below. Enter an example of text below, that you didn't include in the examples you used to train it. It will tell you what it recognises it as, and how confident it is in that.",
                    "IMAGES" : "Try testing the machine learning model below. Enter an example image below, that you didn't include in the examples you used to train it. It will tell you what it recognises it as, and how confident it is in that.",
                    "NUMBERS" : "Try testing the machine learning model below. Enter an example of numbers below, that you didn't include in the examples you used to train it. It will tell you what it recognises it as, and how confident it is in that."
                },
                "SCRATCH" : "If the computer seems to have learned to recognise things correctly, then you can go to Scratch and use what the computer has learned to make a game!",
                "ADDITIONAL_TRAINING" : {
                    "MORE_EXAMPLES" : {
                        "CROWDSOURCED" : "If the computer is getting too many things wrong, your class might want to go back to the <a href='{{ urls.train }}'>Train</a> page and collect some more examples.",
                        "INDIVIDUAL" : "If the computer is getting too many things wrong, you might want to go back to the <a href='{{ urls.train }}'>Train</a> page and collect some more examples"
                    },
                    "RETRAIN" : {
                        "YOU" : "Once you've done that, click on the button below to train a new machine learning model and see what difference the extra examples will make!",
                        "CLASS" : "Once you've done that, your teacher will need to train a new machine learning model."
                    }
                }
            }
        },
        "TRAINING": {
            "TITLE": "Info from training computer:",
            "STARTED": "Model started training at:",
            "STATUS": "Current model status:",
            "DETAIL": "Detail:",
            "DELETION": "Model will automatically be deleted after:",
            "LASTCHECK": "Model last checked:",
            "PROMPTREFRESH": "If this is more than a minute, you should refresh the page to get an up-to-date status"
        },
        "TESTING": {
            "INTRO": {
                "TEXT": "Try putting in some text to see how it is recognised based on your training.",
                "IMAGES": "Try putting in an image to see how it is recognised based on your training.",
                "NUMBERS": "Try putting in some numbers to see how it is recognised based on your training."
            },
            "WEBCAM": "Test with <strong>webcam</strong>",
            "DRAWING": "Test by <strong>drawing</strong>",
            "WWW": "Test with <strong>www</strong>",
            "RECOGNISED": "Recognised as  <strong>{{ testoutput }}</strong>"
        },
        "QUIZ": {
            "TITLE": "Quiz time!",
            "INTROQUESTION": "While you are waiting for the model to finish training, try answering this question.",
            "PREVIOUSLY_ATTEMPTED": "You've seen this one before - let's see if you remember what the right answer is this time!",
            "CORRECT_ANSWER": "That's right!",
            "INCORRECT_ANSWER": "No, sorry. The correct answer is shown above.",
            "NEXT_QUESTION": "Next question"
        }
    },
    "MAKES": {
        "TITLE": "Make something with your machine learning model",
        "SCRATCH2": "Make a project in the current version of Scratch",
        "SCRATCH3": "Use the new (beta) version of Scratch",
        "PYTHON": "Write Python code to use your machine learning model",
        "APPINVENTOR": "Make a mobile app for your phone or tablet"
    },
    "PYTHON": {
        "TITLE": "Using machine learning in Python",

        "NOTREADY": "Your project isn't ready to be used in Python yet.",
        "NOMODEL": "You haven't trained a machine learning model yet."
    },
    "APPINVENTOR": {
        "TITLE": "Using machine learning in App Inventor",

        "NOTREADY": "Your project isn't ready to be used in App Inventor yet.",
        "NOMODEL": "You haven't trained a machine learning model yet.",

        "BETAWARNING": "This is an early beta. Support for App Inventor is not finished, and will probably have a few bugs and problems."
    },
    "SCRATCH": {
        "TITLE": "Using machine learning in Scratch",

        "NOTREADY": "Your project isn't ready to be used in Scratch yet.",
        "NOMODEL": "You haven't trained a machine learning model yet.",

        "LAUNCH": "Open in Scratch",

        "LAUNCH_SCRATCH_BY_ITSELF": "(You can use <a href='{{ url }}' class='btn btn-default' target='_blank'>Scratch by itself</a> if you want.)",
        "GO_TO_LEARNANDTEST": "Or go to the <a href='{{ urls.learnandtest }}'>Learn &amp; Test</a> page for some tips on what to do next.",

        "MORE_BLOCKS": "Your project will add these blocks to the <span style='background-color: purple; color: white; padding-left: 7px; padding-right: 7px; white-space: nowrap;'>More Blocks</span> tab in Scripts.",
        "EXPLAIN_RECOGNISE_LABEL": "Put {{ type }} in the input for this, and it will return the label that your machine learning model recognises it as.",
        "EXPLAIN_RECOGNISE_CONFIDENCE": "This will return how confident your machine learning model is that it recognises the type of {{ type }}. (As a number from 0 - 100).",
        "EXPLAIN_LABELS": "These blocks represent the labels you've created in your project, so you can use their names in your scripts.",
        "EXPLAIN_COSTUMEIMAGE": "This block is in the Looks palette for Sprites and will return the image of the currently selected costume.",
        "SAMPLE_SCRIPT": "This means you can do something like this:",
        "SAMPLE_SCREENSHOT": "It will look something like this - except with the name of your project.",
        "EXPLAIN_STATUS": "The coloured circle next to your project name tells you if your machine learning model is okay.",
        "STATUS_GREEN": "means your model is trained and ready to go",
        "STATUS_YELLOW": "means your model hasn't finished training yet",
        "STATUS_RED": "means something went wrong. Go back to the <a href='{{ urls.learnandtest }}'>Learn &amp; Test</a> page to see what went wrong with training."
    },
    "SCRATCH3": {
        "TITLE": "Using machine learning in Scratch 3",

        "LAUNCH": "Open in Scratch 3"
    },
    "WORKSHEETS": {
        "TITLE": "Machine learning projects",

        "INTRO_1": "These projects are downloadable step-by-step guides, with explanations and colour screenshots for students to follow.",
        "INTRO_2": "Each project is a stand-alone activity, written to last for a single lesson, and will guide children to create a game or interactive project that demonstrates a real-world use of artificial intelligence and machine learning.",
        "INTRO_3": "Suggestions for new worksheets, suggestions of improvements to any of the worksheets, or contributions of new project worksheets, are all very welcome.",

        "TYPES": {
            "TITLE": "Recognising:",
            "ALL": "All project types",

            "PREFIX": "Train a computer to recognise ",

            "TEXT": "text",
            "IMAGES": "images",
            "NUMBERS": "numbers"
        },

        "LEVELS": {
            "TITLE": "Difficulty:",
            "ALL": "All difficulties",
            "BEGINNER": "Beginner projects",
            "INTERMEDIATE": "Intermediate projects",
            "ADVANCED": "Advanced projects"
        },

        "DOWNLOAD": "Download",

        "MAKETYPES": {
            "ALL": "All make types",

            "SCRATCH": "Scratch projects",
            "PYTHON": "Python projects",
            "APPINVENTOR": "App Inventor projects",

            "SCRATCH_WORKSHEET": "Worksheet for making project in Scratch",
            "PYTHON_WORKSHEET": "Worksheet for making project in Python",
            "APPINVENTOR_WORKSHEET": "Worksheet for making project in App Inventor"
        },

        "NO_WORKSHEETS": {
            "NO_MATCHES": "There aren't any project worksheets that match those filters.",
            "MAKE_YOUR_OWN": "You could adapt some of the existing worksheets or come up with a new one.",
            "CONTRIBUTE": "If you do, please consider <a href='https://github.com/IBM/taxinomitis-docs/blob/master/README.md#contributions'>contributing it for others to use</a>."
        },


        "SMARTCLASSROOM": {
            "TITLE": "Smart Classroom",
            "SUMMARY": "Teach a computer to recognise the meaning of your commands",
            "DESCRIPTION": "Create a smart assistant in Scratch that lets you control virtual devices."
        },
        "MAKEMEHAPPY": {
            "TITLE": "Make me happy",
            "SUMMARY": "Teach a computer to recognise compliments and insults",
            "DESCRIPTION": "Create a character in Scratch that smiles if you say nice things to it and cries if you say mean things to it."
        },
        "SNAP": {
            "TITLE": "Snap!",
            "SUMMARY": "Teach a computer to recognise what icons look like",
            "DESCRIPTION": "Make a card game in Scratch that learns to recognise pictures of your card."
        },
        "CHAMELEON": {
            "TITLE": "Chameleon",
            "SUMMARY": "Teach a computer to recognise colours",
            "DESCRIPTION": "Make a chameleon in Scratch that changes colour to match its background"
        },
        "MAILMANMAX": {
            "TITLE": "Mailman Max",
            "SUMMARY": "Teach a computer to recognise handwriting",
            "DESCRIPTION": "Make a postal sorting office in Scratch that can recognise handwritten postcodes on envelopes."
        },
        "CARORCUP": {
            "TITLE": "Car or cup",
            "SUMMARY": "Teach a computer to recognise pictures of objects",
            "DESCRIPTION": "Train the computer to be able to sort photos into groups."
        },
        "FACELOCK": {
            "TITLE": "Face Lock",
            "SUMMARY": "Teach a computer to recognise faces",
            "DESCRIPTION": "Make a phone in Scratch that unlocks if it recognises your face."
        },
        "JOURNEYTOSCHOOL": {
            "TITLE": "Journey to school",
            "SUMMARY": "Teach a computer to make predictions",
            "DESCRIPTION": "Train the computer to be able to predict how you travel to school in the morning."
        },
        "SHYPANDA": {
            "TITLE": "Shy Panda",
            "SUMMARY": "Teach a computer to recognise pictures",
            "DESCRIPTION": "Make a dancing panda that gets shy and stops dancing if it sees you looking."
        },
        "VIRTUALPET": {
            "TITLE": "Virtual Pet",
            "SUMMARY": "Teach a computer to recognise pictures",
            "DESCRIPTION": "Train the computer to recognise what you're doing so you can look after a virtual pet."
        },
        "PACMAN": {
            "TITLE": "Pac-Man",
            "SUMMARY": "Teach a computer to play a game",
            "DESCRIPTION": "Create a Pac-Man game in Scratch that learns how to avoid the ghost."
        },
        "CHATBOTS": {
            "TITLE": "Chatbots",
            "SUMMARY": "Teach a computer to recognise questions",
            "DESCRIPTION": "Create a chatbot that can answer questions about a topic of your choice."
        },
        "TOURISTINFO": {
            "TITLE": "Tourist Info",
            "SUMMARY": "Teach a computer to make recommendations",
            "DESCRIPTION": "Create a mobile app in Scratch that recommends tourist attractions based on people's interests."
        },
        "SORTINGHAT": {
            "TITLE": "Sorting Hat",
            "SUMMARY": "Teach a computer to recognise use of language",
            "DESCRIPTION": "Create a Sorting Hat like in Harry Potter, that puts you in a school House based on what you say."
        },
        "ROCKPAPERSCISSORS": {
            "TITLE": "Rock, Paper, Scissors",
            "SUMMARY": "Teach a computer to recognise shapes",
            "DESCRIPTION": "Make a Rock, Paper, Scissors game in Scratch that learns to recognise hand shapes."
        },
        "JUDGEABOOK": {
            "TITLE": "Judge a book",
            "SUMMARY": "Teach a computer to recognise visual style",
            "DESCRIPTION": "Make a game in Scratch to test whether it really is possible to judge a book by its cover."
        },
        "LOCATELARRY": {
            "TITLE": "Locate Larry",
            "SUMMARY": "Teach a computer to find something in a picture",
            "DESCRIPTION": "Make a \"Where's Wally?\"-style game in Scratch, and teach the computer to find your character."
        },
        "CONFUSED": {
            "TITLE": "Confused",
            "SUMMARY": "Teach a computer to recognise fruit",
            "DESCRIPTION": "Learn about how computers can be confused and can make mistakes if they're trained badly."
        },
        "SCHOOLLIBRARY": {
            "TITLE": "School Library",
            "SUMMARY": "Teach a computer to make recommendations",
            "DESCRIPTION": "Create a school librarian in Scratch that suggests who a reading book might be suitable for."
        },
        "WHATTWITTERTHINKS": {
            "TITLE": "What does Twitter think?",
            "SUMMARY": "Teach a computer to measure public opinion",
            "DESCRIPTION": "Create a sentiment analysis tool in Scratch to analyze discussion on Twitter"
        },
        "NOUGHTSANDCROSSES": {
            "TITLE": "Noughts & Crosses",
            "SUMMARY": "Teach a computer to play a game",
            "DESCRIPTION": "Create a noughts and crosses game in Scratch that learns how to beat you."
        },
        "TOPTRUMPS": {
            "TITLE": "Top Trumps",
            "SUMMARY": "Teach a computer to play a game",
            "DESCRIPTION": "Train a computer to be able to play the Top Trumps card game in Scratch."
        },
        "HEADLINES": {
            "TITLE": "Headlines",
            "SUMMARY": "Test the computer's ability to recognise use of language",
            "DESCRIPTION": "Train a computer to recognise headlines from national newspapers."
        }
    },
    "TEACHER": {
        "MENU": {
            "TITLE": "Administration",

            "RESTRICTIONS": {
                "TITLE": "Restrictions",
                "DESCRIPTION": "Review limits and restrictions that apply to your class"
            },
            "APIKEYS": {
                "TITLE": "API Keys",
                "TITLELONG": "Watson API Keys",
                "DESCRIPTION": "Set up IBM Watson credentials to enable your class to create machine learning models"
            },
            "STUDENTS": {
                "TITLE": "Students",
                "TITLELONG": "Student management",
                "DESCRIPTION": "Create, reset and delete logins for students in your class"
            },
            "SUPERVISION": {
                "TITLE": "Supervision",
                "DESCRIPTION": "Review projects that your students have created"
            },

            "ADVANCEDOPTIONS": "Advanced options",

            "DELETECLASS": {
                "TITLE": "Delete class",
                "DESCRIPTION": "This will delete the accounts for you and all of the students in your class"
            },

            "CANYOUHELP": {
                "TITLE": "Can you help?",
                "DESCRIPTION": "Please share your experiences and ideas for how to make the tool better"
            },

            "NOTAUTHORISED": "You are not authorized to access the teacher page for your class."
        },
        "APIKEYS": {
            "TITLE": "Administration : IBM Watson API Keys",

            "ADDNEWCREDENTIALS": "Add new credentials",
            "ADDAPIKEY": "Add new API key",
            "REMOVE": "Remove",

            "NO_TEXT_CREDENTIALS": "You don't have any Assistant credentials. This means that it will not be possible to train models for <strong>text</strong> projects.",
            "NO_IMAGE_CREDENTIALS": "You don't have any Visual Recognition API keys. This means that it will not be possible to train models for <strong>images</strong> projects.",

            "NOTAUTHORISED": "You are not authorized to access the Watson API keys used by your class.",
            "MANAGEDCLASS": "API Keys used by your class are being managed for you.",

            "HELP_STEPBYSTEP_GUIDE": "If you're not sure what to do here, please follow the <a href='https://github.com/IBM/taxinomitis-docs/raw/master/docs/pdf/machinelearningforkids-apikeys.pdf'> step-by-step guide </a>. If you'd like any help, please <strong><a style='cursor: pointer;' ui-sref='help'>get in touch</a></strong>.",

            "INTRO_WATSONASSISTANT": "Training machine learning models for <span class='mlprojecttype'>text</span> projects uses <a class='mlprojecttype' href='https://www.ibm.com/cloud/watson-assistant/'>Watson Assistant</a>",
            "INTRO_VISUALRECOGNITION": "Training machine learning models for <span class='mlprojecttype'>images</span> projects uses <a class='mlprojecttype' href='https://www.ibm.com/watson/services/visual-recognition/'>Watson Visual Recognition</a>",

            "ERROR_FETCHING_WATSONASSISTANT": "Failed to get your Watson Assistant passwords",
            "ERROR_FETCHING_VISUALRECOG": "Failed to get your Visual Recognition API keys",

            "USERNAME": "Username",
            "PASSWORD": "Password",
            "APIKEY": "API key",

            "NUMBER_OF_ML_MODELS": "Number of ML models",
            "UNKNOWN": "unknown",
            "UNLIMITED": "unlimited",

            "LIMIT_TEXT_PROJECTS": "Number of text machine learning models your students can have:",
            "LIMIT_IMAGE_PROJECTS": "Number of images machine learning models your students can have:"
        }
    },
    "HELP": {
        "CONTACT": "If you have any problems or questions, please email Dale.Lane@uk.ibm.com",
        "GETTINGSTARTED": {
            "TITLE": "Getting started?",
            "INTRO": "Download a PDF with a short getting started guide:",
            "MANAGED": "Managed class accounts",
            "MANAGEDEXPL": "For school teachers, coding group leaders, or other volunteers",
            "UNMANAGED": "Unmanaged class accounts",
            "UNMANAGEDEXPL": "For IBM employees, or teachers and coding group leaders who manage their own class accounts"
        },
        "FAQS": {
            "TITLE": "Want to know more?",
            "INTRO1": "Is something not working?",
            "INTRO2": "The list below contains the questions and issues that I hear about most often. If you see something that looks similar to your problem, click on the summary for more info.",
            "INTRO3": "If you're still stuck, or you've run into a problem I've not included in the list, sorry! Please <a href='mailto:dale.lane@uk.ibm.com'>email me</a> or <a href='https://github.com/IBM/taxinomitis/issues'>create an issue report</a> so that I can help."
        },

        "SCRATCH": {
            "TITLE": "Scratch issues",

            "Q1": "I don't know how to get Scratch working",
            "Q1-A-1": "Machine Learning for Kids uses Scratch 2. Scratch needs Adobe Flash to work, so you need to be using an operating system and a web browser that can work with Flash (so that means no iPads for now, sorry).",
            "Q1-A-2": "If you're not sure about how to enable Flash, you can            <a href='https://github.com/IBM/taxinomitis-docs/raw/master/docs/pdf/machinelearningforkids-scratchx.pdf'>download a document with some tips for getting Scratch working</a>.",

            "Q2": "The \"Load Project\" and \"Save Project\" menus in Scratch don't work",
            "Q2-A-1": "If you're using Safari on macOS and the Scratch menus \"File -&gt; Load Project\" and \"File -&gt; Save Project\" menus aren't working, it might be that you're running in Safe Mode.",
            "Q2-A-2": "<a href='https://github.com/IBM/taxinomitis-docs/raw/master/docs/pdf/safari-scratch-safemode.pdf'>Follow the instructions here</a> for how to check and fix this.",

            "Q3": "Machine learning classifier blocks in Scratch don't work",
            "Q3-A-1": "Occassionally, the Scratch blocks for your machine learning model can lose the connection to the server. When this happens, they will stop returning results.",
            "Q3-A-2": "You can check whether this has happened using the coloured status light in the \"More Blocks\" palette.",
            "Q3-A-3": "If the status light next to your machine learning Scratch blocks is red, that normally means something is wrong. It might be a temporary problem. Try saving your project (using 'File' -&gt; 'Save Project'), then refresh the browser page. If the status light goes green after the page reloads, you can load your project (using 'File' -&gt; 'Load Project') to pick up where you left off.",
            "Q3-A-4": "If the status light is still red after reloading the page, then there is probably something wrong with the machine learning model. Try going to the \"Learn &amp; Test\" page for the project, which is where any error messages about your model can be found.",
            "Q3-A-5": "If the status light next to your machine learning Scratch blocks is green, then the blocks should be working. If you're not getting the responses you expect from them, try going to the \"Learn &amp; Test\" page and checking what results your model returns.",

            "Q5": "Can I use any version of Scratch?",
            "Q5-A-1": "You need to use the versions of Scratch that are provided by the Machine Learning for Kids site. They can be launched by clicking the Scratch, or 'Scratch 3', buttons from your project page.",

            "Q6": "Scratch 3 is only saving projects to the 'Downloads' folder",
            "Q6-A-1": "When you click 'File' -> 'Save to your computer' in Scratch 3, your Scratch project is saved to your computer.",
            "Q6-A-2": "Some teachers reported a problem that this saved to the Downloads folder, on a computer where students don't have access in Windows to the Downloads folder. The result was that students were not able to access their saved projects.",
            "Q6-A-3": "If you have this problem, you need to look in your web browser settings for a setting like 'Ask where to save each file before downloading'. If you enable that, your students will be able to choose where their projects are saved."
        },

        "TRAININGUI": {
            "TITLE": "Training UI issues",

            "Q1": "Dragging images into training buckets (for image projects) doesn't work",
            "Q1-A-1": "Dragging images into the training buckets doesn't work if you're using Safari or Internet Explorer.",
            "Q1-A-2": "Sorry about this. If you can use another browser like Firefox or Chrome, please do that. Otherwise, you can click the \"www\" button and paste in the URL of training pictures instead."
        },

        "MODELS": {
            "TITLE": "Errors training machine learning models",

            "Q1": "\"No Watson credentials have been set up\"",
            "Q1-A-1": "Machine learning models in the tool are created using IBM Watson APIs.",
            "Q1-A-2": "If you have an \"unmanaged\" class account, then your teacher or group leader will need to provide Watson API credentials from IBM Cloud for this to work. Step-by-step instructions for how they can do this are in the \"Getting Started\" document at the top of this page.",

            "Q2": "\"Watson credentials being used by your class were rejected\"",
            "Q2-A-1": "Machine learning models in the tool are created using IBM Watson APIs.",
            "Q2-A-2": "If you have an \"unmanaged\" class account, then your teacher or group leader will have provided Watson API credentials from IBM Cloud for this to work (as described in the \"Getting Started\" document at the top of this page).",
            "Q2-A-3": "However, the credentials that were provided are currently not working. The most likely reason is that the credentials were deleted from IBM Cloud since they were originally provided. If that isn't the case, the teacher or group leader who provided the Watson credentials needs to go back to the IBM Cloud dashboard to check the status of the Watson Assistant or Visual Recognition service that they created.",

            "Q3": "\"Watson Assistant API keys have no more workspaces available\"",
            "Q3-A-1": "Machine learning models in the tool are created using IBM Watson APIs.",
            "Q3-A-2": "Watson Assistant credentials created by teachers have a limit on the number of machine learning models that they can be used to create. This is displayed in the IBM Cloud UI where the credentials were created, where they are called \"workspaces\".",
            "Q3-A-3": "If this limit is exceeded, attempts to train new machine learning models will fail, and this message will be displayed:",
            "Q3-A-4": "Your class already has created their maximum allowed number of models. Please let your teacher or group leader know that their \"Watson Assistant API keys have no more workspaces available\".",
            "Q3-A-5": "If a student who has a successfully trained model then deletes their model, this will free up a workspace for use by another student.",
            "Q3-A-6": "One way to avoid this error in future would be smaller class sizes. If there are fewer students than the number of workspaces supported by the Watson Assistant credentials, then the limits will not be hit.",
            "Q3-A-7": "Another way to avoid this error is to add additional Watson Assistant API keys to the class, or to use a Watson Assistant instance \"plan\" that has higher limits.",

            "Q4": "\"Watson Visual Recognition API keys have no more classifiers available\"",
            "Q4-A-1": "Machine learning models in the tool are created using IBM Watson APIs.",
            "Q4-A-2": "Watson Visual Recognition credentials created by teachers have a limit on the number of machine learning models that they can be used to create. This is displayed in the IBM Cloud UI where the credentials were created, where they are called \"custom classifiers\".",
            "Q4-A-3": "If this limit is exceeded, attempts to train new machine learning models will fail, and this message will be displayed:",
            "Q4-A-4": "Your class already has created their maximum allowed number of models. Please let your teacher or group leader know that their \"Watson Visual Recognition API keys have no more classifiers available\".",
            "Q4-A-5": "If a student who has a successfully trained model then deletes their model, this will free up a custom classifier for use by another student.",
            "Q4-A-6": "One way to avoid this error in future would be smaller class sizes. If there are fewer students than the number of custom classifiers supported by the Watson Visual Recognition credentials, then the limits will not be hit.",
            "Q4-A-7": "Another way to avoid this error is to add additional Watson Visual Recognition API keys to the class, or to use a Watson Visual Recognition instance \"plan\" that has higher limits.",

            "Q5": "\"Watson ... is currently rate limiting their API key\"",
            "Q5-A-1": "Machine learning models in the tool are created using IBM Watson APIs.",
            "Q5-A-2": "If you have an \"unmanaged\" class account, then your teacher or group leader will need to provide Watson API credentials from IBM Cloud for this to work.",
            "Q5-A-3": "If free accounts are created, they will apply a limit on the rate of requests for new machine learning models. In normal usage, this will not impact the class. However, if students get a \"no more workspaces available\" or \"no more classifiers available\" error (as described above) but then continue to click the \"Train new Machine Learning model\" button multiple times per second, for several minutes, then the rate limiting will apply.",
            "Q5-A-4": "A message like this will be displayed to students in this case:",
            "Q5-A-5": "Your class is making too many requests to create machine learning models at too fast a rate. Please stop now and let your teacher or group leader know that \"the Watson Assistant service is currently rate limiting their API key\"",
            "Q5-A-6": "The rate limiting isn't applied by, or under the control of, the Machine Learning for Kids site. It is usually temporary, and is best resolved by waiting for a short time.",
            "Q5-A-7": "If students are clicking the \"Train new Machine Learning model\" button and getting \"no more workspaces available\" or \"no more classifiers available\" errors (as described above), then they should be aware that repeatedly clicking the button will not resolve the issue, and will in fact make the situation worse for the rest of the class.",

            "Q6": "I've been waiting for a model to train for ages!",
            "Q6-A-1": "Try refreshing the page.",
            "Q6-A-2": "The page should check on the status of the machine learning model every 30 seconds, but very occassionally it stops checking, so you might be waiting for the model when it is actually ready for you.",
            "Q6-A-3": "If it's been more than a few minutes, it's worth checking by refreshing / reloading the page.",
            "Q6-A-4": "If it's been more than ten minutes, it might be worth considering restarting (click the Cancel button and then click the button to train a new machine learning model again)."
        },

        "TEACHERUI": {
            "TITLE": "Teacher / Admin UI issues",

            "Q2": "Missing student account from the list in the teacher's page",
            "Q2-A-1": "User management for Machine Learning for Kids is implemented using the third party service, <a href=\"https://auth0.com/\">Auth0</a>.",
            "Q2-A-2": "Occassionally, the list of students that Auth0 returns can get a little out of date, and fail to reflect students that have recently been created (or similarly, still show students that have been recently deleted).",
            "Q2-A-3": "In these instances, the students have normally been successfully created (or deleted) and it is just that the list of students being displayed doesn't reflect recent updates.",
            "Q2-A-4": "Auth0 will normally report such incidents on their status page as <a href='https://status.auth0.com/incidents/0sk1d3hjlw0m'>user indexing delays</a> or <a href='https://status.auth0.com/incidents/t8995b9jggx5'>problems with their Search API</a>.",
            "Q2-A-5": "The best thing to do in these cases is to wait for the Auth0 indexing to catch up.",

            "Q4": "Why are machine learning models automatically deleted?",
            "Q4-A-1": "This was a feature requested by schools when Machine Learning for Kids was first developed. It came from the fact that there is a limit for how many machine learning models a class can have at any given time, and a need to make it easy to manage this limit.",
            "Q4-A-2": "Rather than requiring kids to have to clean up after a lesson and delete their models (in order to allow the next class to be able to create models), the tool can automatically clean up by deleting the models after the lesson is over. This makes it easy to run the next lesson, and the next lesson after that, without manual clean-ups in between.",
            "Q4-A-3": "The time limit before models are deleted is configurable. In a school, where lessons are 1 or 2 hours long, deleting models after two hours might be sensible. For a weekly coding club, six days might be a better fit to make sure that models are cleared up before each new club session.",
            "Q4-A-4": "To check the time limit for your class, visit the <a href='https://machinelearningforkids.co.uk/#!/teacher/restrictions'>Restrictions section of your Teacher page</a>.",
            "Q4-A-5": "To change the time limit for your class, <a href='mailto:dale.lane@uk.ibm.com'>please send me an email</a>.",
            "Q4-A-6": "<em>Note: Only machine learning models are automatically deleted, not the training data that was used to create them. So if a model is automatically deleted for a project that a student is still working on, they can always just click the \"Train\" button again to create the model again.</em>"
        },

        "ACCOUNTISSUES": {
            "TITLE": "Account issues",

            "Q1": "What is the difference between creating accounts or using \"Try it now\"?",
            "Q1-A-1": "Using \"Try it now\" to means there is no need to log on or create an account. There are no passwords for students to have to remember, and no need for teachers to have to provide personal information. It also saves teachers the time needed to manage student accounts.",
            "Q1-A-2": "However, creating an account does enable additional features. Students can save their work and come back to it in a later lesson. They can work on a project together with other students in their class. They can log on from home and show their family what they've made.",
            "Q1-A-3": "A summary of the differences is shown below:",

            "CREATE_ACCOUNT": "Create an account",
            "TRAINMODELS": "Train machine learning models to recognise...",
            "USE_SCRATCH": "Use machine learning models from Scratch",
            "CREATE_PROJECTS": "Create projects",
            "ONE_PROJECT": " 1 project ",
            "MULTIPLE_PROJECTS": " Multiple projects ",
            "SAVE_PROJECTS": "Save and load projects",
            "WORK_ON_PROJECTS": "Work on machine learning projects...",
            "FEW_HOURS": " for a few hours ",
            "UNTIL_DELETION": " until you delete them ",
            "ONE_COMPUTER": " from one computer ",
            "ONLINE": " anywhere online ",
            "BY_YOURSELF": " by yourself ",
            "WITH_CLASSMATES": "with classmates",

            "Q2": "I've created a class account but my teacher's logon isn't working",
            "Q2-A-1": "You need to verify your email address before you'll be able to log on.",
            "Q2-A-2": "When you created the class account, an email will be sent to the email address you provided, with a link to click on. If you click on that link, your email address will be verified and the class account will be activated. You should be able to log on now.",
            "Q2-A-3": "If you haven't seen the verify email yet, make sure it's not gone into your spam folder.",
            "Q2-A-4": "If you still can't find it, <a href='mailto:dale.lane@uk.ibm.com'>let me know</a> and I'll try and help.",

            "Q3": "Deleting accounts",
            "Q3-A-1": "Student accounts",
            "Q3-A-2": "Students cannot delete their own accounts.",
            "Q3-A-3": "A teacher can delete a student account at any time by visiting the \"Teacher\" page  and clicking the \"Delete student account\" button next to the student account you want to delete.",
            "Q3-A-4": "This will delete all information stored about that student and all of their projects and machine learning models.",
            "Q3-A-5": "It cannot be undone.",
            "Q3-A-6": "Teacher accounts",
            "Q3-A-7": "Deleting a teacher account will delete the entire class and all of the student accounts in it. It cannot be undone.",
            "Q3-A-8": "This can be done by clicking the \"Delete Class\" button in the Advanced options section of <a href='https://machinelearningforkids.co.uk/teacher'>your Teacher page</a>",

            "Q4": "What information is stored about users?"

        }
    }
}
