{
    "APP": {
        "TITLE": "Apprentissage automatique (Machine learning) pour les enfants",

        "BACK": "Retour",
        "BACKTOPROJECT": "&lt; Revenir au projet",
        "ERROR": "Erreur :",
        "WARNING": "Attention :",
        "INFO": "Information :",

        "ADD": "Ajouter",
        "CANCEL": "Annuler",
        "DELETE": "Effacer",
        "EDIT": "Editer",
        "TEST": "Tester",

        "ABOUT": "A propos",
        "TEACHER": "Enseignants",
        "PROJECTS": "Projets",
        "WORKSHEETS": "Plan de travail",
        "NEWS": "Nouvelles",
        "HELP": "Aide",
        "LOGIN": "Connexion",
        "LOGOUT": "Déconnexion",

        "BETA": "Beta",
        "INCOMPLETE": "Incomplète !"
    },
    "ABOUT": {
        "TITLE": "Apprentissage automatique (Machine learning) pour les enfants",
        "IN6SECS": "En 6 secondes...",
        "IN20MINS": "En 20 minutes...",
        "WHAT": {
            "TITLE": "Quoi ?",
            "BODY" : "Cet outil présente l'apprentissage machine (machine learning) en fournissant des expériences pratiques pour entrainer les systèmes d'apprentissage machine et construire des réalisations avec eux. <br/> <br/>Il fournit un environnement guidé, facile à utiliser pour entraîner des modèles d'apprentissage machine pour classer du texte, des nombres ou reconnaître des images. <br/> <br/>Ce projet s'appuie sur les efforts existants pour introduire et enseigner le codage aux enfants, en ajoutant ces modèles à <a href='https://scratch.mit.edu/about' target='_blank'>Scratch</a> (une plate-forme de codage pédagogique largement utilisée), permettant aux enfants de créer des projets et de construire des jeux avec les modèles d'apprentissage machine qu'ils ont entraîner. <br/><br/>Pour en savoir plus, regardez : "
        },
        "WHY": {
            "TITLE": "Pourquoi ?",
            "BODY": "L'apprentissage machine est utilisé partout autour de nous. Nous utilisons tous des systèmes d'apprentissage automatique tous les jours - tels que les filtres anti-spam, les moteurs de recommandation, les services de traduction, les robots de discussion et les assistants numériques, les moteurs de recherche et les systèmes de détection des fraudes. <br/><br/>Il sera bientôt normal que les systèmes d'apprentissage automatique conduisent nos voitures et aident les médecins à poser un diagnostic et à traiter nos maladies. <br/><br/>Il est important que les enfants soient conscients du fonctionnement de notre monde. La meilleure façon de comprendre les capacités et les implications de cette technologie est d'être capable par eux-mêmes de construire des solutions avec cette technologie <br/><br/>Pour en savoir plus, lisez : <a target='_blank' class='btn btn-primary' href='http://dalelane.co.uk/blog/?p=3513'>'Introducing Machine Learning to kids'</a>"
        },
        "TECH": {
            "TITLE": "Technologie",
            "BODY": "Ce service est entièrement basé sur les technologies web et ne requiert aucune installation ou paramétrage compliqué pour être utilisé. <br/><br/>Il a été conçu pour être utilisé en classe ou dans des activités parascolaires avec des enfants, et il propose une page permettant aux enseignants ou aux responsables de groupe de gérer et d'administrer l'accès des élèves.<br/><br/>Il a été conçu et réalisé par <a target='_blank' href='http://dalelane.co.uk/'>Dale Lane</a> et utilise des API depuis <a target='_blank' href='https://www.ibm.com/watson/developercloud/'>IBM Watson Developer Cloud</a>.",
            "LOGIN": "Pour démarrer : "
        }
    },
    "NEWS": {
        "TITLE": "Nouvelles",
        "UPDATES": {
            "TITLE": "Nouvelles & Mise à jour",
            "DESCRIPTION": "Nouvelles et mise à jour de la part de @MLforKids"
        },
        "MENTIONS": {
            "TITLE": "Mentions & Média",
            "DESCRIPTION": "charge les Mentions &amp; Media depuis wakelet.com"
        }
    },
    "ERRORS": {
        "PAGENOTFOUND": "Page absente",
        "NOTLOGGEDIN": "Pas connecté",

        "MISSINGPROJECTID": "Le projet id. n'existe pas. Revenir à ",
        "IFPERSISTENT": "Si celà continue, veuillez ",

        "LETMEKNOW": "faites le moi savoir"
    },
    "WELCOME": {
        "TITLE": "Apprendre à l'ordinateur comment jouer",
        "GET_STARTED": "Démarrez",
        "LEARN_MORE": "En savoir plus",
        "ADMIN_LABEL": "Aller à la page d'<strong>Administration</strong>",
        "PROJECT_LABEL": "Aller à vos <strong>Projets</strong>",
        "STEP_1_TEXT": "Recueillez des exemples de choses que vous voulez être capable de reconnaître",
        "STEP_2_TEXT": "Utilisez les exemples pour entraîner un ordinateur afin qu'il soit capable de les reconnaître",
        "STEP_3_TEXT": "Réaliser un jeu dans Scratch qui utilise la capacité de l'ordinateur à les reconnaître"
    },
    "LOGIN": {
        "TITLE": "Commencez avec l'apprentissage machine",
        "WELCOME": "Bienvenue ! C'est formidable que vous soyez intéressé d'avoir un compte pour vous connecter à Machine Learning for Kids.",
        "ALREADY_LOGGEDIN": "<strong>Info : </strong> déja connecté",
        "ERROR": "<strong>Erreur : </strong> {{ message }}",
        "ERROR_HELP": "Si cela continue, veuillez visiter notre section d'aide",
        "FIRST_TIME": "Ici pour la première fois ? ",
        "SIGN_UP": "Se connecter",
        "WHY_REGISTER": "Pourquoi s'enregistrer ? ",
        "WHY_REGISTER_INTRO_1": "<strong> Il n'est pas utile de s'enregistrer ou de créer un compte</strong> pour utiliser Machine Learning for Kids, mais si vous le faites, celà vous permettra de d'utiliser quelques fonctionnalités supplémentaires.",
        "WHY_REGISTER_INTRO_2": "La grille ci-dessous explique la différence entre ce que vous pouvez faire si vous cliquez sur \"Essayer le maintenant\" sans vous inscrire, et ce que vous pouvez faire si vous créez un compte pour vous connecter.",
        "ALREADY_REGISTERED": "Déja enregistré ?",
        "LOGIN": "Se connecter",
        "FORGOT_DETAILS": "Informations oubliées ?",
        "TRY_TITLE": "Essayer sans s'enregistrer",
        "TRY_NOW": "Essayer maintenant",
        "WHO_YOU": "Qui êtes-vous ?",
        "TEACHER": "Un enseignant ou un animateur d'atelier de codage",
        "STUDENT": "Un élève",
        "FORGOT_TEXT": "Avez-vous oublié votre nom d'utilisateur ou votre mot de passe ? Pas de soucis, nous celà arrive à tout le monde.",
        "ARE_YOU_A_STUDENT": "Êtes-vous un élève ?",
        "ARE_YOU_A_STUDENT_INTRO_1": "Si votre classe utilise déjà cet outil, demandez à votre enseignant ou au responsable de votre groupe de codage de vous créer un compte.",
        "ARE_YOU_A_STUDENT_INTRO_2": "Si votre classe n'utilise pas encore l'outil, demandez à votre enseignant ou au responsable de votre groupe de codage de vous contacter.",
        "RESET_STUDENT_PASSWORD_1": "Si vous êtes un élève, nous n'avons pas votre adresse de courriel pour pouvoir vous envoyer votre mot de passe réinitialisé.",
        "RESET_STUDENT_PASSWORD_2": "Mais ce n'est pas un problème !",
        "RESET_STUDENT_PASSWORD_3": "Il suffit de demander à votre enseignant ou à l'animateur du groupe qui vous a inscrit en premier. Ils pourront réinitialiser votre mot de passe à partir de leur page d'administration."
    },
    "SIGNUP": {
        "TEACHER": {
            "TITLE": "Êtes-vous enseignant ou responsable d'un club de codage ?",
            "INFO1": "Si vous souhaitez un accès pour vos élèves, veuillez créer un compte de classe ci-dessous.",
            "INFO2": "Il existe deux types de comptes de classe selon la personne qui les crée."
        },
        "UNMANAGED": {
            "TITLE": "Créer un compte de classe <strong>non géré</strong>",
            "INTRO": "Si vous êtes heureux d'ouvrir et de gérer le compte de classe vous-même, vous pouvez le faire maintenant !",
            "LISTINTRO": "Vous aurez besoin de : ",
            "LIST_CREATEACCOUNT": "Créer un compte sur IBM Cloud",
            "LIST_CREATEAPIKEYS": "Créer des clés API pour les services cloud de Watson qui sont nécessaires à la formation des modèles d'apprentissage machine",
            "LIST_ENTERAPIKEYS": "Entrez les clés API dans cet outil d'apprentissage machine pour les enfants",
            "HELP": "Des instructions pas à pas (avec des captures d'écran) sont disponibles pour cela."
        },
        "MANAGED": {
            "TITLE": "Créer un compte de classe <strong> géré </strong>",
            "INTRO": "Si vous souhaitez que Dale configure le compte de classe, utilisez le bouton ci-dessous pour envoyer un courrier électronique en anglais avec les informations suivantes :",
            "LIST_NUMBEROFSTUDENTS": "De combien de comptes étudiants aurez vous besoin approximativement",
            "LIST_NAMEOFSCHOOL": "Le nom de l'école ou du groupe de codage auquel le compte est destiné",
            "EMAIL": "Adresse courriel"
        }
    },
    "PROJECTS": {
        "TITLE": "Vos projets d'apprentissage machine",
        "ADDNEWPROJECT": "Ajouter un nouveau projet",
        "CREATEFIRSTPROJECT": "Cliquez sur le bouton 'plus' à droite pour créer votre premier projet.",
        "RECOGNISING": "Reconnaissance",
        "AS": "comme"
    },
    "NEWPROJECT": {
        "TITLE": "Démarrer un nouveau projet d'apprentissage machine",
        "PROJECT_NAME": {
            "TITLE": "Nom du projet",
            "NOTES": "Donnez un nom à votre projet pour décrire ce que vous allez essayer d'apprendre à l'ordinateur à reconnaître."
        },
        "WHOLE_CLASS_PROJECT": {
            "TITLE": "Projet pour la classe entière ?",
            "NOTES_1": "Cochez cette case si vous voulez que toute votre classe puisse travailler ensemble sur ce projet.",
            "NOTES_2": "Ceci est utile pour les projets qui enseignent le travail collaboratif (crowd-sourcing) en tant qu'approche de formation pour les projets d'apprentissage machine."
        },
        "TYPES": {
            "LABEL": "Reconnaissance",
            "NOTES_1": "Quel type de chose voulez-vous apprendre à l'ordinateur à reconnaître ?",
            "NOTES_2": "Pour les mots, les phrases ou les paragraphes, choisissez \"text\"",
            "NOTES_3": "Pour les photos, les diagrammes et les images, sélectionnez \"images\"",
            "NOTES_4": "Pour les ensembles de nombres ou les choix multiples, sélectionnez \"numbers\""
        },
        "LANGUAGE": {
            "LABEL": "Langue",
            "NOTES": "En quelle langue le texte de ce projet sera-t-il rédigé ?"
        },
        "FIELDS": {
            "TYPE": {
                "TITLE": "Type de valeur",
                "NUMBER": "nombre",
                "MULTIPLE_CHOICE": "choix multiple"
            },
            "CHOICES": {
                "TITLE": "Choix:",
                "LABEL": "ajouter un choix"
            },
            "NEWFIELD": {
                "DESCRIBE_FIELD": "Donnez un nom à ce champ pour décrire la valeur",
                "MULTICHOICE": "Si l'on peut dire qu'il s'agit d'un choix parmi quelques options, sélectionnez \"multiple-choice\".",
                "ADD_FIRST_FIELD": "Saisissez un choix à utiliser dans votre liste à choix multiples, puis appuyez sur Entrée.",
                "ADD_ANOTHER_FIELD": "Tapez un autre choix à utiliser dans votre liste à choix multiples, puis appuyez sur Entrée."
            },
            "NEWVALUE": {
                "ADD_FIRST_VALUE": "Commencez à décrire les valeurs que vous allez inclure avec chaque exemple pour entraîner l'ordinateur en cliquant sur le bouton 'Ajouter une valeur'.",
                "VALUES_LIMIT": "Vous n'avez pas droit à plus de 10 valeurs dans un projet."
            }
        },
        "CREATE": "Créer",
        "ERRORS": {
            "REQUIRED": "Ceci est nécessaire !",
            "TOOLONG": "C'est trop long !"
        }
    },
    "PROJECT": {
        "TRAIN": {
            "TITLE": "Entrainer",
            "BODY": "Recueillez des exemples de ce que vous voulez que l'ordinateur reconnaisse"
        },
        "LEARNANDTEST": {
            "TITLE": "Apprendre &amp; Tester",
            "BODY": "Utilisez les exemples pour apprendre à l'ordinateur à les reconnaître"
        },
        "MAKES": {
            "TITLE": "Faire",
            "BODY": "Utilisez le modèle d'apprentissage machine que vous avez formé pour créer un jeu ou une application, en Scratch ou en Python."
        },
        "SCRATCH": {
            "TITLE": "Scratch",
            "BODY": "Utilisez le modèle d'apprentissage machine que vous avez entraîné pour créer un jeu avec Scratch."
        },
        "PYTHON": {
            "TITLE": "Python",
            "BODY": "Utilisez le modèle d'apprentissage machine que vous avez entraîné dans un programme Python."
        },
        "APPINVENTOR": {
            "TITLE": "App Inventor",
            "BODY": "Créez une application mobile qui utilise votre modèle d'apprentissage automatique."
        },
        "SCRATCH3": {
            "TITLE": "Scratch 3",
            "BODY": "Utilisez votre modèle d'apprentissage machine avec la nouvelle version de Scratch."
        }
    },
    "TRAINING": {
        "TITLE": "Entraînement",
        "ADDLABEL": "Ajouter une nouvelle étiquette",
        "CREATEFIRSTLABEL": "Cliquez sur le bouton 'plus' à droite pour ajouter votre premier support d'entraînement.",
        "CROWDSOURCEDEMPTY": "Rafraîchissez cette page une fois que votre professeur aura créé les supports d'entraînement.",
        "ADDEXAMPLE": "Ajouter un exemple",
        "ADDURL": "www",
        "ADDWEBCAM": "webcam",
        "ADDDRAWING": "dessin",
        "DRAGIMAGES": "Faites glisser les images depuis d'autres fenêtres du navigateur et déposez-les ici",
        "NEWLABEL": {
            "INTRO": "Entrer une nouvelle étiquette pour la reconnaissance",
            "ERROR": "N'utilisez que des lettres et des chiffres sur les étiquettes."
        },
        "NEWEXAMPLE": {
            "INTRO": "Saisissez un exemple de ",
            "INTROURL": "Entrez l'URL d'une image qui est un exemple de",
            "INTRODRAWING": "Dessinez un nouvel exemple de",
            "INTROWEBCAM": "Ajouter un nouvel exemple de",
            "ERROR": "Vous n'êtes pas autorisé à utiliser les tabulations ou les nouvelles lignes.",
            "REQUIRED": "Vous devez inclure des valeurs pour toutes les zones dans un exemple",
            "PATTERNNUMBER": "Ça ne ressemble pas à un nombre.",
            "PATTERNURL": "Ceci doit être l'adresse web d'une image",
            "WEBCAMFAIL": "Désolé ! Nous n'avons pas réussi à faire fonctionner une webcam pour vous.",
            "WEBCAMERROR": "Le message que nous avons reçu de votre navigateur web était :"
        }
    },
    "MODELS": {
        "TITLE": "Modèles d'apprentissage machine",
        "TRAIN": "Entraîner un nouveau modèle d'apprentissage machine",
        "CANCEL": "Annuler l'entraînement",
        "DELETE": "Supprimer ce modèle",
        "TEST_CANVAS": "Dessinez quelque chose pour tester votre modèle",
        "TEST_WEBCAM": "Prenez une photo pour tester votre modèle",
        "WHATHAVEYOUDONE": {
            "TITLE": "Qu'avez vous accompli ?",
            "PLEASEWAIT": "Cela prend normalement quelques minutes, mais cela peut prendre un peu plus de temps si l'ordinateur d'entraînement est très occupé.",
            "FAIL": "Malheureusement, quelque chose a mal tourné.",

            "TRAINING" : {
                "CROWDSOURCED" : {
                    "TEXT" : "Votre classe est en train d'entraîner un modèle d'apprentissage automatique à l'aide des exemples de textes que vous avez tous recueillis.",
                    "IMAGES" : "Votre classe est en train d'entraîner un modèle d'apprentissage automatique à l'aide des exemples d'images que vous avez tous recueillis.",
                    "NUMBERS" : "Votre classe est en train d'entraîner un modèle d'apprentissage automatique à l'aide des exemples de chiffres que vous avez tous recueillis."
                },
                "INDIVIDUAL" : {
                    "TEXT" : "Vous avez commencé à entraîner un modèle d'apprentissage automatique à l'aide des exemples de textes que vous avez recueillis.",
                    "IMAGES" : "Vous avez commencé à entraîner un modèle d'apprentissage automatique à l'aide des exemples d'images que vous avez recueillis.",
                    "NUMBERS" : "Vous avez commencé à entraîner un modèle d'apprentissage automatique à l'aide des exemples de nombres que vous avez recueillis."
                },
                "SINCE": "La machine s'entraîne depuis"
            },
            "READY" : {
                "CROWDSOURCED" : {
                    "TEXT" : "Votre classe a entraîné un modèle d'apprentissage automatique pour reconnaître quand le texte est ",
                    "IMAGES" : "Votre classe a entraîné un modèle d'apprentissage automatique pour reconnaître quand les images sont ",
                    "NUMBERS" : "Votre classe a entraîné un modèle d'apprentissage automatique pour reconnaître quand les nombres sont "
                },
                "INDIVIDUAL" : {
                    "TEXT" : "Vous avez entraîné un modèle d'apprentissage automatique pour reconnaître quand le texte est ",
                    "IMAGES" : "Vous avez entraîné un modèle d'apprentissage automatique pour reconnaître quand les images sont ",
                    "NUMBERS" : "Vous avez entraîné un modèle d'apprentissage automatique pour reconnaître quand les nombres sont "
                },
                "CREATED" : {
                    "TEACHER" : "Votre professeur a créé le modèle sur ",
                    "YOU" : "Vous avez créé le modèle sur "
                },
                "TRAINING" : {
                    "CLASS" : "Votre classe a recueilli : ",
                    "YOU" : "Vous avez recueilli : "
                }
            },
            "ERROR": {
                "CROWDSOURCED" : {
                    "CLASS" : {
                        "TEXT" : "Votre enseignant a essayé d'entraîner un modèle d'apprentissage automatique à l'aide des exemples de textes que votre classe a recueillis.",
                        "IMAGES" : "Votre enseignant a essayé d'entraîner un modèle d'apprentissage automatique à l'aide des exemples d'images que votre classe a recueillis.",
                        "NUMBERS" : "Votre enseignant a essayé d'entraîner un modèle d'apprentissage automatique à l'aide des exemples de nombres que votre classe a recueillis."
                    },
                    "YOU" : {
                        "TEXT" : "YVous avez essayé d'entraîner un modèle d'apprentissage automatique à l'aide des exemples de textes que votre classe a recueillis.",
                        "IMAGES" : "Vous avez essayé d'entraîner un modèle d'apprentissage automatique à l'aide des exemples d'images que votre classe a recueillis.",
                        "NUMBERS" : "Vous avez essayé d'entraîner un modèle d'apprentissage automatique à l'aide des exemples de nombres que votre classe a recueillis."
                    }
                },
                "INDIVIDUAL" : {
                    "TEXT" : "Vous avez essayé d'entraîner un modèle d'apprentissage automatique à l'aide des exemples de textes que vous avez recueillis.",
                    "IMAGES" : "Vous avez essayé d'entraîner un modèle d'apprentissage automatique à l'aide des exemples d'images que vous avez recueillis.",
                    "NUMBERS" : "Vous avez essayé d'entraîner un modèle d'apprentissage automatique à l'aide des exemples de nombres que vous avez recueillis."
                }
            },
            "IDLE" : {
                "NOLABELS" : {
                    "CROWDSOURCED" : {
                        "TEXT" : "Votre classe a dit que vous vouliez recueillir des exemples de textes.",
                        "IMAGES" : "Votre classe a dit que vous vouliez recueillir des exemples d'images.",
                        "NUMBERS" : "Votre classe a dit que vous vouliez recueillir des exemples de nombres."
                    },
                    "INDIVIDUAL" : {
                        "TEXT" : "Vous avez dit que vous vouliez recueillir des exemples de textes.",
                        "IMAGES" : "Vous avez dit que vous vouliez recueillir des exemples d'images.",
                        "NUMBERS" : "Vous avez dit que vous vouliez recueillir des exemples de nombres."
                    }
                },
                "NODATA" : {
                    "CROWDSOURCED" : {
                        "TEXT" : "Votre classe a dit que vous vouliez recueillir des exemples de texte pour qu'un ordinateur puisse reconnaître quand le texte est ",
                        "IMAGES" : "Votre classe a dit que vous vouliez recueillir des exemples d'images pour qu'un ordinateur puisse reconnaître quand les images sont ",
                        "NUMBERS" : "Votre classe a dit que vous voulez recueillir des exemples de nombres pour qu'un ordinateur puisse reconnaître quand les nombres sont "
                    },
                    "INDIVIDUAL" : {
                        "TEXT" : "Vous avez dit que vous vouliez collecter des exemples de texte pour qu'un ordinateur puisse reconnaître quand le texte est ",
                        "IMAGES" : "Vous avez dit que vous vouliez collecter des exemples d'images pour qu'un ordinateur puisse reconnaître quand les images sont ",
                        "NUMBERS" : "Vous avez dit que vous vouliez collecter des exemples de nombres pour qu'un ordinateur puisse reconnaître quand les nombres sont "
                    }
                },
                "NOEXAMPLES" : {
                    "CLASS" : "Jusqu'à présent, votre classe n'a pas encore recueilli d'exemples.",
                    "YOU" : "Jusqu'à présent, vous n'avez pas encore recueilli d'exemples."
                },
                "DATA" : {
                    "CROWDSOURCED" : {
                        "TEXT" : "Votre classe a rassemblé des exemples de textes qu'un ordinateur peut utiliser pour reconnaître quand le texte est ",
                        "IMAGES" : "Votre classe a rassemblé des exemples d'images qu'un ordinateur peut utiliser pour reconnaître quand les images sont ",
                        "NUMBERS" : "Votre classe a rassemblé des exemples de nombres qu'un ordinateur peut utiliser pour reconnaître quand les nombres sont "
                    },
                    "INDIVIDUAL" : {
                        "TEXT" : "Vous avez rassemblé des exemples de textes qu'un ordinateur peut utiliser pour reconnaître quand le texte est ",
                        "IMAGES" : "Vous avez rassemblé des exemples d'images qu'un ordinateur peut utiliser pour reconnaître quand les images sont ",
                        "NUMBERS" : "Vous avez rassemblé des exemples de nombres qu'un ordinateur peut utiliser pour reconnaître quand les nombres sont "
                    },
                    "COLLECTED" : {
                        "CLASS" : "Qu'ils ont rassemblés : ",
                        "YOU" : "Que vous avez rassemblés : "
                    }
                }
            }
        },
        "WHATSNEXT": {
            "TITLE": "Quelle est la prochaine étape ?",
            "PLEASEWAIT": "Vous pourriez attendre que le modèle d'apprentissage machine finisse d'être entraîné.",
            "OFFERQUIZ": "Vous pouvez aussi essayer le quiz d'apprentissage machine ci-dessous pour vérifier ce que vous avez appris à la machine.",
            "FAIL": "Le message d'erreur de l'ordinateur d'entraînement est affiché ci-dessous. Si cela vous semble logique, essayez de résoudre le problème. Sinon, il vaudrait peut-être la peine d'essayer à nouveau au cas où ce ne serait qu'une erreur aléatoire.",

            "IDLE": {
                "NOLABELS" : "L'étape suivante est d'aller à la page d'<a href='{{ urls.train}}'>Entraînement</a>. Ajoutez des étiquettes pour chacune des choses que l'ordinateur doit s'entraîner à reconnaître.",
                "ONELABEL" : {
                    "EXPLANATION": "Vous n'avez précisé qu'une seule chose que l'ordinateur puisse reconnaître : {{ label }}",
                    "ISTHATALL": "Est-ce la seule chose que vous voulez que l'ordinateur puisse reconnaître ?",
                    "NO": "<strong>Non ?</strong><br/>Retournez à la page d'<a href='{{ urls.train}}'>Entraînement</a>.<br/>Ajouter plus d'étiquettes pour chacune des choses que vous voulez apprendre à l'ordinateur à reconnaître.<br/><br/>",
                    "YES": "<strong>Oui ?</strong><br/>Vous devez d'abord faire un peu plus de travail.<br/>Pour que l'ordinateur soit capable d'apprendre à reconnaître \"{{ label }}\", vous devez lui donner quelques exemples de choses qui ne sont pas {{ label }}.<br/>Retournez à la page d'<a href='{{ urls.train}}'>Entraînement</a> et créez une nouvelle étiquette pour les exemples de choses qui ne sont pas {{ label }}. Vous pouvez les appeler \"not-{{ label }}\"."
                },
                "LABELS" : {
                    "NO_DATA" : "L'étape suivante est d'aller à la page d'<a href='{{ urls.train}}'>Entraînement</a>. Ajoutez des exemples pour chacune des étiquettes.",
                    "MORE_DATA" : {
                        "KEEP_GOING": "Continuez d'avancer !",
                        "MORE_EXAMPLES" : {
                            "YOU": "Retournez à la page d'<a href='{{ urls.train}}'>Entraînement</a> et accumulez des exemples pour chacune des étiquettes.",
                            "CLASS": "Demandez à votre classe de retourner à la page d'<a href='{{ urls.train}}'>Entraînement</a> et d'accumuler plus exemples pour chacune des étiquettes."
                        },
                        "MORE_IS_BETTER" : "Plus vous pouvez en obtenir, mieux il devrait apprendre, mais vous avez besoin d'au moins {{ minimumExemples}} exemples de chacun comme un minimum absolu."
                    },
                    "ENOUGH_DATA" : {
                        "READY_TO_START" : "Prêt à commencer l'entraînement de l'ordinateur ?",
                        "START_TRAINING" : {
                            "CROWDSOURCED" : "Cliquez sur le bouton ci-dessous pour commencer l'entraînement d'un modèle d'apprentissage machine en utilisant les exemples que votre classe a recueillis jusqu'à présent.",
                            "INDIVIDUAL" : "Cliquez sur le bouton ci-dessous pour commencer l'entraînement d'un modèle d'apprentissage machine à l'aide des exemples que vous avez collectés.r"
                        },
                        "MORE_EXAMPLES" : {
                            "CROWDSOURCED" : "(Ou demandez à votre classe de retourner à la page d'<a href='{{ urls.train}}'>Entraînement</a> si vous voulez qu'ils collectent d'abord plus d'exemples.)",
                            "INDIVIDUAL" : "(Ou retournez à la page d'<a href='{{{ urls.train}}}'>Entraîneme</a> si vous voulez d'abord collecter quelques exemples supplémentaires.)"
                        },
                        "WAITING_FOR_TEACHER" : "Attendre que votre professeur commence l'entraînement de l'ordinateur."
                    }
                }
            },
            "READY" : {
                "TEST" : {
                    "TEXT" : "Essayez de tester le modèle d'apprentissage machine ci-dessous. Entrez un exemple de texte ci-dessous, que vous n'avez pas inclus dans les exemples que vous avez utilisés pour l'entraîner. Il vous dira ce qu'il reconnaît comme tel et à quel point il est confiant à cet égard.",
                    "IMAGES" : "Essayez de tester le modèle d'apprentissage machine ci-dessous. Entrez un exemple d'image ci-dessous, que vous n'avez pas inclus dans les exemples que vous avez utilisés pour l'entraîner. Il vous dira ce qu'il reconnaît comme tel et à quel point il est confiant à cet égard.",
                    "NUMBERS" : "Essayez de tester le modèle d'apprentissage machine ci-dessous. Entrez un exemple de nombre ci-dessous, que vous n'avez pas inclus dans les exemples que vous avez utilisés pour l'entraîner. Il vous dira ce qu'il reconnaît comme tel et à quel point il est confiant à cet égard.."
                },
                "SCRATCH" : "Si l'ordinateur semble avoir appris à reconnaître les choses correctement, alors vous pouvez aller à Scratch et utiliser ce que l'ordinateur a appris pour programmer un jeu !",
                "ADDITIONAL_TRAINING" : {
                    "MORE_EXAMPLES" : {
                        "CROWDSOURCED" : "Si l'ordinateur se trompe sur beaucoup de choses, votre classe peut retourner à la page d'<a href='{{ urls.train}}'>Entraînement</a> et ajouter quelques exemples supplémentaires.",
                        "INDIVIDUAL" : "Si l'ordinateur se trompe sur beaucoup de choses, vous pouvez retourner à la page d'<a href='{{ urls.train}}'>Entraînement</a> et ajouter quelques exemples supplémentaires."
                    },
                    "RETRAIN" : {
                        "YOU" : "Une fois que vous avez fait cela, cliquez sur le bouton ci-dessous pour entraîner un nouveau modèle d'apprentissage machine et voir quel sera l'effet des exemples supplémentaires !",
                        "CLASS" : "Une fois que vous aurez fait cela, votre enseignant devra entraîner un nouveau modèle d'apprentissage automatique."
                    }
                }
            }
        },
        "TRAINING": {
            "TITLE": "Informations provenant de l'ordinateur d'entraînement :",
            "STARTED": "Le modèle a commencé l'entraînement à :",
            "STATUS": "Current model status:",
            "DETAIL": "Détail:",
            "DELETION": "Le modèle sera automatiquement supprimé après :",
            "LASTCHECK": "Dernière vérification du modèle :",
            "PROMPTREFRESH": "Si celà dure plus d'une minute, vous devriez rafraîchir la page pour obtenir un statut à jour."
        },
        "TESTING": {
            "INTRO": {
                "TEXT": "Essayez d'insérer un texte pour voir comment il est reconnu en fonction de votre entraînement.",
                "IMAGES": "Essayez d'insérer une image pour voir comment elle est reconnue en fonction de votre entraînement.",
                "NUMBERS": "Essayez d'entrer quelques nombres pour voir comment ils sont reconnus en fonction de votre entraînement."
            },
            "WEBCAM": "Tester avec <strong>webcam</strong>",
            "DRAWING": "Tester par <strong>dessin</strong>",
            "WWW": "Tester avec <strong>www</strong>",
            "RECOGNISED": "Reconnu comme  <strong>{{ testoutput }}</strong>"
        },
        "QUIZ": {
            "TITLE": "C'est l'heure du quiz !",
            "INTROQUESTION": "Pendant que vous attendez que le modèle termine son entraînement, essayez de répondre à cette question.",
            "PREVIOUSLY_ATTEMPTED": "Vous l'avez déjà vu - voyons si vous vous souvenez de la bonne réponse cette fois-ci !",
            "CORRECT_ANSWER": "C'est ça !",
            "INCORRECT_ANSWER": "Non, désolé. La bonne réponse est indiquée ci-dessus.",
            "NEXT_QUESTION": "Question suivante"
        }
    },
    "MAKES": {
        "TITLE": "Faites quelque chose avec votre modèle d'apprentissage machine",
        "SCRATCH2": "Créer un projet dans l'ancienne version de Scratch",
        "SCRATCH3": "Utilisez la nouvelle version de Scratch",
        "PYTHON": "Ecrire du code Python pour utiliser votre modèle d'apprentissage machine",
        "APPINVENTOR": "Créez une application mobile pour votre téléphone ou tablette"
    },
    "PYTHON": {
        "TITLE": "Utilisation de l'apprentissage machine avec Python",

        "NOTREADY": "Votre projet n'est pas encore prêt à être utilisé avec Python.",
        "NOMODEL": "Vous n'avez pas encore entraîné un modèle d'apprentissage machine."
    },
    "APPINVENTOR": {
        "TITLE": "Utilisation de l'apprentissage automatique dans App Inventor",

        "NOTREADY": "Votre projet n'est pas encore prêt à être utilisé dans App Inventor.",
        "NOMODEL": "Vous n'avez pas encore entraîné un modèle d'apprentissage machine.",

        "BETAWARNING": "Il s'agit d'une première version bêta. Le support pour App Inventor n'est pas terminé, et aura probablement quelques bugs et problèmes."
    },
    "SCRATCH": {
        "TITLE": "Utilisation de l'apprentissage machine dans Scratch",

        "NOTREADY": "Votre projet n'est pas encore prêt à être utilisé dans Scratch.",
        "NOMODEL": "Vous n'avez pas encore entraîné un modèle d'apprentissage machine.",

        "LAUNCH": "Ouvrir dans Scratch",

        "LAUNCH_SCRATCH_BY_ITSELF": "(Vous pouvez utiliser <a href='{{ url }}' class='btn btn-default' target='_blank'>Scratch lui même </a> si vous voulez.)",
        "GO_TO_LEARNANDTEST": "Ou aller à la page <a href='{{ urls.learnandtest }}'>Entrainer &amp; Tester</a>  pour quelques conseils sur ce qu'il faut faire ensuite.",

        "MORE_BLOCKS": "Votre projet ajoutera ces blocs à l'onglet <span style='background-color: purple; color: white; padding-left: 7px; padding-right: 7px; white-space: nowrap;'>Plus de blocs</span> dans Scripts.",
        "EXPLAIN_RECOGNISE_LABEL": "Placer {{ type }} dans l'entrée prévue à cet effet, et il retournera l'étiquette de ce que votre modèle d'apprentissage machine reconnaît.",
        "EXPLAIN_RECOGNISE_CONFIDENCE": "Cela retournera une indice de confiance de la machine pour la reconnaissance proposée de {{ type }}. (un nombre entre 0 - 100).",
        "EXPLAIN_LABELS": "Ces blocs représentent les étiquettes que vous avez créées dans votre projet, vous pouvez donc utiliser leurs noms dans vos scripts.",
        "EXPLAIN_COSTUMEIMAGE": "Ce bloc se trouve dans la palette Recherches pour Sprites et renvoie l'image du costume actuellement sélectionné.",
        "SAMPLE_SCRIPT": "Cela signifie que vous pouvez faire quelque chose comme ça :",
        "SAMPLE_SCREENSHOT": "Cela devrait ressembler à quelque chose comme ceci - sauf avec le nom de votre projet.",
        "EXPLAIN_STATUS": "Le cercle coloré à côté du nom de votre projet vous indique si votre modèle d'apprentissage machine est correct.",
        "STATUS_GREEN": "signifie que votre modèle est entraîné et prêt à l'emploi",
        "STATUS_YELLOW": "signifie que votre modèle n'a pas encore terminé son entraînement",
        "STATUS_RED": "signifie que quelque chose a mal tourné. Retournez à la page <a href='{{ urls.learnandtest }}'>Entraîner &amp; Tester</a> pour voir ce qui n'allait pas avec l'entraînement."
    },
    "SCRATCH3": {
        "TITLE": "Utilisation de l'apprentissage machine dans Scratch 3",

        "LAUNCH": "Ouvrir dans Scratch 3"
    },
    "WORKSHEETS": {
        "TITLE": "Projets d'apprentissage machine",

        "INTRO_1": "Ces projets sont des guides téléchargeables étape par étape, avec des explications et des captures d'écran en couleur que les élèves peuvent suivre.",
        "INTRO_2": "Chaque projet est une activité autonome, écrite pour durer une seule leçon, et guidera les jeunes pour créer un jeu ou un projet interactif qui démontre une utilisation réelle de l'intelligence artificielle et de l'apprentissage automatique.",
        "INTRO_3": "Les suggestions de nouvelles feuilles de travail, les suggestions d'améliorations à apporter à l'une ou l'autre des feuilles de travail, ou les contributions de nouvelles feuilles de travail de projet, sont toutes les bienvenues.",

        "TYPES": {
            "TITLE": "Reconnaître:",
            "ALL": "Tous types de projets",

            "PREFIX": "Entraîner un ordinateur à reconnaître ",

            "TEXT": "texte",
            "IMAGES": "images",
            "NUMBERS": "nombres"
        },

        "LEVELS": {
            "TITLE": "Difficulté:",
            "ALL": "Toutes difficultés",
            "BEGINNER": "Projets pour débutant",
            "INTERMEDIATE": "Projets intermédiaires",
            "ADVANCED": "Projets avancés"
        },

        "DOWNLOAD": "Télécharger",

        "MAKETYPES": {
            "ALL": "Tous les types de projets",

            "SCRATCH": "Projets Scratch",
            "PYTHON": "Projets Python",
            "APPINVENTOR": "Projets App Inventor",

            "SCRATCH_WORKSHEET": "Feuille de travail pour réaliser un projet avec Scratch",
            "PYTHON_WORKSHEET": "Feuille de travail pour réaliser un projet en Python",
            "APPINVENTOR_WORKSHEET": "Feuille de travail pour réaliser un projet dans App Inventor"
        },

        "NO_WORKSHEETS": {
            "NO_MATCHES": "Il n'y a pas de feuilles de travail de projet qui correspondent à ces filtres.",
            "MAKE_YOUR_OWN": "Vous pouvez adapter certaines des feuilles de travail existantes ou en créer une nouvelle.",
            "CONTRIBUTE": "Si c'est le cas, pensez à <a href='https://github.com/IBM/taxinomitis-docs/blob/master/README.md#contributions'>contribuer pour que d'autres puissent l'utiliser</a>."
        },


        "SMARTCLASSROOM": {
            "TITLE": "Salle de classe intelligente",
            "SUMMARY": "Apprenez à un ordinateur à reconnaître vos commandes",
            "DESCRIPTION": "Créez un assistant intelligent dans Scratch qui vous permet de contrôler les périphériques virtuels."
        },
        "MAKEMEHAPPY": {
            "TITLE": "Rends-moi heureux",
            "SUMMARY": "Apprenez à un ordinateur à reconnaître les compliments et les insultes.",
            "DESCRIPTION": "Créez un personnage dans Scratch qui sourit si vous lui dites des choses gentilles et pleure si vous lui dites des choses méchantes."
        },
        "SNAP": {
            "TITLE": "Snap!",
            "SUMMARY": "Apprenez à un ordinateur à reconnaître à quoi ressemblent les icônes",
            "DESCRIPTION": "Faites un jeu de cartes dans Scratch qui apprend à reconnaître les images de votre carte."
        },
        "CHAMELEON": {
            "TITLE": "Caméléon",
            "SUMMARY": "Apprendre à un ordinateur à reconnaître les couleurs",
            "DESCRIPTION": "Faites un caméléon dans Scratch qui change de couleur pour correspondre à son arrière-plan."
        },
        "MAILMANMAX": {
            "TITLE": "Le facteur Max",
            "SUMMARY": "Apprendre à un ordinateur à reconnaître l'écriture manuscrite",
            "DESCRIPTION": "Faites un bureau de tri postal dans Scratch qui peut reconnaître les codes postaux manuscrits sur les enveloppes."
        },
        "CARORCUP": {
            "TITLE": "Voiture ou tasse",
            "SUMMARY": "Apprendre à un ordinateur à reconnaître les images d'objets",
            "DESCRIPTION": "Entraînez l'ordinateur pour qu'il soit capable de trier les photos en groupes."
        },
        "FACELOCK": {
            "TITLE": "Débloquer son téléphone avec son visage",
            "SUMMARY": "Apprendre à un ordinateur à reconnaître les visages",
            "DESCRIPTION": "Faites un téléphone dans Scratch qui se déverrouille s'il reconnaît votre visage."
        },
        "JOURNEYTOSCHOOL": {
            "TITLE": "Aller à l'école",
            "SUMMARY": "Apprendre à un ordinateur à faire des prédictions",
            "DESCRIPTION": "Entraînez l'ordinateur pour être capable de prédire comment vous vous rendrez à l'école le matin."
        },
        "SHYPANDA": {
            "TITLE": "Panda timide",
            "SUMMARY": "Apprendre à un ordinateur à reconnaître les images",
            "DESCRIPTION": "Faites un panda dansant qui devient timide et arrête de danser si vous le regardez."
        },
        "VIRTUALPET": {
            "TITLE": "Animal de compagnie virtuel",
            "SUMMARY": "Apprendre à un ordinateur à reconnaître les images",
            "DESCRIPTION": "Apprenez à l'ordinateur à reconnaître ce que vous faites afin de pouvoir prendre soin d'un animal de compagnie virtuel."
        },
        "PACMAN": {
            "TITLE": "Pac-Man",
            "SUMMARY": "Apprendre à un ordinateur à jouer à un jeu",
            "DESCRIPTION": "Créer un jeu Pac-Man dans Scratch qui apprend comment éviter le fantôme."
        },
        "CHATBOTS": {
            "TITLE": "Agent conversationnel",
            "SUMMARY": "Apprendre à un ordinateur à reconnaître les questions",
            "DESCRIPTION": "Créez un agent conversationnel qui peut répondre à des questions sur un sujet de votre choix."
        },
        "TOURISTINFO": {
            "TITLE": "Information pour les touristes",
            "SUMMARY": "Apprendre à un ordinateur à faire des recommandations",
            "DESCRIPTION": "Créez une application mobile dans Scratch qui recommande des attractions touristiques en fonction des intérêts des gens."
        },
        "SORTINGHAT": {
            "TITLE": "Choixpeau",
            "SUMMARY": "Apprendre à un ordinateur à reconnaître l'usage du langage",
            "DESCRIPTION": "Créez un 'chapeau de tri' comme dans Harry Potter, qui vous place dans une école en fonction de ce que vous dites."
        },
        "ROCKPAPERSCISSORS": {
            "TITLE": "Pierre, Papier, Ciseaux",
            "SUMMARY": "Apprendre à un ordinateur à reconnaître les formes.",
            "DESCRIPTION": "Réalisez un jeu de Pierre, Papier, Ciseaux dans Scratch qui apprend à reconnaître les formes des mains."
        },
        "JUDGEABOOK": {
            "TITLE": "Juger un livre",
            "SUMMARY": "Apprendre à un ordinateur à reconnaître le style visuel",
            "DESCRIPTION": "Faites un jeu dans Scratch pour tester s'il est vraiment possible de juger un livre par sa couverture."
        },
        "LOCATELARRY": {
            "TITLE": "Où est Larry ?",
            "SUMMARY": "Apprendre à un ordinateur à trouver quelque chose dans une image",
            "DESCRIPTION": "Programmer un jeu dans le style \"Où est Charlie?\"- dans Scratch, et apprenez à l'ordinateur à trouver votre personnage."
        },
        "CONFUSED": {
            "TITLE": "Confus",
            "SUMMARY": "Apprendre à un ordinateur à reconnaître les fruits",
            "DESCRIPTION": "Apprenez comment les ordinateurs peuvent être confus et peuvent faire des erreurs s'ils sont mal entraînés.."
        },
        "SCHOOLLIBRARY": {
            "TITLE": "Bibliothèque scolaire",
            "SUMMARY": "Apprendre à un ordinateur à faire des recommandations",
            "DESCRIPTION": "Créer un bibliothécaire scolaire avec Scratch qui suggère à qui pourrait convenir un livre."
        },
        "WHATTWITTERTHINKS": {
            "TITLE": "Qu'en pense Twitter ?",
            "SUMMARY": "Enseigner à un ordinateur à mesurer l'opinion publique",
            "DESCRIPTION": "Créer un outil d'analyse de sentiment avec Scratch pour analyser les discussions sur Twitter"
        },
        "NOUGHTSANDCROSSES": {
            "TITLE": "Jeu de morpions",
            "SUMMARY": "Apprendre à un ordinateur à jouer à un jeu",
            "DESCRIPTION": "Créez un jeu de morpions avec Scratch qui apprend à vous battre."
        },
        "TOPTRUMPS": {
            "TITLE": "Meilleurs atouts",
            "SUMMARY": "Apprendre à un ordinateur à jouer à un jeu",
            "DESCRIPTION": "Entraînez un ordinateur pour pouvoir jouer au jeu de cartes Meilleurs Atouts avec Scratch."
        },
        "HEADLINES": {
            "TITLE": "A la une",
            "SUMMARY": "Tester la capacité de l'ordinateur à reconnaître l'utilisation de la langue",
            "DESCRIPTION": "Entrainer un ordinateur à reconnaître les titres des journaux nationaux."
        },
        "FINDIT": {
            "TITLE": "Trouve-le !",
            "SUMMARY": "Apprendre à un ordinateur à reconnaître les images",
            "DESCRIPTION": "Créez un jeu de cache-cache pour votre téléphone portable"
        }
    },
    "TEACHER": {
        "MENU": {
            "TITLE": "Administration",

            "RESTRICTIONS": {
                "TITLE": "Restrictions",
                "DESCRIPTION": "Réviser les limites et les restrictions qui s'appliquent à votre classe"
            },
            "APIKEYS": {
                "TITLE": "Clés d'API",
                "TITLELONG": "Clés d'API Watson",
                "DESCRIPTION": "Configurez les identifiants IBM Watson pour permettre à votre classe de créer des modèles d'apprentissage machine."
            },
            "STUDENTS": {
                "TITLE": "Élèves",
                "TITLELONG": "Gestion des élèves",
                "DESCRIPTION": "Créez, réinitialisez et supprimez les connexions des élèves de votre classe"
            },
            "SUPERVISION": {
                "TITLE": "Supervision",
                "DESCRIPTION": "Passez en revue les projets que vos élèves ont créés."
            },

            "ADVANCEDOPTIONS": "Options avancées",

            "DELETECLASS": {
                "TITLE": "Supprimer une classe",
                "DESCRIPTION": "Cela supprimera les comptes pour vous et tous les élèves de votre classe."
            },

            "CANYOUHELP": {
                "TITLE": "Pouvez-vous nous aider ?",
                "DESCRIPTION": "Veuillez partager vos expériences et vos idées sur la façon d'améliorer l'outil."
            },

            "NOTAUTHORISED": "Vous n'êtes pas autorisé à accéder à la page des professeurs de votre classe."
        },
        "APIKEYS": {
            "TITLE": "Administration : Clés d'API IBM Watson",

            "ADDNEWCREDENTIALS": "Ajouter de nouvelles informations d'identification",
            "ADDAPIKEY": "Ajouter une nouvelle clé API",
            "REMOVE": "Supprimer",

            "NO_TEXT_CREDENTIALS": "Vous n'avez pas d'accréditation d'Assistant. Cela signifie qu'il ne sera pas possible d'entraîner des modèles pour des projets à base de <strong>texte</strong>.",
            "NO_IMAGE_CREDENTIALS": "Vous n'avez pas de clés API de reconnaissance visuelle. Cela signifie qu'il ne sera pas possible d'entraîner des modèles pour des projets à base d'<strong>images</strong>.",

            "NOTAUTHORISED": "Vous n'êtes pas autorisé à accéder aux clés API Watson utilisées par votre classe.",
            "MANAGEDCLASS": "Les clés API utilisées par votre classe sont gérées pour vous.",

            "HELP_STEPBYSTEP_GUIDE": "Si vous n'êtes pas sûr de ce qu'il faut faire ici, veuillez suivre le  <a href='https://github.com/IBM/taxinomitis-docs/raw/master/docs/pdf/machinelearningforkids-apikeys.pdf'> guide étape par étape </a>. Si vous avez besoin d'aide, veuillez <strong><a style='cursor : pointer;' ui-sref='help'>prendre contact</a></strong>.",

            "INTRO_WATSONASSISTANT": "Training machine learning models for <span class='mlprojecttype'>text</span> projects uses <a class='mlprojecttype' href='https://www.ibm.com/cloud/watson-assistant/'>Watson Assistant</a>",
            "INTRO_VISUALRECOGNITION": "Training machine learning models for <span class='mlprojecttype'>images</span> projects uses <a class='mlprojecttype' href='https://www.ibm.com/watson/services/visual-recognition/'>Watson Visual Recognition</a>",

            "ERROR_FETCHING_WATSONASSISTANT": "Failed to get your Watson Assistant passwords",
            "ERROR_FETCHING_VISUALRECOG": "Failed to get your Visual Recognition API keys",

            "USERNAME": "Username",
            "PASSWORD": "Password",
            "APIKEY": "API key",

            "NUMBER_OF_ML_MODELS": "Number of ML models",
            "UNKNOWN": "unknown",
            "UNLIMITED": "unlimited",

            "LIMIT_TEXT_PROJECTS": "Number of text machine learning models your students can have:",
            "LIMIT_IMAGE_PROJECTS": "Number of images machine learning models your students can have:",

            "ADD_API_KEYS": {
                "ASSISTANT_TITLE": "Add Watson Assistant credentials",
                "VISUAL_RECOGNITION_TITLE": "Add Visual Recognition API key",

                "USED_FOR_TEXT_PROJECTS": "These will be used when your students train models in text projects.",
                "USED_FOR_IMAGE_PROJECTS": "These will be used when your students train models in images projects.",

                "HIDDEN_FROM_STUDENTS": "This will not be shown to students in your group.",

                "PRICING_PLAN": "Which Pricing Plan did you use?",
                "ENTER_APIKEY": "Please enter the API key below",
                "ENTER_PASSWORD": "Please enter the username and password below",

                "CREDENTIALS_TYPE": "What did you create in Watson Assistant?"
            }
        },
        "RESTRICTIONS": {
            "TITLE": "Administration : Restrictions",

            "ASK_FOR_CHANGES": "If any of these restrictions cause a problem for your group, please <strong><a href='/help'>get in touch</a></strong>.",

            "CLASS_LIMITS": {
                "TITLE": "Limits for your class",
                "NUM_USERS": "You can have up to <span class='mlprojecttype'>{{ num }}</span> users (including students and teachers) in your group.",
                "NUM_TEXT_MODELS": "Your class is allowed to have up to <span class='mlprojecttype'>{{ num }}</span> machine learning models in total across all their <span class='mlprojecttype'>text</span> projects.",
                "NUM_IMAGE_MODELS": "Your class is allowed to have up to <span class='mlprojecttype'>{{ num }}</span> machine learning models in total across all their <span class='mlprojecttype'>images</span> projects.</div>"
            },
            "PROJECT_LIMITS": {
                "TITLE": "Limits for projects created by your students",
                "NUM_PROJECTS": "Each of your students is allowed to have up to <span class='mlprojecttype'>{{ num }}</span> projects.",
                "TYPES": "Your students can create projects to recognise <span class='mlprojecttype'>{{ types }}</span>.",
                "TRAINING_DATA": "Each <span class='mlprojecttype'>{{ type }}</span> project can have up to <span class='mlprojecttype'>{{ num }}</span> training data examples. "
            },
            "EXPIRY": {
                "TITLE": "To help you avoid the limits for number of machine learning models:",
                "TIME_LIMIT": "Machine learning models created for <span class='mlprojecttype'>{{ type }}</span> projects will automatically be deleted after <span class='mlprojecttype'>{{ num }}</span> hours.",
                "DONT_WORRY": "(Don't worry! Training data will not be deleted, so students can always train a new machine learning model again if they still need it after this.)"
            },

            "NOT_AUTHORIZED": "You are not authorized to access the restrictions in place for your class."
        },
        "SUPERVISION": {
            "TITLE": "Administration : Student projects",

            "INTRO_1": "This page displays a list of all of the projects that your class currently has. You can use it to review what they're working on.",
            "INTRO_2": "If you've hit the limit for the number of machine learning models that your class can create, you can use this to see which projects currently have a machine learning model, and delete any that you think are no longer needed.",

            "NO_PROJECTS_1": "None of the students in your class currently have any projects.",
            "NO_PROJECTS_2": "Once your students start creating projects, come back here to see an overview of their work.",

            "NAME": "Name",
            "TYPE": "Type",
            "STUDENT": "Student",
            "MODELS": "ML models",

            "DELETE": "Click the icon to delete",

            "NOT_AUTHORIZED": "You are not authorized to access the list of projects for all students in your class."
        },
        "STUDENTMANAGEMENT": {
            "TITLE": "Administration : Student management",

            "CREATE_FIRST_STUDENT": "Click on the 'plus' button on the right to create the first student",
            "ADD": "Add new student",
            "NEW_USERNAME": "Choose a unique username",
            "ALPHANUMERIC": "Only use letters and numbers",

            "NOT_LOGGED_IN": "Not logged in yet",

            "RESET_PASSWORD": "Reset password",
            "RESET_ALL_PASSWORDS": "Reset password for all students",

            "DELETE_STUDENT": "Delete student account",

            "NOT_AUTHORIZED": "You are not authorized to access the list of students in your class."
        }
    },
    "SCRATCHBLOCKS": {
        "TEXT_PROJECTS": {
            "mlforkids.text.recogniseLabel": "recognise text [TEXT] (label)",
            "mlforkids.text.recogniseConfidence": "recognise text [TEXT] (confidence)",
            "mlforkids.text.addTraining": "add training data [TEXT] [LABEL]",
            "mlforkids.text.trainNewModel": "train new machine learning model",
            "mlforkids.text.checkModelStatus": "Is the machine learning model [STATUS] ?"
        },
        "IMAGES_PROJECTS": {
            "mlforkids.images.recogniseLabel": "recognise image [IMAGE] (label)",
            "mlforkids.images.recogniseConfidence": "recognise image [IMAGE] (confidence)",
            "mlforkids.images.addTraining": "add training data [TEXT] [LABEL]"
        },
        "NUMBER_PROJECTS": {
            "mlforkids.numbers.trainNewModel": "train new machine learning model"
        },
        "TWITTER": {
            "mlforkids.twitter.getrecenttweet": "get the [INDEX] most recent tweet about [TOPIC]"
        },
        "IMAGE_BLOCKS": {
            "mlforkids.imageblocks.getCostumeImage": "costume image",
            "mlforkids.imageblocks.getBackdropCostumeImage": "backdrop image",
            "mlforkids.imageblocks.getBackdropImage": "backdrop image",
            "mlforkids.imageblocks.saveScreenshotToCostume": "save screenshot to costume"
        },
        "GUI": {
            "gui.menuBar.mlforkidsLibrary": "Project templates",
            "gui.mlforkidsLibrary.templates": "Machine Learning for Kids modelos de projeto"
        }
    },
    "HELP": {
        "CONTACT": "If you have any problems or questions, please email Dale.Lane@uk.ibm.com",
        "GETTINGSTARTED": {
            "TITLE": "Getting started?",
            "INTRO": "Download a PDF with a short getting started guide:",
            "MANAGED": "Managed class accounts",
            "MANAGEDEXPL": "For school teachers, coding group leaders, or other volunteers",
            "UNMANAGED": "Unmanaged class accounts",
            "UNMANAGEDEXPL": "For IBM employees, or teachers and coding group leaders who manage their own class accounts"
        },
        "FAQS": {
            "TITLE": "Want to know more?",
            "INTRO1": "Is something not working?",
            "INTRO2": "The list below contains the questions and issues that I hear about most often. If you see something that looks similar to your problem, click on the summary for more info.",
            "INTRO3": "If you're still stuck, or you've run into a problem I've not included in the list, sorry! Please <a href='mailto:dale.lane@uk.ibm.com'>email me</a> or <a href='https://github.com/IBM/taxinomitis/issues'>create an issue report</a> so that I can help."
        },

        "SCRATCH": {
            "TITLE": "Scratch issues",

            "Q1": "I don't know how to get Scratch 2 working",
            "Q1-A-1": "The old version of Scratch, Scratch 2, needs Adobe Flash to work, so you need to be using an operating system and a web browser that can work with Flash.",
            "Q1-A-2": "If you're not sure about how to enable Flash, you can            <a href='https://github.com/IBM/taxinomitis-docs/raw/master/docs/pdf/machinelearningforkids-scratchx.pdf'>download a document with some tips for getting Scratch working</a>. Or you can use the new version of Scratch, Scratch 3, instead.",

            "Q2": "The \"Load Project\" and \"Save Project\" menus in Scratch don't work",
            "Q2-A-1": "If you're using Safari on macOS and the Scratch menus \"File -&gt; Load Project\" and \"File -&gt; Save Project\" menus aren't working, it might be that you're running in Safe Mode.",
            "Q2-A-2": "<a href='https://github.com/IBM/taxinomitis-docs/raw/master/docs/pdf/safari-scratch-safemode.pdf'>Follow the instructions here</a> for how to check and fix this.",

            "Q3": "Machine learning classifier blocks in Scratch don't work",
            "Q3-A-1": "Occassionally, the Scratch blocks for your machine learning model can lose the connection to the server. When this happens, they will stop returning results.",
            "Q3-A-2": "You can check whether this has happened using the coloured status light in the \"More Blocks\" palette.",
            "Q3-A-3": "If the status light next to your machine learning Scratch blocks is red, that normally means something is wrong. It might be a temporary problem. Try saving your project (using 'File' -&gt; 'Save Project'), then refresh the browser page. If the status light goes green after the page reloads, you can load your project (using 'File' -&gt; 'Load Project') to pick up where you left off.",
            "Q3-A-4": "If the status light is still red after reloading the page, then there is probably something wrong with the machine learning model. Try going to the \"Learn &amp; Test\" page for the project, which is where any error messages about your model can be found.",
            "Q3-A-5": "If the status light next to your machine learning Scratch blocks is green, then the blocks should be working. If you're not getting the responses you expect from them, try going to the \"Learn &amp; Test\" page and checking what results your model returns.",

            "Q5": "Can I use any version of Scratch?",
            "Q5-A-1": "You need to use the versions of Scratch that are provided by the Machine Learning for Kids site. They can be launched by clicking the Scratch, or 'Scratch 3', buttons from your project page.",

            "Q6": "Scratch 3 is only saving projects to the 'Downloads' folder",
            "Q6-A-1": "When you click 'File' -> 'Save to your computer' in Scratch 3, your Scratch project is saved to your computer.",
            "Q6-A-2": "Some teachers reported a problem that this saved to the Downloads folder, on a computer where students don't have access in Windows to the Downloads folder. The result was that students were not able to access their saved projects.",
            "Q6-A-3": "If you have this problem, you need to look in your web browser settings for a setting like 'Ask where to save each file before downloading'. If you enable that, your students will be able to choose where their projects are saved."
        },

        "TRAININGUI": {
            "TITLE": "Training UI issues",

            "Q1": "Dragging images into training buckets (for image projects) doesn't work",
            "Q1-A-1": "Dragging images into the training buckets doesn't work if you're using Safari or Internet Explorer.",
            "Q1-A-2": "Sorry about this. If you can use another browser like Firefox or Chrome, please do that. Otherwise, you can click the \"www\" button and paste in the URL of training pictures instead."
        },

        "MODELS": {
            "TITLE": "Errors training machine learning models",

            "Q1": "\"No Watson credentials have been set up\"",
            "Q1-A-1": "Machine learning models in the tool are created using IBM Watson APIs.",
            "Q1-A-2": "If you have an \"unmanaged\" class account, then your teacher or group leader will need to provide Watson API credentials from IBM Cloud for this to work. Step-by-step instructions for how they can do this are in the \"Getting Started\" document at the top of this page.",

            "Q2": "\"Watson credentials being used by your class were rejected\"",
            "Q2-A-1": "Machine learning models in the tool are created using IBM Watson APIs.",
            "Q2-A-2": "If you have an \"unmanaged\" class account, then your teacher or group leader will have provided Watson API credentials from IBM Cloud for this to work (as described in the \"Getting Started\" document at the top of this page).",
            "Q2-A-3": "However, the credentials that were provided are currently not working. The most likely reason is that the credentials were deleted from IBM Cloud since they were originally provided. If that isn't the case, the teacher or group leader who provided the Watson credentials needs to go back to the IBM Cloud dashboard to check the status of the Watson Assistant or Visual Recognition service that they created.",

            "Q3": "\"Watson Assistant API keys have no more workspaces available\"",
            "Q3-A-1": "Machine learning models in the tool are created using IBM Watson APIs.",
            "Q3-A-2": "Watson Assistant credentials created by teachers have a limit on the number of machine learning models that they can be used to create. This is displayed in the IBM Cloud UI where the credentials were created, where they are called \"workspaces\".",
            "Q3-A-3": "If this limit is exceeded, attempts to train new machine learning models will fail, and this message will be displayed:",
            "Q3-A-4": "Your class already has created their maximum allowed number of models. Please let your teacher or group leader know that their \"Watson Assistant API keys have no more workspaces available\".",
            "Q3-A-5": "If a student who has a successfully trained model then deletes their model, this will free up a workspace for use by another student.",
            "Q3-A-6": "One way to avoid this error in future would be smaller class sizes. If there are fewer students than the number of workspaces supported by the Watson Assistant credentials, then the limits will not be hit.",
            "Q3-A-7": "Another way to avoid this error is to add additional Watson Assistant API keys to the class, or to use a Watson Assistant instance \"plan\" that has higher limits.",

            "Q4": "\"Watson Visual Recognition API keys have no more classifiers available\"",
            "Q4-A-1": "Machine learning models in the tool are created using IBM Watson APIs.",
            "Q4-A-2": "Watson Visual Recognition credentials created by teachers have a limit on the number of machine learning models that they can be used to create. This is displayed in the IBM Cloud UI where the credentials were created, where they are called \"custom classifiers\".",
            "Q4-A-3": "If this limit is exceeded, attempts to train new machine learning models will fail, and this message will be displayed:",
            "Q4-A-4": "Your class already has created their maximum allowed number of models. Please let your teacher or group leader know that their \"Watson Visual Recognition API keys have no more classifiers available\".",
            "Q4-A-5": "If a student who has a successfully trained model then deletes their model, this will free up a custom classifier for use by another student.",
            "Q4-A-6": "One way to avoid this error in future would be smaller class sizes. If there are fewer students than the number of custom classifiers supported by the Watson Visual Recognition credentials, then the limits will not be hit.",
            "Q4-A-7": "Another way to avoid this error is to add additional Watson Visual Recognition API keys to the class, or to use a Watson Visual Recognition instance \"plan\" that has higher limits.",

            "Q5": "\"Watson ... is currently rate limiting their API key\"",
            "Q5-A-1": "Machine learning models in the tool are created using IBM Watson APIs.",
            "Q5-A-2": "If you have an \"unmanaged\" class account, then your teacher or group leader will need to provide Watson API credentials from IBM Cloud for this to work.",
            "Q5-A-3": "If free accounts are created, they will apply a limit on the rate of requests for new machine learning models. In normal usage, this will not impact the class. However, if students get a \"no more workspaces available\" or \"no more classifiers available\" error (as described above) but then continue to click the \"Train new Machine Learning model\" button multiple times per second, for several minutes, then the rate limiting will apply.",
            "Q5-A-4": "A message like this will be displayed to students in this case:",
            "Q5-A-5": "Your class is making too many requests to create machine learning models at too fast a rate. Please stop now and let your teacher or group leader know that \"the Watson Assistant service is currently rate limiting their API key\"",
            "Q5-A-6": "The rate limiting isn't applied by, or under the control of, the Machine Learning for Kids site. It is usually temporary, and is best resolved by waiting for a short time.",
            "Q5-A-7": "If students are clicking the \"Train new Machine Learning model\" button and getting \"no more workspaces available\" or \"no more classifiers available\" errors (as described above), then they should be aware that repeatedly clicking the button will not resolve the issue, and will in fact make the situation worse for the rest of the class.",

            "Q6": "I've been waiting for a model to train for ages!",
            "Q6-A-1": "Try refreshing the page.",
            "Q6-A-2": "The page should check on the status of the machine learning model every 30 seconds, but very occassionally it stops checking, so you might be waiting for the model when it is actually ready for you.",
            "Q6-A-3": "If it's been more than a few minutes, it's worth checking by refreshing / reloading the page.",
            "Q6-A-4": "If it's been more than ten minutes, it might be worth considering restarting (click the Cancel button and then click the button to train a new machine learning model again)."
        },

        "TEACHERUI": {
            "TITLE": "Teacher / Admin UI issues",

            "Q2": "Missing student account from the list in the teacher's page",
            "Q2-A-1": "User management for Machine Learning for Kids is implemented using the third party service, <a href=\"https://auth0.com/\">Auth0</a>.",
            "Q2-A-2": "Occassionally, the list of students that Auth0 returns can get a little out of date, and fail to reflect students that have recently been created (or similarly, still show students that have been recently deleted).",
            "Q2-A-3": "In these instances, the students have normally been successfully created (or deleted) and it is just that the list of students being displayed doesn't reflect recent updates.",
            "Q2-A-4": "Auth0 will normally report such incidents on their status page as <a href='https://status.auth0.com/incidents/0sk1d3hjlw0m'>user indexing delays</a> or <a href='https://status.auth0.com/incidents/t8995b9jggx5'>problems with their Search API</a>.",
            "Q2-A-5": "The best thing to do in these cases is to wait for the Auth0 indexing to catch up.",

            "Q4": "Why are machine learning models automatically deleted?",
            "Q4-A-1": "This was a feature requested by schools when Machine Learning for Kids was first developed. It came from the fact that there is a limit for how many machine learning models a class can have at any given time, and a need to make it easy to manage this limit.",
            "Q4-A-2": "Rather than requiring kids to have to clean up after a lesson and delete their models (in order to allow the next class to be able to create models), the tool can automatically clean up by deleting the models after the lesson is over. This makes it easy to run the next lesson, and the next lesson after that, without manual clean-ups in between.",
            "Q4-A-3": "The time limit before models are deleted is configurable. In a school, where lessons are 1 or 2 hours long, deleting models after two hours might be sensible. For a weekly coding club, six days might be a better fit to make sure that models are cleared up before each new club session.",
            "Q4-A-4": "To specify the time limit for your class, visit the <a href='https://machinelearningforkids.co.uk/#!/teacher/restrictions'>Restrictions section of your Teacher page</a>.",
            "Q4-A-6": "<em>Note: Only machine learning models are automatically deleted, not the training data that was used to create them. So if a model is automatically deleted for a project that a student is still working on, they can always just click the \"Train\" button again to create the model again.</em>"
        },

        "ACCOUNTISSUES": {
            "TITLE": "Account issues",

            "Q1": "What is the difference between creating accounts or using \"Try it now\"?",
            "Q1-A-1": "Using \"Try it now\" to means there is no need to log on or create an account. There are no passwords for students to have to remember, and no need for teachers to have to provide personal information. It also saves teachers the time needed to manage student accounts.",
            "Q1-A-2": "However, creating an account does enable additional features. Students can save their work and come back to it in a later lesson. They can work on a project together with other students in their class. They can log on from home and show their family what they've made.",
            "Q1-A-3": "A summary of the differences is shown below:",

            "CREATE_ACCOUNT": "Create an account",
            "TRAINMODELS": "Train machine learning models to recognise...",
            "USE_SCRATCH": "Use machine learning models from Scratch",
            "CREATE_PROJECTS": "Create projects",
            "ONE_PROJECT": " 1 project ",
            "MULTIPLE_PROJECTS": " Multiple projects ",
            "SAVE_PROJECTS": "Save and load projects",
            "WORK_ON_PROJECTS": "Work on machine learning projects...",
            "FEW_HOURS": " for a few hours ",
            "UNTIL_DELETION": " until you delete them ",
            "ONE_COMPUTER": " from one computer ",
            "ONLINE": " anywhere online ",
            "BY_YOURSELF": " by yourself ",
            "WITH_CLASSMATES": "with classmates",

            "Q2": "I've created a class account but my teacher's logon isn't working",
            "Q2-A-1": "You need to verify your email address before you'll be able to log on.",
            "Q2-A-2": "When you created the class account, an email will be sent to the email address you provided, with a link to click on. If you click on that link, your email address will be verified and the class account will be activated. You should be able to log on now.",
            "Q2-A-3": "If you haven't seen the verify email yet, make sure it's not gone into your spam folder.",
            "Q2-A-4": "If you still can't find it, <a href='mailto:dale.lane@uk.ibm.com'>let me know</a> and I'll try and help.",

            "Q3": "Deleting accounts",
            "Q3-A-1": "Student accounts",
            "Q3-A-2": "Students cannot delete their own accounts.",
            "Q3-A-3": "A teacher can delete a student account at any time by visiting the \"Teacher\" page  and clicking the \"Delete student account\" button next to the student account you want to delete.",
            "Q3-A-4": "This will delete all information stored about that student and all of their projects and machine learning models.",
            "Q3-A-5": "It cannot be undone.",
            "Q3-A-6": "Teacher accounts",
            "Q3-A-7": "Deleting a teacher account will delete the entire class and all of the student accounts in it. It cannot be undone.",
            "Q3-A-8": "This can be done by clicking the \"Delete Class\" button in the Advanced options section of <a href='https://machinelearningforkids.co.uk/teacher'>your Teacher page</a>",

            "Q4": "What information is stored about users?",
            "Q4-A-1": "Teacher accounts",
            "Q4-A-2": "I store the username and email address that you provide when you create the account, so that I can keep in touch with you.",
            "Q4-A-3": "Student accounts",
            "Q4-A-4": "I store the usernames for student accounts, so that I can let them log in. I have no email addresses or contact details for students. I have no other personally identifying information about students.",
            "Q4-A-5": "I also <a href='https://github.com/IBM/taxinomitis-docs/raw/master/docs/pdf/machinelearningforkids-schools.pdf'>recommend that students are given generic usernames</a> (e.g. student1) so that students are not identifiable outside of their school or coding group.",
            "Q4-A-6": "General information stored about all accounts",
            "Q4-A-7": "User management for Machine Learning for Kids is implemented using the third party service, <a href='https://auth0.com/'>Auth0</a>. They store the IP address that you last logged into Machine Learning for Kids from, and the type of browser you used. I've never found a reason to use that, but it is stored if I did want to go and look for it.",
            "Q4-A-8": "Errors that happen in the web browser are captured using the third party service, <a href='https://sentry.io/'>Sentry</a>. If something goes wrong, it will capture information about the error, including your username, IP address, type of browser you were using, and a technical description of what went wrong.",
            "Q4-A-9": "I use <a href='https://www.google.com/analytics/'>Google Analytics</a> so that I know how many users visit Machine Learning for Kids each day. Although it captures information such as geographic location and browser type, this is only ever displayed to me in an anonymised aggregate way."
        }
    }
}
