{
    "APP": {
        "TITLE": "아이들을 위한 머신러닝",

        "BACK": "뒤로",
        "BACKTOPROJECT": "&lt; 프로젝트로 돌아가기",
        "ERROR": "에러:",
        "WARNING": "경고:",
        "INFO": "정보:",

        "ADD": "추가",
        "CANCEL": "취소",

        "ABOUT": "소개",
        "TEACHER": "선생님",
        "PROJECTS": "프로젝트",
        "WORKSHEETS": "워크시트",
        "NEWS": "뉴스",
        "HELP": "도움말",
        "LOGIN": "로그인",
        "LOGOUT": "로그아웃",

        "BETA": "베타",
        "INCOMPLETE": "미완성!"
    },
    "ABOUT": {
        "TITLE": "아이들을 위한 머신러닝",
        "IN6SECS": "6초 안에 가능!",
        "IN20MINS": "20분 안에 가능",
        "WHAT": {
            "TITLE": "무엇을?",
            "BODY" : "이 도구는 머신 러닝 시스템을 훈련시키고 만드는 실전적인 과정을 제공하며 아이들에게 머신러닝을 소개합니다. <br/><br/> 이 도구는 텍스트, 숫자 또는 이미지를 분류하는 머신러닝 모델을 만들 수 있는 환경을 제공합니다. <br/><br/>아이들에게 코딩을 소개하고 가르치기 위한 기존의 연구를 바탕으로, 이 모델을 <a href='https://scratch.mit.edu/about' target='_blank'>Scratch</a>(코딩 교육에 주로 사용되는 플랫폼)에 추가하여 아이들이 그들이 만든 머신러닝 모델을 바탕으로 프로젝트와 게임을 만들 수 있습니다. <br/><br/>자세한 내용은 다음을 참고하세요."
        },
        "WHY": {
            "TITLE": "왜?",
            "BODY": "머신러닝은 우리 주변에 있습니다. 우리는 스팸 필터, 추천 엔진, 언어 번역 서비스, 채팅 로봇 및 디지털 비서, 검색 엔진 및 사기 탐지 시스템과 같은 머신러닝 시스템을 매일 사용합니다.<br/><br/>머지 않아 머신러닝 시스템이 우리의 자동차를 운전하고, 의사가 우리의 질병을 진단하고 치료할 수 있도록 도와줄 것입니다. <br/><br/>아이들이 우리의 세계가 어떻게 작동하는지 알고 있어야 합니다. 기능과 의미를 이해하는 가장 좋은 방법은 이 기술을 직접 구현해 보는 것입니다. <br/><br/>자세한 내용은 다음을 참고하세요.: <a target='_blank' class='btn btn-primary' href='http://dalelane.co.uk/blog/?p=3513'>'Introducing Machine Learning to kids'</a>"
        },
        "TECH": {
            "TITLE": "기술",
            "BODY": "이 도구는 웹 기반이므로 설치나 복잡한 설정이 필요하지 않습니다. <br/><br/>학교, 교실에서 자발적으로 코딩 그룹을 운영하도록 설계되었습니다. 그리고 교사 또는 그룹 리더가 학생을 위한 액세스를 관리하고 관리할 수 있는 관리자 페이지를 제공합니다.<br/><br/><a target='_blank' href='https://www.ibm.com/watson/developercloud/'>IBM Watson Developer Cloud</a>의 API를 사용하여 <a target='_blank' href='http://dalelane.co.uk/'>Dale Lane</a>이 개발했습니다.",
            "LOGIN": "시작하려면: "
        }
    },
    "NEWS": {
        "TITLE": "새소식",
        "UPDATES": {
            "TITLE": "뉴스 & 새소식",
            "DESCRIPTION": "@MLforKids의 새소식"
        },
        "MENTIONS": {
            "TITLE": "알림",
            "DESCRIPTION": "wakelet.com의 알림"
        }
    },
    "ERRORS": {
        "PAGENOTFOUND": "페이지를 찾을 수 없어요",
        "NOTLOGGEDIN": "로그인되어 있지 않아요",

        "MISSINGPROJECTID": "프로젝트 ID를 찾을 수 없어요",
        "IFPERSISTENT": "계속 이런 현상이 일어난다면 ",

        "LETMEKNOW": "알려주세요"
    },
    "WELCOME": {
        "TITLE": "컴퓨터가 게임을 할 수 있도록 가르쳐봐요",
        "GET_STARTED": "시작해봅시다",
        "LEARN_MORE": "더 알아볼까요?",
        "ADMIN_LABEL": "<strong>관리페이지</strong>로 이동",
        "PROJECT_LABEL": "<strong>프로젝트</strong>로 이동",
        "STEP_1_TEXT": "컴퓨터가 인식할 것들의 예를 모아보세요",
        "STEP_2_TEXT": "예를 사용하여 컴퓨터가 그것을 인식하도록 훈련시켜보세요",
        "STEP_3_TEXT": "컴퓨터의 인식기능을 사용하는 스크래치 게임을 만들어보세요"
    },
    "LOGIN": {
        "TITLE": "머신러닝을 시작해봅시다",
        "WELCOME": "반가워요! 아이들을 위한 머신러닝 계정을 만들어보세요",
        "ALREADY_LOGGEDIN": "<strong>알림: </strong> 이미 로그인되어 있습니다",
        "ERROR": "<strong>오류:</strong> {{ message }}",
        "ERROR_HELP": "계속 오류가 난다면 도움말을 살펴보세요",
        "FIRST_TIME": "처음인가요?",
        "SIGN_UP": "계정 만들기",
        "WHY_REGISTER": "왜 등록하나요?",
        "WHY_REGISTER_INTRO_1": "Kids for Machine Learning을 사용하기 위해 <strong>계정을 꼭 만들 필요는 없지만</strong> 계정을 만들면 페이지의 여러 기느을 사용할 수 있습니다.",
        "WHY_REGISTER_INTRO_2": "아래의 표는 등록하지 않고 \"지금 사용해보기\"를 클릭하면 로그인할 계정을 만드는 경우 할 수 있는 기능의 차이를 설명합니다.",
        "ALREADY_REGISTERED": "이미 등록되어 있나요?",
        "LOGIN": "로그인",
        "FORGOT_DETAILS": "아이디나 비밀번호를 잊어버렸나요?",
        "TRY_TITLE": "등록 건너뛰기",
        "TRY_NOW": "지금 실행해보기",
        "BACK": "@:APP.BACK",
        "WHO_YOU": "누구십니까?",
        "TEACHER": "교사 혹은 코딩 클럽의 리더",
        "STUDENT": "학생",
        "FORGOT_TEXT": "아이디와 비밀번호를 잊어버렸나요? 괜찮아요. 우리도 종종 잊어버립니다"
    },
    "SIGNUP": {
        "TEACHER": {
            "TITLE": "교사 혹은 코딩 클럽의 리더입니까?",
            "INFO1": "여러분의 학생들이 접속할 수 있게끔 하려면, 먼저 교실을 만드세요",
            "INFO2": "누가 만드느냐에 따라 두 종류의 교실 계정이 있습니다"
        },
        "UNMANAGED": {
            "TITLE": "<strong>등록되지 않는</strong> 교실 계정을 만들기",
            "INTRO": "수업 계정을 직접 설정하고 관리하는 것이 더 좋다면 지금바로 시작 할 수 있습니다",
            "LISTINTRO": "다음과 같이 해야합니다:",
            "LIST_CREATEACCOUNT": "IBM Cloud에서 계정 만들기",
            "LIST_CREATEAPIKEYS": "머신러닝 모델을 학습하는 데 필요한 Watson 클라우드 서비스 용 API키 만들기",
            "LIST_ENTERAPIKEYS": "아이들을 위한 머신러닝에 API 키 입력하기",
            "HELP": "이 모든 것에 대한 단계별 지침(스크린 샷 포함)을 사용할 수 있습니다."
        },
        "MANAGED": {
            "TITLE": "<strong>관리되는 </ strong> 교실 계정 만들기",
            "INTRO": "Dale이 계정을 개설하는 것을 도와주길 원한다면, 아래 버튼을 사용하여 다음 정보가 포함된 전자 메일을 보내십시오:",
            "LIST_NUMBEROFSTUDENTS": "대략 얼마나 많은 학생 계좌가 필요한지",
            "LIST_NAMEOFSCHOOL": "학교 또는 코딩 그룹의 이름",
            "EMAIL": "이메일"
        }
    },
    "PROJECTS": {
        "TITLE": "당신의 머신러닝 프로젝트",
        "ADDNEWPROJECT": "프로젝트 추가",
        "CREATEFIRSTPROJECT": "'추가' 버튼을 클릭하여 여러분의 첫 번째 프로젝트를 만들어 보세요",
        "RECOGNISING": "인식",
        "AS": "as"
    },
    "NEWPROJECT": {
        "TITLE": "Start a new machine learning project",
        "PROJECT_NAME": {
            "TITLE": "Project Name",
            "NOTES": "Give your project a name to describe what sort of thing you'll try to teach the computer to recognise."
        },
        "WHOLE_CLASS_PROJECT": {
            "TITLE": "Whole-class project?",
            "NOTES_1": "Tick this if you want your whole class to be able to work on this project together.",
            "NOTES_2": "This is useful for projects that teach crowd-sourcing as an approach to training machine learning projects."
        },
        "TYPES": {
            "LABEL": "Recognising",
            "NOTES_1": "What type of thing do you want to teach the computer to recognise?",
            "NOTES_2": "For words, sentences or paragraphs, choose \"text\"",
            "NOTES_3": "For photos, diagrams and pictures, choose \"images\"",
            "NOTES_4": "For sets of numbers or multiple choices, choose \"numbers\""
        },
        "LANGUAGE": {
            "LABEL": "Language",
            "NOTES": "What language will the text in this project be?"
        },
        "FIELDS": {
            "TYPE": {
                "TITLE": "Type of value",
                "NUMBER": "number",
                "MULTIPLE_CHOICE": "multiple-choice"
            },
            "CHOICES": {
                "TITLE": "Choices:",
                "LABEL": "add a choice"
            },
            "NEWFIELD": {
                "DESCRIBE_FIELD": "Give this field a name to describe the value",
                "MULTICHOICE": "If it can be described as choosing from a few options, choose \"multiple-choice\".",
                "ADD_FIRST_FIELD": "Type in a choice to use in your multiple-choice list, then press Enter.",
                "ADD_ANOTHER_FIELD": "Type in another choice to use in your multiple-choice list, then press Enter."
            },
            "NEWVALUE": {
                "ADD_FIRST_VALUE": "Start to describe the values that you'll include with each example to train the computer with by clicking the 'Add a value' button.",
                "VALUES_LIMIT": "You are not allowed more than 10 values in a project."
            }
        },
        "CREATE": "Create"
    },
    "PROJECT": {
        "TRAIN": {
            "TITLE": "훈련",
            "BODY": "컴퓨터가 훈련할 수 있도록 다양한 데이터를 준비하세요"
        },
        "LEARNANDTEST": {
            "TITLE": "학습 &amp; 평가",
            "BODY": "데이터를 사용하여 컴퓨터를 학습시키세요"
        },
        "MAKES": {
            "TITLE": "Make",
            "BODY": "Use the machine learning model you've trained to make a game or app, in Scratch or in Python"
        },
        "SCRATCH": {
            "TITLE": "스크래치",
            "BODY": "여러분이 만든 머신러닝 모델을 스크래치를 사용하여 적용하세요"
        },
        "PYTHON": {
            "TITLE": "파이썬",
            "BODY": "여러분이 만든 머신러닝 모델을 파이썬을 사용하여 적용하세요"
        },
        "APPINVENTOR": {
            "TITLE": "앱 인벤터",
            "BODY": "여러분이 만든 머신러닝 모델을 앱 인벤터를 사용하여 적용하세요"
        },
        "SCRATCH3": {
            "TITLE": "스크래치 3",
            "BODY": "여러분이 만든 머신러닝 모델을 새로운 버전의 스크래치를 사용하여 적용하세요"
        }
    },
    "TRAINING": {
        "TITLE": "훈련",
        "ADDLABEL": "새로운 라벨 추가",
        "CREATEFIRSTLABEL": "'추가' 버튼을 클릭하여 당신의 첫번째 바구니를 만드세요",
        "CROWDSOURCEDEMPTY": "선생님이 새로운 바구니를 만든 다음 페이지를 새로고침하세요",
        "ADDEXAMPLE": "데이터 추가",
        "ADDURL": "웹",
        "ADDWEBCAM": "웹캠",
        "ADDDRAWING": "그리기",
        "DRAGIMAGES": "사진을 드래그하여 가져오세요",
        "NEWLABEL": {
            "INTRO": "새로운 라벨을 추가하세요",
            "ERROR": "라벨 이름은 숫자와 문자로만 작성하세요"
        },
        "NEWEXAMPLE": {
            "INTRO": "새로운 데이터를 추가하세요 ",
            "INTROURL": "데이터의 URL을 입력하세요",
            "INTRODRAWING": "데이터를 그려주세요",
            "INTROWEBCAM": "새로운 데이터를 만드세요",
            "ERROR": "탭이나 줄바꿈을 할 수 없습니다",
            "REQUIRED": "데이터의 모든 필드를 작성하여야 합니다",
            "PATTERNNUMBER": "숫자처럼 보이지 않네요",
            "PATTERNURL": "이 사진은 웹 주소가 필요합니다",
            "WEBCAMFAIL": "이런! 웹캠이 연결되었나요?",
            "WEBCAMERROR": "웹 브라우저에서 가져온 메세지: "
        }
    },
    "MODELS": {
        "TITLE": "머신 러닝 모델",
        "TRAIN": "새로운 머신 러닝 모델을 훈련시켜보세요",
        "CANCEL": "훈련 취소",
        "DELETE": "모델 삭제",
        "WHATHAVEYOUDONE": {
            "TITLE": "무슨일이죠?",
            "PLEASEWAIT": "몇 분이 걸려요. 하지만 트레이닝 컴퓨터가 바쁘다면 조금 더 걸릴 수 있어요.",
            "FAIL": "에고.. 뭔가 문제가 있네요",

            "TRAINING" : {
                "CROWDSOURCED" : {
                    "TEXT" : "Your class is training a machine learning model using the examples of text that you all collected.",
                    "IMAGES" : "Your class is training a machine learning model using the examples of images that you all collected.",
                    "NUMBERS" : "Your class is training a machine learning model using the examples of numbers that you all collected."
                },
                "INDIVIDUAL" : {
                    "TEXT" : "You've started training a machine learning model using the examples of text that you collected.",
                    "IMAGES" : "You've started training a machine learning model using the examples of images that you collected.",
                    "NUMBERS" : "You've started training a machine learning model using the examples of numbers that you collected."
                },
                "SINCE": "It's been training since"
            },
            "READY" : {
                "CROWDSOURCED" : {
                    "TEXT" : "Your class has trained a machine learning model to recognise when text is ",
                    "IMAGES" : "Your class has trained a machine learning model to recognise when images are ",
                    "NUMBERS" : "Your class has trained a machine learning model to recognise when numbers are "
                },
                "INDIVIDUAL" : {
                    "TEXT" : "You have trained a machine learning model to recognise when text is ",
                    "IMAGES" : "You have trained a machine learning model to recognise when images are ",
                    "NUMBERS" : "You have trained a machine learning model to recognise when numbers are "
                },
                "CREATED" : {
                    "TEACHER" : "Your teacher created the model on ",
                    "YOU" : "You created the model on "
                },
                "TRAINING" : {
                    "CLASS" : "Your class has collected: ",
                    "YOU" : "You have collected: "
                }
            },
            "ERROR": {
                "CROWDSOURCED" : {
                    "CLASS" : {
                        "TEXT" : "Your teacher tried training a machine learning model using the examples of text that your class collected.",
                        "IMAGES" : "Your teacher tried training a machine learning model using the examples of images that your class collected.",
                        "NUMBERS" : "Your teacher tried training a machine learning model using the examples of numbers that your class collected."
                    },
                    "YOU" : {
                        "TEXT" : "You tried training a machine learning model using the examples of text that your class collected.",
                        "IMAGES" : "You tried training a machine learning model using the examples of images that your class collected.",
                        "NUMBERS" : "You tried training a machine learning model using the examples of numbers that your class collected."
                    }
                },
                "INDIVIDUAL" : {
                    "TEXT" : "You tried training a machine learning model using the examples of text that you collected.",
                    "IMAGES" : "You tried training a machine learning model using the examples of images that you collected.",
                    "NUMBERS" : "You tried training a machine learning model using the examples of numbers that you collected."
                }
            },
            "IDLE" : {
                "NOLABELS" : {
                    "CROWDSOURCED" : {
                        "TEXT" : "Your class said you want to collect examples of text.",
                        "IMAGES" : "Your class said you want to collect examples of images.",
                        "NUMBERS" : "Your class said you want to collect examples of numbers."
                    },
                    "INDIVIDUAL" : {
                        "TEXT" : "You've said you want to collect examples of text.",
                        "IMAGES" : "You've said you want to collect examples of images.",
                        "NUMBERS" : "You've said you want to collect examples of numbers."
                    }
                },
                "NODATA" : {
                    "CROWDSOURCED" : {
                        "TEXT" : "Your class said that you want to collect examples of text for a computer to recognise when text is ",
                        "IMAGES" : "Your class said that you want to collect examples of images for a computer to recognise when images are ",
                        "NUMBERS" : "Your class said that you want to collect examples of numbers for a computer to recognise when numbers are "
                    },
                    "INDIVIDUAL" : {
                        "TEXT" : "You said that you want to collect examples of text for a computer to recognise when text is ",
                        "IMAGES" : "You said that you want to collect examples of images for a computer to recognise when images are ",
                        "NUMBERS" : "You said that you want to collect examples of numbers for a computer to recognise when numbers are "
                    }
                },
                "NOEXAMPLES" : {
                    "CLASS" : "So far, your class haven't collected any examples yet.",
                    "YOU" : "So far, you haven't collected any examples yet."
                },
                "DATA" : {
                    "CROWDSOURCED" : {
                        "TEXT" : "Your class has collected examples of text for a computer to use to recognise when text is ",
                        "IMAGES" : "Your class has collected examples of images for a computer to use to recognise when images are ",
                        "NUMBERS" : "Your class has collected examples of numbers for a computer to use to recognise when numbers are "
                    },
                    "INDIVIDUAL" : {
                        "TEXT" : "You have collected examples of text for a computer to use to recognise when text is ",
                        "IMAGES" : "You have collected examples of images for a computer to use to recognise when images are ",
                        "NUMBERS" : "You have collected examples of numbers for a computer to use to recognise when numbers are "
                    },
                    "COLLECTED" : {
                        "CLASS" : "They've collected: ",
                        "YOU" : "You've collected: "
                    }
                }
            }
        },
        "WHATSNEXT": {
            "TITLE": "다음은?",
            "PLEASEWAIT": "조금만 더 기다리세요",
            "OFFERQUIZ": "아니면 머신러닝과 관련된 문제를 풀면서 기다려볼래요?",
            "FAIL": "트레이닝 컴퓨터에서 보내온 에러 메시지는 아래와 같아요. 이해가 된다면 여러분이 직접 문제를 해결해보세요. 그렇지 않다면, 다시 한번 시도해보세요.",

            "IDLE": {
                "NOLABELS" : "The next step is to go to the <strong>Train</strong> page. Add some labels for each of the things that you want to teach the computer to be able to recognise.",
                "ONELABEL" : {
                    "EXPLANATION": "You've only said one thing that you want the computer to be able to recognise: {{ label }}",
                    "ISTHATALL": "Is that the only thing you want the computer to be able to recognise?",
                    "NO": "<strong>No?</strong><br/>Go back to the <strong>Train</strong> page.<br/>Add more labels for each of the things that you want to teach the computer to be able to recognise.<br/><br/>",
                    "YES": "<strong>Yes?</strong><br/>You need to do a little more work first.<br/>For the computer to be able to learn how to recognise \"{{ label }}\", you need to give it some examples of things that aren't {{ label }}.<br/>Go back to the <strong>Train</strong> page and create a new label for examples of things that aren't {{ label }}. You could call it \"not-{{ label }}\"."
                },
                "LABELS" : {
                    "NO_DATA" : "The next step is to go to the <strong>Train</strong> page. Add examples for each of the labels.",
                    "MORE_DATA" : {
                        "KEEP_GOING": "Keep going!",
                        "MORE_EXAMPLES" : {
                            "YOU": "Go back to the <strong>Train</strong> page and collect more examples for each of the labels.",
                            "CLASS": "Ask your class to go back to the <strong>Train</strong> page and collect more examples for each of the labels."
                        },
                        "MORE_IS_BETTER" : "The more you can get, the better it should learn, but you need at least {{ minimumExamples }} examples of each as an absolute minimum."
                    },
                    "ENOUGH_DATA" : {
                        "READY_TO_START" : "Ready to start the computer's training?",
                        "START_TRAINING" : {
                            "CROWDSOURCED" : "Click the button below to start training a machine learning model using the examples your class have collected so far",
                            "INDIVIDUAL" : "Click the button below to start training a machine learning model using the examples you have collected so far"
                        },
                        "MORE_EXAMPLES" : {
                            "CROWDSOURCED" : "(Or ask your class to go back to the <strong>Train</strong> page if you want them to collect more examples first.)",
                            "INDIVIDUAL" : "(Or go back to the <strong>Train</strong> page if you want to collect some more examples first.)"
                        },
                        "WAITING_FOR_TEACHER" : "Waiting for your teacher to start the computer's training."
                    }
                }
            },
            "READY" : {
                "TEST" : {
                    "TEXT" : "Try testing the machine learning model below. Enter an example of text below, that you didn't include in the examples you used to train it. It will tell you what it recognises it as, and how confident it is in that.",
                    "IMAGES" : "Try testing the machine learning model below. Enter an example image below, that you didn't include in the examples you used to train it. It will tell you what it recognises it as, and how confident it is in that.",
                    "NUMBERS" : "Try testing the machine learning model below. Enter an example of numbers below, that you didn't include in the examples you used to train it. It will tell you what it recognises it as, and how confident it is in that."
                },
                "SCRATCH" : "If the computer seems to have learned to recognise things correctly, then you can go to Scratch and use what the computer has learned to make a game!",
                "ADDITIONAL_TRAINING" : {
                    "MORE_EXAMPLES" : {
                        "CROWDSOURCED" : "If the computer is getting too many things wrong, your class might want to go back to the <strong>Train</strong> page and collect some more examples.",
                        "INDIVIDUAL" : "If the computer is getting too many things wrong, you might want to go back to the <strong>Train</strong> page and collect some more examples"
                    },
                    "RETRAIN" : {
                        "YOU" : "Once you've done that, click on the button below to train a new machine learning model and see what difference the extra examples will make!",
                        "CLASS" : "Once you've done that, your teacher will need to train a new machine learning model."
                    }
                }
            }
        },
        "TRAINING": {
            "TITLE": "트레이닝 컴퓨터 정보:",
            "STARTED": "시작한 시간:",
            "STATUS": "모델의 상태:",
            "DETAIL": "상세정보:",
            "DELETION": "모델 지속 시간:",
            "LASTCHECK": "최근 모델 체크 시간:",
            "PROMPTREFRESH": "페이지를 새로고침하여 최신의 상태를 알아보세요"
        },
        "TESTING": {
            "INTRO": {
                "TEXT": "Try putting in some text to see how it is recognised based on your training.",
                "IMAGES": "Try putting in an image to see how it is recognised based on your training.",
                "NUMBERS": "Try putting in some numbers to see how it is recognised based on your training."
            },
            "WEBCAM": "Test with <strong>webcam</strong>",
            "DRAWING": "Test by <strong>drawing</strong>",
            "WWW": "Test with <strong>www</strong>",
            "RECOGNISED": "Recognised as  <strong>{{ testoutput }}</strong>"
        },
        "QUIZ": {
            "TITLE": "퀴즈 시간!",
            "INTROQUESTION": "모델이 만들어질 때 까지 문제를 한번 풀어보세요",
            "PREVIOUSLY_ATTEMPTED": "You've seen this one before - let's see if you remember what the right answer is this time!",
            "CORRECT_ANSWER": "That's right!",
            "INCORRECT_ANSWER": "No, sorry. The correct answer is shown above.",
            "NEXT_QUESTION": "Next question"
        }
    },
    "MAKES": {
        "TITLE": "Make something with your machine learning model",
        "SCRATCH2": "Make a project in the current version of Scratch",
        "SCRATCH3": "Use the new (beta) version of Scratch",
        "PYTHON": "Write Python code to use your machine learning model",
        "APPINVENTOR": "Make a mobile app for your phone or tablet"
    },
    "PYTHON": {
        "TITLE": "파이썬에서 머신러닝 사용하기",

        "NOTREADY": "아직 준비중입니다",
        "NOMODEL": "훈련된 모델이 없습니다"
    },
    "APPINVENTOR": {
        "TITLE": "앱 인벤터에서 머신러닝 사용하기",

        "NOTREADY": "아직 준비중입니다",
        "NOMODEL": "훈련된 모델이 없습니다",

        "BETAWARNING": "베타버전입니다. 앱 인벤터 지원이 완벽하지 않으며, 몇몇 버그를 수정중이에요."
    },
    "SCRATCH": {
        "TITLE": "스크래치에서 머신러닝 사용하기",

        "NOTREADY": "아직 준비중입니다",
        "NOMODEL": "훈련된 모델이 없습니다",

        "LAUNCH": "스크래치에서 열기",

        "LAUNCH_SCRATCH_BY_ITSELF": "(You can use <a href='{{ url }}' class='btn btn-default' target='_blank'>Scratch by itself</a> if you want.)",
        "GO_TO_LEARNANDTEST": "Or go to the <strong>Learn &amp; Test</strong> page for some tips on what to do next.",

        "MORE_BLOCKS": "Your project will add these blocks to the <span style='background-color: purple; color: white; padding-left: 7px; padding-right: 7px; white-space: nowrap;'>More Blocks</span> tab in Scripts.",
        "EXPLAIN_RECOGNISE_LABEL": "Put {{ type }} in the input for this, and it will return the label that your machine learning model recognises it as.",
        "EXPLAIN_RECOGNISE_CONFIDENCE": "This will return how confident your machine learning model is that it recognises the type of {{ type }}. (As a number from 0 - 100).",
        "EXPLAIN_LABELS": "These blocks represent the labels you've created in your project, so you can use their names in your scripts.",
        "EXPLAIN_COSTUMEIMAGE": "This block is in the Looks palette for Sprites and will return the image of the currently selected costume.",
        "SAMPLE_SCRIPT": "This means you can do something like this:",
        "SAMPLE_SCREENSHOT": "It will look something like this - except with the name of your project.",
        "EXPLAIN_STATUS": "The coloured circle next to your project name tells you if your machine learning model is okay.",
        "STATUS_GREEN": "means your model is trained and ready to go",
        "STATUS_YELLOW": "means your model hasn't finished training yet",
        "STATUS_RED": "means something went wrong. Go back to the <strong>Learn &amp; Test</strong> page to see what went wrong with training."
    },
    "SCRATCH3": {
        "TITLE": "스크래치3에서 머신러닝 사용하기",

        "LAUNCH": "Open in Scratch 3",

        "BETAWARNING": "베타버전입니다. 스크래치3 지원이 완벽하지 않으며, 몇몇 버그를 수정중이에요."
    },
    "WORKSHEETS": {
        "TITLE": "머신러닝 프로젝트",

        "INTRO_1": "이 프로젝트는 다운로드가 가능한 단계별 가이드이며, 학생들이 따라할 수 있도록 스크린샷과 설명이 있습니다.",
        "INTRO_2": "각 프로젝트는 하나의 수업주제를 가지고 있으며, 학생들이 AI와 머신러닝을 사용하여 게임과 상호작용이 가능한 프로젝트를 만들 수 있습니다.",
        "INTRO_3": "새로운 워크시트에 대한 제안이나, 워크시트에 대한 의견, 그리고 새로운 워크시트 개발에 참여해주시길 바랍니다.",

        "TYPES": {
            "TITLE": "인식:",
            "ALL": "모든 프로젝트",

            "PREFIX": "인식을 위한 컴퓨터 훈련",

            "TEXT": "텍스트",
            "IMAGES": "이미지",
            "NUMBERS": "숫자"
        },

        "LEVELS": {
            "TITLE": "난이도:",
            "ALL": "모든 난이도",
            "BEGINNER": "초급",
            "INTERMEDIATE": "중급",
            "ADVANCED": "상급"
        },

        "DOWNLOAD": "다운로드",


        "SMARTCLASSROOM": {
            "TITLE": "스마트 교실",
            "SUMMARY": "당신의 말을 알아들을 수 있도록 컴퓨터를 가르쳐봐요",
            "DESCRIPTION": "가상 기기에서 조정할 수 있는 스마트 어시스턴트를 만들어봐요"
        },
        "MAKEMEHAPPY": {
            "TITLE": "날 기쁘게 해줘요",
            "SUMMARY": "칭찬과 모욕을 인식하도록 컴퓨터를 가르쳐봐요",
            "DESCRIPTION": "멋진 것을 말하면 웃고, 그렇지 않으면 우는 만드는 캐릭터를 스크래치로 만들어봐요"
        },
        "SNAP": {
            "TITLE": "스냅!",
            "SUMMARY": "어떤 아이콘이 보이는지 컴퓨터가 인식하도록 가르쳐봐요",
            "DESCRIPTION": "카드 사진을 인식하는 방법을 배우는 Scratch의 카드 게임을 만들어봐요"
        },
        "CHAMELEON": {
            "TITLE": "Chameleon",
            "SUMMARY": "Teach a computer to recognise colours",
            "DESCRIPTION": "Make a chameleon in Scratch that changes colour to match its background"
        },
        "MAILMANMAX": {
            "TITLE": "우편배달부",
            "SUMMARY": "컴퓨터에 손글씨 인식을 가르쳐봐요",
            "DESCRIPTION": "봉투에 손으로 쓴 우편번호를 인식 할 수있는 스크래치에 우편 정렬 사무실을 만들어봐요"
        },
        "CARORCUP": {
            "TITLE": "자동차 또은 컵",
            "SUMMARY": "컴퓨터에 물체의 그림을 인식하도록 가르쳐봐요",
            "DESCRIPTION": "사진을 그룹화할 수 있도록 컴퓨터를 가르쳐봐요"
        },
        "FACELOCK": {
            "TITLE": "얼굴 잠금 장치",
            "SUMMARY": "얼굴을 인식하도록 컴퓨터를 가르쳐봐요",
            "DESCRIPTION": "얼굴을 인식하면 잠금을 해제하는 전화를 Scratch로 만들어봐요"
        },
        "JOURNEYTOSCHOOL": {
            "TITLE": "학교 가는 길",
            "SUMMARY": "컴퓨터에 예측을 하도록 가르쳐봐요",
            "DESCRIPTION": "아침에 학교에 가는 방법을 예측할 수 있도록 컴퓨터를 가르쳐봐요"
        },
        "SHYPANDA": {
            "TITLE": "Shy Panda",
            "SUMMARY": "Teach a computer to recognise pictures",
            "DESCRIPTION": "Make a dancing panda that gets shy and stops dancing if it sees you looking."
        },
        "PACMAN": {
            "TITLE": "팩맨",
            "SUMMARY": "게임을 하기 위해 컴퓨터를 가르쳐봐요",
            "DESCRIPTION": "유령을 피하는 방법을 배우는 팩맨 게임을 Scratch에서 만들어봐요"
        },
        "CHATBOTS": {
            "TITLE": "챗봇",
            "SUMMARY": "컴퓨터에 질문을 인식하도록 가르쳐봐요",
            "DESCRIPTION": "선택한 주제에 관한 질문에 답변 할 수있는 챗봇을 만들어봐요"
        },
        "TOURISTINFO": {
            "TITLE": "여행자 정보",
            "SUMMARY": "컴퓨터가 추천을 하도록 가르쳐봐요",
            "DESCRIPTION": "스크래치에서 사람들의 관심사를 기반으로하는 관광 명소를 추천하는 모바일 앱을 만들어봐요"
        },
        "SORTINGHAT": {
            "TITLE": "모자 정렬",
            "SUMMARY": "컴퓨터가 말을 인식하도록 가르쳐봐요",
            "DESCRIPTION": "Harry Potter와 같은 Sorting Hat을 만들면, 당신이 말하는 대로 학교에 들어갈 수 있습니다"
        },
        "ROCKPAPERSCISSORS": {
            "TITLE": "가위바위보",
            "SUMMARY": "모양을 인식하도록 컴퓨터를 가르쳐봐요",
            "DESCRIPTION": "손 모양을 인식하는 바위, 종이, 가위 (Scissors) 게임을 스크래치로 만들어봐요"
        },
        "JUDGEABOOK": {
            "TITLE": "책 구별사",
            "SUMMARY": "시각적 스타일을 인식하도록 컴퓨터를 가르쳐봐요",
            "DESCRIPTION": "Scratch에서 게임을 만들어 책 표지를 판단 할 수 있는지 테스트 해봐요"
        },
        "LOCATELARRY": {
            "TITLE": "래리 찾기",
            "SUMMARY": "그림에서 무엇을 찾도록 컴퓨터를 가르쳐봐요",
            "DESCRIPTION": "\"월리를 찾아라?\"와 같은 게임을 만들고, 여러분의 캐릭터를 찾을 수 있는 컴퓨터를 만들어봐요"
        },
        "CONFUSED": {
            "TITLE": "맨붕",
            "SUMMARY": "과일을 인식하도록 컴퓨터를 가르쳐봐요",
            "DESCRIPTION": "잘못 훈련된 경우 컴퓨터가 얼마나 혼란스러워하고 실수를 저지르는지 살펴봐요"
        },
        "SCHOOLLIBRARY": {
            "TITLE": "도서관",
            "SUMMARY": "컴퓨터가 추천을 하도록 가르치십시오.",
            "DESCRIPTION": "어떤 책이 적합한지를 제안하는 학교 사서를 스크래치로 만들어봐요"
        },
        "NOUGHTSANDCROSSES": {
            "TITLE": "동그라미 & 엑스 게임",
            "SUMMARY": "게임을 하기 위해 컴퓨터를 가르쳐봐요",
            "DESCRIPTION": "여러분과 게임할 수 있는 동그라미 & 엑스 게임을 할 수 있는 컴퓨터를 스크래치에서 만들어보세요"
        },
        "TOPTRUMPS": {
            "TITLE": "탑 트럼프",
            "SUMMARY": "게임을 하기 위해 컴퓨터를 가르쳐봐요",
            "DESCRIPTION": "여러분과 게임할 수 있는 탑 트럼프 게임을 할 수 있는 컴퓨터를 스크래치에서 만들어보세요"
        },
        "HEADLINES": {
            "TITLE": "헤드라인",
            "SUMMARY": "언어를 인식하는 컴퓨터의 능력을 테스트해봐요",
            "DESCRIPTION": "전국 신문의 헤드 라인을 인식하도록 컴퓨터를 만들어봐요"
        }
    },
    "TEACHER": {
        "MENU": {
            "TITLE": "관리자",

            "RESTRICTIONS": {
                "TITLE": "제한 사항",
                "DESCRIPTION": "여러분의 교실에 적용되는 제한 사항입니다"
            },
            "APIKEYS": {
                "TITLE": "API Keys",
                "TITLELONG": "Watson API Keys",
                "DESCRIPTION": "여러분의 교실에서 머신러닝 모델을 만들 수 있도록 IBM Watson 인증 정보를 준비하세요"
            },
            "STUDENTS": {
                "TITLE": "학생",
                "TITLELONG": "학생 관리",
                "DESCRIPTION": "학급의 학생들을 위한 로그인 생성, 재설정 및 삭제"
            },
            "SUPERVISION": {
                "TITLE": "관리",
                "DESCRIPTION": "학생들이 만든 프로젝트 검토"
            },

            "ADVANCEDOPTIONS": "고급 옵션",

            "DELETECLASS": {
                "TITLE": "교실 삭제",
                "DESCRIPTION": "당신과 당신의 학급에 있는 모든 학생의 계정이 삭제됩니다"
            },

            "CANYOUHELP": {
                "TITLE": "Can you help?",
                "DESCRIPTION": "Please share your experiences and ideas for how to make the tool better"
            },

            "NOTAUTHORISED": "You are not authorized to access the teacher page for your class."
        },
        "APIKEYS": {
            "TITLE": "Administration : IBM Watson API Keys",

            "ADDNEWCREDENTIALS": "Add new credentials",
            "ADDAPIKEY": "Add new API key",
            "REMOVE": "Remove",

            "NO_TEXT_CREDENTIALS": "You don't have any Assistant credentials. This means that it will not be possible to train models for <strong>text</strong> projects.",
            "NO_IMAGE_CREDENTIALS": "You don't have any Visual Recognition API keys. This means that it will not be possible to train models for <strong>images</strong> projects.",

            "NOTAUTHORISED": "You are not authorized to access the Watson API keys used by your class.",
            "MANAGEDCLASS": "API Keys used by your class are being managed for you.",

            "HELP_STEPBYSTEP_GUIDE": "If you're not sure what to do here, please follow the <a href='https://github.com/IBM/taxinomitis-docs/raw/master/docs/pdf/machinelearningforkids-apikeys.pdf'> step-by-step guide </a>. If you'd like any help, please <strong><a style='cursor: pointer;' ui-sref='help'>get in touch</a></strong>.",

            "INTRO_WATSONASSISTANT": "Training machine learning models for <span class='mlprojecttype'>text</span> projects uses <a class='mlprojecttype' href='https://www.ibm.com/watson/services/conversation/'>Watson Assistant</a>",
            "INTRO_VISUALRECOGNITION": "Training machine learning models for <span class='mlprojecttype'>images</span> projects uses <a class='mlprojecttype' href='https://www.ibm.com/watson/services/visual-recognition/'>Watson Visual Recognition</a>",

            "ERROR_FETCHING_WATSONASSISTANT": "Failed to get your Watson Assistant passwords",
            "ERROR_FETCHING_VISUALRECOG": "Failed to get your Visual Recognition API keys",

            "USERNAME": "Username",
            "PASSWORD": "Password",
            "APIKEY": "API key",

            "NUMBER_OF_ML_MODELS": "Number of ML models",
            "UNKNOWN": "unknown",
            "UNLIMITED": "unlimited",

            "LIMIT_TEXT_PROJECTS": "Number of text machine learning models your students can have:",
            "LIMIT_IMAGE_PROJECTS": "Number of images machine learning models your students can have:"
        }
    },
    "HELP": {
        "CONTACT": "문제가 있거나 궁금한 사항이 있으면 이메일 Dale.Lane@uk.ibm.com로 연락주세요",
        "GETTINGSTARTED": {
            "TITLE": "시작하기",
            "INTRO": "한번에 시작하기 PDF 다운로드:",
            "MANAGED": "관리 클래스 계정",
            "MANAGEDEXPL": "학교 교사, 코딩 그룹 지도자 또는 기타 자원 봉사자의 경우",
            "UNMANAGED": "관리되지 않는 클래스 계정",
            "UNMANAGEDEXPL": "자신의 클래스 계정을 관리하는 IBM 직원 또는 교사 및 코딩 그룹 책임자의 경우"
        },
        "FAQS": {
            "TITLE": "더 알고 싶나요?",
            "INTRO1": "뭔가 작동하지 않나요?",
            "INTRO2": "아래 목록에는 가장 자주 듣는 질문과 문제가 포함되어 있습니다. 문제와 비슷한 것으로 보이는 것이 있으면 요약 정보를 클릭하세요.",
            "INTRO3": "아직 해결이 안되거나, 목록에 포함되지 않은 문제가 발생하였나요? 죄송합니다! <a href='mailto:dale.lane@uk.ibm.com'>로 이메일을 보내주세요. </a> 또는 <a href='https://github.com/IBM/taxinomitis/issues'> 문제 보고서</a>를 작성해주세요."
        },

        "SCRATCH": {
            "TITLE": "스크래치 문제",

            "Q1": "스크래치를 어떻게 하는지 모릅니다",
            "Q1-A-1": "아이들을 위한 머신러닝은 Scratch 2를 사용합니다. Scratch는 Adobe Flash가 필요하므로 Flash로 작업 할 수있는 운영 체제와 웹 브라우저를 사용하여야 합니다(아이패드는 사용할 수 없어요).",
            "Q1-A-2": "플래시를 활성화하는 방법에 대해 잘 모르는 경우 <a href = 'https : //github.com/IBM/taxinomitis-docs/raw/master/docs/pdf/ machinelearningforkids-scratchx.pdf '> 스크래치 작업을 위한 팁을 포함한 문서를 다운로드하세요.",

            "Q2": "\"프로젝트 열기\"나 \"프로젝트 저장\" 메뉴가 작동하지 않습니다",
            "Q2-A-1": "macOS의 사파리 브라우저에서 스크래치 메뉴의 \"File -&gt; 프로젝트 불러오기\" 와 \"File -&gt; 프로젝트 저장\" 가 작동하지 않는다면, 아마 세이프 모드에서 실행중일 수 있습니다.",
            "Q2-A-2": "이 문제를 해결하기 위해 <a href='https://github.com/IBM/taxinomitis-docs/raw/master/docs/pdf/safari-scratch-safemode.pdf'>사용 설명서</a>를 살펴보세요.",

            "Q3": "스크래치에서 머신러닝 블록이 작동하지 않습니다",
            "Q3-A-1": "때때로 컴퓨터 학습 모델의 스크래치 블록 서버와 연결이 끊길 수 있습니다. 이렇게 되면 결과를 반환하지 않습니다.",
            "Q3-A-2": "\"추가 블럭\"팔레트에서 상태 표시등을 사용하여이 문제가 발생했는지 여부를 확인할 수 있습니다.",
            "Q3-A-3": "스크래치 블록을 학습하는 머신 옆의 상태 표시등이 빨간색이면 일반적으로 이상이 있음을 나타냅니다. 일시적인 문제 일 수 있습니다. '파일' -&gt; '프로젝트 저장'을 사용하여 프로젝트를 저장한 다음 브라우저 페이지를 새로 고침하십시오. 페이지가 다시 로드된 후 상태 표시등이 녹색으로 바뀌면 '파일' -&gt; '프로젝트 불러오기'를 사용하여 프로젝트를 가져와서 중단한 부분부터 시작할 수 있습니다",
            "Q3-A-4": "페이지를 새로고침 한 후에도 상태 표시등이 여전히 빨간색이면 머신러닝 모델에 문제가 있을 수 있습니다. \"학습 & amp; 테스트\" 페이지에서 모델에 대한 오류 메시지를 찾을 수 있습니다.",
            "Q3-A-5": "스크래치 블록을 학습하는 머신 옆의 상태 표시등이 녹색이면 블록이 작동해야합니다. 예상한 답을 얻지 못하면 \"학습 및 테스트\"페이지로 이동하여 모델의 결과를 확인하십시오.",

            "Q5": "모든 버전의 스크래치를 사용할 수 있습니까?",
            "Q5-A-1": "아이들을 위한 머신러닝 사이트에서 제공하는 Scratch 버전을 사용해야합니다. 프로젝트 페이지에서 스크래치(또는 '스크래치 3') 버튼을 클릭하면 시작할 수 있습니다."
        },

        "TRAININGUI": {
            "TITLE": "트레이닝 UI 문제",

            "Q1": "이미지를 트레이닝 버킷으로 드래그(이미지 프로젝트용)할 수 없습니다.",
            "Q1-A-1": "Safari 또는 Internet Explorer를 사용하는 경우 트레이닝 버킷으로 이미지를 드래그하면 작동하지 않습니다.",
            "Q1-A-2": "죄송합니다. Firefox나 Chrome과 같은 다른 브라우저를 사용할 수 있다면 그렇게 하십시오. 그렇지 않으면 \"www \"버튼을 클릭하여 트레이닝 사진의 URL을 붙여 넣으세요."
        },

        "MODELS": {
            "TITLE": "머신러닝 모델의 훈련 오류",

            "Q1": "\"Watson 인증서가 설정되지 않았습니다\"",
            "Q1-A-1": "머신러닝 모델은 IBM Watson API를 사용하여 작성됩니다.",
            "Q1-A-2": "\"관리되지 않는\" 클래스 계정이 있으면, 선생님이나 그룹 리더가 IBM Cloud에서 Watson API 인증서를 입력해야 작동할 수 있습니다. 그 방법은 페이지 상단의 \"시작하기\"에 있습니다.",

            "Q2": "\"학급에서 사용중인 Watson 인증서가 거부되었습니다\"",
            "Q2-A-1": "도구의 머신러닝 모델은 IBM Watson API를 사용하여 작성됩니다.",
            "Q2-A-2": "\"관리되지 않는\" 클래스 계정이 있는 경우 선생님이나 그룹 리더는 IBM Cloud의 Watson API 인증서를 입력하여야 합니다.",
            "Q2-A-3": "그러나 제공된 인증서가 현재 작동하지 않을 때, 가장 가능성 있는 이유는 원래 제공된 이후 인증서가 IBM Cloud에서 삭제되었을 경우입니다. 그렇지 않은 경우에는 선생님 또는 왓슨 신임장을 제공 한 그룹 리더가, 왓슨 어시스턴트 또는 시각적 인식 서비스의 상태를 확인하기 위해 IBM Cloud 대시 보드로 되돌아 가야합니다.",

            "Q3": "\"Watson Assistant API keys에 더 이상 사용할 수있는 작업 공간이 없습니다.\"",
            "Q3-A-1": "도구의 머신러닝 모델은 IBM Watson API를 사용하여 작성됩니다.",
            "Q3-A-2": "교사가 만든 Watson Assistant (이전의 Watson Conversation)인증서에는 만들 수 있는 머신러닝 모델의 수에 제한이 있습니다. 이는 IBM Cloud UI에 표시되며 자격 증명은 \"workspaces\"에서 생성됩니다.",
            "Q3-A-3": "이 한도를 초과하면 새로운 기계 학습 모델을 교육하려는 시도가 실패하고 다음의 메시지가 표시됩니다:",
            "Q3-A-4": "여러분의 클래스는 이미 최대 허용 모델 수를 만들었습니다. 선생님이나 그룹 리더에게 \"Watson Assistant API 키가 더 이상 사용할 수있는 작업 공간이 없음\"을 알리십시오.",
            "Q3-A-5": "성공적으로 훈련된 모델을 가진 학생이 모델을 삭제하면 다른 학생이 사용할 수 있도록 작업 공간이 비워집니다.",
            "Q3-A-6": "향후이 오류를 피하는 한가지 방법은 클래스 크기를 줄이는 것입니다. 왓슨 어시스턴트(이전의 Watson Conversation) 인증서에서 지원하는 작업 영역 수보다 학생 수가 적으면 제한이 적용되지 않습니다.",
            "Q3-A-7": "이 오류를 피할 수있는 또 다른 방법은 클래스에 Watson Assistant API 키를 추가하거나 제한이 적은 Watson Assistant 인스턴스 \"plan\"을 사용하는 것입니다.",

            "Q4": "\"Watson Visual Recognition API keys에서 사용할 수 있는 분류기가 더 이상 없습니다.\"",
            "Q4-A-1": "머신러닝 모델은 IBM Watson API를 사용하여 작성됩니다.",
            "Q4-A-2": "교사가 만든 Watson Visual Recognition 인증서는 만들 때 사용할 수있는 머신러닝 모델의 수에 제한이 있습니다. 이는 인증서가 생성된 IBM Cloud UI에 표시되며, \"custom classifiers\"라고 합니다.",
            "Q4-A-3": "이 한도를 초과하면 새로운 머신러닝 모델을 익히는 데 실패하고 다음의 메시지가 표시됩니다:",
            "Q4-A-4": "클래스가 이미 최대 허용 모델 수를 만들었습니다. 선생님이나 그룹 리더에게 \"Watson Visual Recognition API 키에 분류기를 더 이상 사용할 수 없음\"을 알려주십시오.",
            "Q4-A-5": "성공적으로 훈련된 모델을 가진 학생이 모델을 삭제하면 다른 학생이 사용할 수 있도록 맞춤 분류기를 해제합니다.",
            "Q4-A-6": "향후이 오류를 피하는 한 가지 방법은 클래스 크기가 더 작아지는 것입니다. Watson Visual Recognition 인증서에서 지원하는 맞춤 분류기 수보다 학생의 수가 적으면 제한에 걸리지 않습니다.",
            "Q4-A-7": "이 오류를 피할 수있는 또 다른 방법은 클래스에 Watson Assistant API 키를 추가하거나 제한이 적은 Watson Visual Recognition 인스턴스 \"plan\"을 사용하는 것입니다.",

            "Q5": "\"Watson이 제공하는 API키는 속도가 제한적입니다.\"",
            "Q5-A-1": "머신러닝 모델은 IBM Watson API를 사용하여 작성됩니다.",
            "Q5-A-2": "\"관리되지 않는\" 클래스 계정이 있으면, 선생님이나 그룹 리더가 IBM Cloud에서 Watson API 인증서를 입력해야 작동할 수 있습니다.",
            "Q5-A-3": "무료 계정이 생성되면 새로운 시스템 학습 모델에 대한 요청 속도에 제한가 적용됩니다. 정상적으로 사용하면 클래스에 영향을 주지 않습니다. 그러나 학생들이 위에 설명 된대로 \"사용할 수있는 작업 공간을 더 이상 사용할 수 없거나\", \"사용할 수있는 분류자를 더 이상 사용할 수 없습니다\"라는 오류가 발생할 때 몇 분 동안 초당 여러 번 \"새로운 기계 학습 모델 학습\"버튼을 계속 클릭하면 속도 제한이 적용됩니다.",
            "Q5-A-4": "이 경우 다음과 같은 메시지가 학생들에게 표시됩니다:",
            "Q5-A-5": "귀하의 클래스가 너무 빠른 속도로 기계 학습 모델을 작성하기 위해 너무 많은 요청을하고 있습니다. 지금 진행을 멈추고 선생님이나 그룹 리더에게 \"Watson Assistant 서비스가 현재 API 키의 속도를 제한하고 있음\"을 알리십시오.",
            "Q5-A-6": "속도 제한은 \"아이들을 위한 머신러닝\" 사이트와는 상관이 없습니다. 대개 일시적이며 단기간을 기다림으로써 가장 잘 해결됩니다.",
            "Q5-A-7": "학생들이 \"새로운 기계 학습 모델 교육\"버튼을 클릭하고 \"더 이상 사용할 수있는 작업 공간이 없거나\", \"더 이상 사용할 수 없는 분류기가 없다는\" 오류가 발생할 때, (위에서 설명한 바와 같이)반복적으로 버튼을 클릭해도 문제가 해결되지 않으며 실제로 나머지 클래스의 상황이 악화됩니다.",

            "Q6": "모델 훈련을 너무 오래 기다리고 있어요!",
            "Q6-A-1": "페이지를 새로고침해 보세.",
            "Q6-A-2": "페이지는 30 초마다 기계 학습 모델의 상태를 확인하지만 매우 가끔 검사를 중단할 수 있습니다. 그렇기 때문에 실제로 모델이 준비된 상태일 수도 있습니다.",
            "Q6-A-3": "몇 분이 지났 으면 페이지를 새로 고침하여 확인해보세요.",
            "Q6-A-4": "10분 이상이 지난 경우 다시 학습을 시작하기를 권유합니다(취소 버튼을 클릭 한 다음 버튼을 클릭하여 새로운 기계 학습 모델을 다시 교육하십시오)."
        },

        "TEACHERUI": {
            "TITLE": "교사 / 관리자 UI 문제",

            "Q1": "교사 페이지에서 사용 가능한 ML 모델의 수가 올바르지 않습니다.",
            "Q1-A-1": "교사 페이지에는 수업에 사용할 수 있는 기계 학습 모델 수가 표시됩니다(이 페이지는 교사 또는 그룹 리더만 액세스 할 수 있습니다). 이 값은 교사가 만든 API 키 / 인증서의 수를 가져와 단일 API 키로 생성할 수있는 기계 학습 모델의 수를 곱하여 계산됩니다.",
            "Q1-A-2": "유감스럽게도 이것은 오해의 소지가 있습니다. 이 값은 API 키를 만들 때 어떤 요금제가 사용되었는지를 기반으로 계산됩니다.",
            "Q1-A-3": "<span class = 'mlprojecttype'>텍스트</span> 프로젝트의 경우 Watson Assistant (이전의 Watson Conversation) 인증서를 만드는 데에는 'Standard Plan'이 사용되며 이는 20개의 '작업 영역'을 지원합니다. 선생님 페이지는 <a href='https://console.bluemix.net/catalog/services/conversation'>Watson Assistant</a> 자격 증명의 수에 20을 곱하여 표시합니다.",
            "Q1-A-4": "\"교실(클래스)은 몇 개까지 허용됩니까? 텍스트 프로젝트에서 허용하는 머신러닝 모델의 총 수는 얼마입니까?\"",
            "Q1-A-5": "\"Lite Plan\"은 단지 5개의 \"workspaces\"를 지원합니다. 그러므로 Lite Plan으로 Watson Assistant 인증서가 만들어진 경우 실제 한계는 교사 페이지에 표시되는 것보다 적음을 의미합니다.",
            "Q1-A-6": "<span class='mlprojecttype'>images</span> 프로젝트의 경우, \"Lite Plan\" 으로 <a href='https://console.bluemix.net/catalog/services/watson_vision_combined'>Watson Visual Recognition</a> API keys가 만들어졌다고 가정할 때, 1개의 \"custom model\"을 지원합니다. 선생님의 페이지에는 Watson Visual Recognition API 키의 수에 1을 곱한 값이 표시됩니다.",
            "Q1-A-7": "\"교실(클래스)은 몇 개까지 허용됩니까? 이미지 프로젝트에서 허용하는 머신러닝 모델의 총 수는 얼마입니까?\"",
            "Q1-A-8": "\"Standard Plan\"은 모델의 개수에 제한이 없습니다. 따라서 표준 가격 책정 계획으로 Watson Visual Recognition API 키 중 하나가 작성된 경우 이는 교사 페이지에 표시된 내용에도 불구하고 실제로 이미지 프로젝트의 기계 학습 모델 수에 제한이 없음을 의미합니다.",
            "Q1-A-9": "이 페이지에서 혼동을 드리게해서 죄송합니다. 각 자격 증명 또는 API 키에 대한 가격 정책을 계획을 교사용 관리 페이지에 업데이트하여, UI에서 간단하게 계산할 수 있도록 하겠습니다.",
            "Q1-A-10": "정확한 수는 IBM Cloud에서 확인할 수 있습니다. 더 자세한 내용은 <a href='https://github.com/IBM/taxinomitis-docs/raw/master/docs/pdf/machinelearningforkids-apikeys.pdf'>PDF document about using Watson API keys with Machine Learning for Kids</a>에서 확인할 수 있습니다.",
            "Q1-A-11": "여러분의 클래스의 제한을 잘 모르겠다면 <a href='mailto:dale.lane@uk.ibm.com'>이메일</a>을 보내주세요. 도와드리겠습니다.",

            "Q2": "선생님 페이지의 목록에서 학생 계정이 없어졌습니다",
            "Q2-A-1": "아이들을 위한 머신러닝의 사용자 관리는 서드파티 서비스인 <a href=\"https://auth0.com/\"> Auth0 </a>을 사용하여 구현됩니다.",
            "Q2-A-2": "때때로, Auth0가 반환하는 학생 목록은 예전 버전일 수 있으며 최근에 작성된 학생을 반영하지 못합니다(또는 마찬가지로 최근에 삭제된 학생을 표시 하기도 합니다).",
            "Q2-A-3": "이 경우 학생은 정상적으로 성공적으로 생성(또는 삭제)되었으며, 표시되는 학생 목록에 최근 업데이트가 반영되지 않았을 뿐입니다.",
            "Q2-A-4": "Auth0은 일반적으로 상태 페이지에서 <a href='https://status.auth0.com/incidents/0sk1d3hjlw0m'>사용자 목록 지연</a> 또는 <a href='https://status.auth0.com/incidents/t8995b9jggx5'>검색 API 관련 문제</a>와 같은 문제를 보고합니다.",
            "Q2-A-5": "가장 좋은 방법은 Auth0의 목록이 최신화되기를 기다리는 것입니다.",

            "Q3": "Assistant 란 무엇입니까? Conversation은 어떻게 되었습니까?",
            "Q3-A-1": "2018 년 3 월에 \"Watson Conversation\"서비스 이름이 \"Watson Assistant\"로 변경되었습니다. \"Conversation\"에 대한 이전 언급은 \"Assistant\"로 읽을 수 있습니다. 이 시점 이전에 생성된 모든 Watson Conversation 서비스 인스턴스나 인증서는 Watson Assistant와 동등한 것으로 계속 사용될 수 있습니다.",

            "Q4": "왜 머신러닝 모델이 자동으로 삭제됩니까",
            "Q4-A-1": "이것은 아이들을 위한 머신러닝이 처음 개발되었을 때, 학교에서 요청한 기능입니다. 주어진 시간에 클래스가 가질 수 있는 머신러닝 모델의 수에 제한을 두어 관리를 쉽게할 수 있도록 하기 위해서입니다.",
            "Q4-A-2": "학생들이 수업을 끝내고 모델을 지우도록 요구하는 대신(다음 클래스가 모델을 만들 수 있도록), 수업이 끝나면 모델을 삭제하여 자동으로 정리할 수 있습니다. 이렇게 하면 다음 학습을 위해 모델을 수동으로 정리하지 않아도 됩니다.",
            "Q4-A-3": "모델을 삭제하기 전의 시간 제한을 구성 할 수 있습니다. 수업 시간이 1 시간 또는 2 시간인 학교에서는 2시간 후에 모델을 삭제하는 것이 좋습니다. 매주 작성하는 클럽의 경우, 새로운 클럽 세션이 시작되기 전인 6일이 더 적합할 수 있습니다.",
            "Q4-A-4": "수업 시간 제한을 확인하려면 선생님 페이지의 <a href='https://machinelearningforkids.co.uk/#!/teacher/restrictions'>제한 사항</a>을 살펴보세요.",
            "Q4-A-5": "수업 시간 제한을 변경하려면 <a href='mailto:dale.lane@uk.ibm.com'>이메일</a>을 보내주세요.",
            "Q4-A-6": "<em>참고 : 기계 학습 모델 만 자동으로 삭제되며 작성하는 데 사용 된 교육 데이터는 자동 삭제되지 않습니다. 따라서 학생이 아직 작업중인 프로젝트에 대해 모델이 자동으로 삭제되면 \"훈련\" 버튼을 다시 클릭하여 모델을 다시 만들 수 있습니다."
        },

        "ACCOUNTISSUES": {
            "TITLE": "계정 문제",

            "Q1": "계정 생성과 \"지금 사용해보기\"의 차이점은 무엇입니까?",
            "Q1-A-1": "\"지금 사용해보기\"는 로그온과 계정을 만들 필요가 없음을 의미합니다. 학생들이 기억해야 할 암호가 없으며,  교사가 개인 정보를 제공할 필요가 없습니다. 또한 교사가 학생 계정을 관리하는 데 필요한 시간을 절약 할 수 있습니다.",
            "Q1-A-2": "그러나 계정을 만들면 추가 기능을 사용할 수 있습니다. 학생들은 자신의 작업을 저장하고 이후 학습에서 다시 사용할 수 있습니다. 학생들은 수업 중 다른 학생들과 함께 프로젝트를 진행할 수 있습니다. 또한 학생들은 집에서 접속하여 가족이 만든 것을 보여줄 수 있습니다.",
            "Q1-A-3": "차이점을 요약하면 다음과 같습니다:",

            "CREATE_ACCOUNT": "계정 만들기",
            "TRAINMODELS": "인식을 위한 머신러닝 모델 훈련시키기",
            "USE_SCRATCH": "스크래치에서 머신러닝 모델 사용하기",
            "CREATE_PROJECTS": "프로젝트 만들기",
            "ONE_PROJECT": " 프로젝트 하나 ",
            "MULTIPLE_PROJECTS": " 여러 프로젝트 ",
            "SAVE_PROJECTS": "프로젝트 저장 및 불러오기",
            "WORK_ON_PROJECTS": "머신러닝 프로젝트 작업",
            "FEW_HOURS": " 몇 시간 동안 ",
            "UNTIL_DELETION": " 그것을 삭제할 때 까지 ",
            "ONE_COMPUTER": " 한 대의 컴퓨터에서 ",
            "ONLINE": " 온라인의 어디서나 ",
            "BY_YOURSELF": " 혼자서 ",
            "WITH_CLASSMATES": "친구와 함께",

            "Q2": "클래스 계정을 만들었지만 로그온할 수 없습니다.",
            "Q2-A-1": "로그온하려면 이메일 주소를 확인해야 합니다.",
            "Q2-A-2": "수업 계정을 만들면 입력하신 이메일 주소로 클릭할 수 있는 링크가 있는 이메일이 전송됩니다. 링크를 클릭하면 이메일 주소가 확인되고 현재 계정에 로그인 할 수 있습니다.",
            "Q2-A-3": "확인 이메일을 아직 보지 않았다면 스팸 폴더에 저장되지 않았는지 확인하십시오.",
            "Q2-A-4": "여전히 찾치 못한다며, <a href='mailto:dale.lane@uk.ibm.com'>알려주세요</a>. 도움을 드리겠습니다.",

            "Q3": "계정 삭제",
            "Q3-A-1": "학생 계정",
            "Q3-A-2": "학생들은 그들의 계정을 삭제할 수 없습니다.",
            "Q3-A-3": "교사는 \"교사\"페이지에서 삭제할 학생의 계정 옆의 \"학생 계정 삭제\"버튼을 클릭하면 언제든지 학생 계정을 삭제할 수 있습니다.",
            "Q3-A-4": "해당 학생의 모든 프로젝트와 머신러닝 모델에 대해 저장된 모든 정보가 삭제됩니다.",
            "Q3-A-5": "취소할 수 없습니다.",
            "Q3-A-6": "교사 계정",
            "Q3-A-7": "교사 계정을 삭제하면 수업 전체와 학생 계정이 모두 삭제됩니다. 그리고 취소할 수 없습니다.",
            "Q3-A-8": "<a href='https://machinelearningforkids.co.uk/teacher'>교사 페이지</a>의 고급 옵션 중 \"교실 삭제\" 버튼을 누르면 됩니다.",

            "Q4": "사용자에 대해 어떤 정보가 저장되어 있습니까?"

        }
    }
}
