{"weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"dtype": "float32", "shape": [1024, 64], "name": "encoder/dense/kernel"}, {"dtype": "float32", "shape": [64], "name": "encoder/dense/bias"}, {"dtype": "float32", "shape": [64, 1], "name": "encoder/dense_1/kernel"}, {"dtype": "float32", "shape": [1], "name": "encoder/dense_1/bias"}, {"dtype": "float32", "shape": [], "name": "l2_normalize/Maximum/y"}, {"dtype": "int32", "shape": [1, 2], "name": "stft_1/frame/Reshape_3"}, {"dtype": "int32", "shape": [], "name": "stft_1/frame/gcd/Const"}, {"dtype": "int32", "shape": [1, 4], "name": "stft_2/frame/Reshape_3"}, {"dtype": "int32", "shape": [], "name": "stft_2/frame/gcd/Const"}, {"dtype": "int32", "shape": [1, 8], "name": "stft_3/frame/Reshape_3"}, {"dtype": "int32", "shape": [], "name": "stft_3/frame/gcd/Const"}, {"dtype": "int32", "shape": [1, 16], "name": "stft_4/frame/Reshape_3"}, {"dtype": "int32", "shape": [], "name": "stft_4/frame/gcd/Const"}, {"dtype": "int32", "shape": [1, 32], "name": "stft_5/frame/Reshape_3"}, {"dtype": "int32", "shape": [0], "name": "stft/frame/Reshape/shape"}, {"dtype": "int32", "shape": [], "name": "stft_5/frame/gcd/Const"}, {"dtype": "int32", "shape": [], "name": "stft/frame/gcd/Const"}, {"dtype": "int32", "shape": [3], "name": "Reshape_1/shape"}, {"dtype": "float32", "shape": [1, 257, 1, 1], "name": "convolution/ExpandDims_1"}, {"dtype": "float32", "shape": [], "name": "mul_4/x"}, {"dtype": "int32", "shape": [1, 2], "name": "Pad/paddings"}, {"dtype": "int32", "shape": [3], "name": "stft/frame/packed"}, {"dtype": "int32", "shape": [1], "name": "stft/rfft/packed"}, {"dtype": "float32", "shape": [257, 48], "name": "concat"}, {"dtype": "int32", "shape": [1], "name": "strided_slice/stack"}, {"dtype": "int32", "shape": [1], "name": "stft/frame/ones_like"}, {"dtype": "int32", "shape": [], "name": "strided_slice_11/stack_1/1"}, {"dtype": "int32", "shape": [], "name": "concat_12/axis"}, {"dtype": "int32", "shape": [2], "name": "strided_slice_12/stack"}, {"dtype": "float32", "shape": [128], "name": "ConstantFolding/truediv_recip"}, {"dtype": "int32", "shape": [2], "name": "strided_slice_26/stack_1"}, {"dtype": "int32", "shape": [4], "name": "strided_slice_27/stack"}, {"dtype": "int32", "shape": [4], "name": "strided_slice_27/stack_2"}, {"dtype": "int32", "shape": [2], "name": "encoder/flatten/Const"}, {"dtype": "float32", "shape": [1024, 1], "name": "encoder/dense_2/kernel"}, {"dtype": "float32", "shape": [1], "name": "encoder/dense_2/bias"}, {"dtype": "int32", "shape": [2], "name": "encoder/strided_slice/stack"}, {"dtype": "int32", "shape": [2], "name": "encoder/strided_slice/stack_1"}, {"dtype": "int32", "shape": [2], "name": "encoder/strided_slice/stack_2"}, {"dtype": "float32", "shape": [1, 3, 1, 64], "name": "encoder/conv2d/kernel"}, {"dtype": "float32", "shape": [64], "name": "encoder/conv2d/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 3, 64, 128], "name": "encoder/conv2d_1/kernel"}, {"dtype": "float32", "shape": [128], "name": "encoder/conv2d_1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 3, 128, 256], "name": "encoder/conv2d_2/kernel"}, {"dtype": "float32", "shape": [256], "name": "encoder/conv2d_2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 3, 256, 512], "name": "encoder/conv2d_3/kernel"}, {"dtype": "float32", "shape": [512], "name": "encoder/conv2d_3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 3, 512, 512], "name": "encoder/conv2d_4/kernel"}, {"dtype": "float32", "shape": [512], "name": "encoder/conv2d_4/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 3, 512, 512], "name": "encoder/conv2d_5/kernel"}, {"dtype": "float32", "shape": [512], "name": "encoder/conv2d_5/Conv2D_bn_offset"}, {"dtype": "int32", "shape": [], "name": "ConstantFolding/stft/frame/concat/values_1_const_axis"}, {"dtype": "int32", "shape": [], "name": "ConstantFolding/stft_1/frame/concat/values_1_const_axis"}, {"dtype": "int32", "shape": [], "name": "ConstantFolding/stft_2/frame/concat/values_1_const_axis"}, {"dtype": "int32", "shape": [], "name": "ConstantFolding/stft_3/frame/concat/values_1_const_axis"}, {"dtype": "int32", "shape": [], "name": "ConstantFolding/stft_4/frame/concat/values_1_const_axis"}, {"dtype": "int32", "shape": [], "name": "ConstantFolding/stft_5/frame/concat/values_1_const_axis"}]}], "modelTopology": {"node": [{"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "64"}]}}}}, "name": "encoder/dense/kernel", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "encoder/dense/bias", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}}, "name": "encoder/dense_1/kernel", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "encoder/dense_1/bias", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "l2_normalize/Maximum/y", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}}, "name": "stft_1/frame/Reshape_3", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "stft_1/frame/gcd/Const", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}]}}}}, "name": "stft_2/frame/Reshape_3", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "stft_2/frame/gcd/Const", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "8"}]}}}}, "name": "stft_3/frame/Reshape_3", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "stft_3/frame/gcd/Const", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "16"}]}}}}, "name": "stft_4/frame/Reshape_3", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "stft_4/frame/gcd/Const", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}}, "name": "stft_5/frame/Reshape_3", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}, "name": "stft/frame/Reshape/shape", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "stft_5/frame/gcd/Const", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "stft/frame/gcd/Const", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}, "name": "input_audio_samples", "op": "Placeholder"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "Reshape_1/shape", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "257"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "convolution/ExpandDims_1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "mul_4/x", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}}, "name": "Pad/paddings", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "stft/frame/packed", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "stft/rfft/packed", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "257"}, {"size": "48"}]}}}}, "name": "concat", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "strided_slice/stack", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "stft/frame/ones_like", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "strided_slice_11/stack_1/1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "concat_12/axis", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "strided_slice_12/stack", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "ConstantFolding/truediv_recip", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "strided_slice_26/stack_1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}, "name": "strided_slice_27/stack", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}, "name": "strided_slice_27/stack_2", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "encoder/flatten/Const", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "1"}]}}}}, "name": "encoder/dense_2/kernel", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "encoder/dense_2/bias", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "encoder/strided_slice/stack", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "encoder/strided_slice/stack_1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "encoder/strided_slice/stack_2", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1"}, {"size": "64"}]}}}}, "name": "encoder/conv2d/kernel", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "encoder/conv2d/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}, "name": "encoder/conv2d_1/kernel", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "encoder/conv2d_1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}, "name": "encoder/conv2d_2/kernel", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "encoder/conv2d_2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}}, "name": "encoder/conv2d_3/kernel", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "encoder/conv2d_3/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}, "name": "encoder/conv2d_4/kernel", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "encoder/conv2d_4/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}, "name": "encoder/conv2d_5/kernel", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "encoder/conv2d_5/Conv2D_bn_offset", "op": "Const"}, {"input": ["input_audio_samples", "Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "Reshape_1", "op": "Reshape"}, {"input": ["input_audio_samples", "Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "Pad", "op": "Pad"}, {"input": ["Reshape_1", "concat_12/axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "convolution/ExpandDims", "op": "ExpandDims"}, {"input": ["Pad"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "stft/frame/Shape", "op": "Shape"}, {"device": "/device:CPU:0", "input": ["convolution/ExpandDims", "convolution/ExpandDims_1"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "convolution", "op": "Conv2D"}, {"input": ["stft/frame/Shape", "stft/frame/packed", "strided_slice_11/stack_1/1"], "attr": {"num_split": {"i": "3"}, "Tlen": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}, "name": "stft/frame/split", "op": "SplitV"}, {"input": ["convolution"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}, "name": "convolution/Squeeze", "op": "Squeeze"}, {"input": ["stft/frame/split:1", "stft/frame/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft/frame/Reshape", "op": "Reshape"}, {"input": ["convolution/Squeeze"], "attr": {"squeeze_dims": {"list": {}}, "T": {"type": "DT_FLOAT"}}, "name": "Squeeze", "op": "Squeeze"}, {"input": ["stft/frame/Reshape", "stft/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft/frame/floordiv_3", "op": "FloorDiv"}, {"input": ["stft/frame/Reshape", "stft/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft/frame/sub_2", "op": "Sub"}, {"input": ["Squeeze", "mul_4/x"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "mul", "op": "Mul"}, {"input": ["stft/frame/floordiv_3", "stft/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft/frame/mul", "op": "Mul"}, {"input": ["stft/frame/floordiv_3", "stft/frame/gcd/Const"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "name": "stft/frame/concat_1/values_1", "op": "Pack"}, {"input": ["stft/frame/sub_2", "stft/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft/frame/floordiv", "op": "FloorDiv"}, {"input": ["mul", "Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "Pad_1", "op": "Pad"}, {"input": ["mul", "Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "Reshape_3", "op": "Reshape"}, {"input": ["^stft/frame/mul"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "ConstantFolding/stft/frame/concat/values_1_const_axis", "op": "Const"}, {"input": ["stft/frame/split", "stft/frame/concat_1/values_1", "stft/frame/split:2", "strided_slice_11/stack_1/1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}, "name": "stft/frame/concat_1", "op": "ConcatV2"}, {"input": ["concat_12/axis", "stft/frame/floordiv"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft/frame/add_1", "op": "AddV2"}, {"input": ["Pad_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "stft_1/frame/Shape", "op": "Shape"}, {"input": ["Reshape_3", "concat_12/axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "convolution_1/ExpandDims", "op": "ExpandDims"}, {"input": ["stft/frame/mul", "ConstantFolding/stft/frame/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}, "name": "stft/frame/concat/values_1", "op": "ExpandDims"}, {"input": ["strided_slice_11/stack_1/1", "stft/frame/add_1"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft/frame/Maximum", "op": "Maximum"}, {"input": ["stft_1/frame/Shape", "stft/frame/packed", "strided_slice_11/stack_1/1"], "attr": {"num_split": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tlen": {"type": "DT_INT32"}}, "name": "stft_1/frame/split", "op": "SplitV"}, {"device": "/device:CPU:0", "input": ["convolution_1/ExpandDims", "convolution/ExpandDims_1"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "convolution_1", "op": "Conv2D"}, {"input": ["stft/frame/split", "stft/frame/concat/values_1", "stft/frame/split:2", "strided_slice_11/stack_1/1"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}, "name": "stft/frame/concat", "op": "ConcatV2"}, {"input": ["strided_slice_11/stack_1/1", "stft/frame/Maximum", "concat_12/axis"], "attr": {"Tidx": {"type": "DT_INT32"}}, "name": "stft/frame/range_1", "op": "Range"}, {"input": ["stft/frame/Maximum", "concat_12/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "name": "stft/frame/Reshape_2/shape", "op": "Pack"}, {"input": ["stft/frame/Maximum", "stft/frame/gcd/Const"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "name": "stft/frame/concat_2/values_1", "op": "Pack"}, {"input": ["stft_1/frame/split:1", "stft/frame/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft_1/frame/Reshape", "op": "Reshape"}, {"input": ["convolution_1"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}, "name": "convolution_1/Squeeze", "op": "Squeeze"}, {"input": ["Pad", "strided_slice/stack", "stft/frame/concat", "stft/frame/ones_like"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}}, "name": "stft/frame/StridedSlice", "op": "StridedSlice"}, {"input": ["stft/frame/range_1", "stft/frame/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft/frame/Reshape_2", "op": "Reshape"}, {"input": ["stft/frame/split", "stft/frame/concat_2/values_1", "stft/frame/split:2", "strided_slice_11/stack_1/1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}, "name": "stft/frame/concat_2", "op": "ConcatV2"}, {"input": ["stft_1/frame/Reshape", "stft_1/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_1/frame/floordiv_3", "op": "FloorDiv"}, {"input": ["stft_1/frame/Reshape", "stft/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_1/frame/sub_2", "op": "Sub"}, {"input": ["convolution_1/Squeeze"], "attr": {"squeeze_dims": {"list": {}}, "T": {"type": "DT_FLOAT"}}, "name": "Squeeze_1", "op": "Squeeze"}, {"input": ["stft/frame/StridedSlice", "stft/frame/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft/frame/Reshape_1", "op": "Reshape"}, {"input": ["stft_1/frame/floordiv_3", "stft_1/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_1/frame/mul", "op": "Mul"}, {"input": ["stft_1/frame/floordiv_3", "stft_1/frame/gcd/Const"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}, "name": "stft_1/frame/concat_1/values_1", "op": "Pack"}, {"input": ["stft_1/frame/sub_2", "stft_1/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_1/frame/floordiv", "op": "FloorDiv"}, {"input": ["Squeeze_1", "mul_4/x"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "mul_1", "op": "Mul"}, {"input": ["stft/frame/Reshape_1", "stft/frame/Reshape_2", "strided_slice_11/stack_1/1"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}, "name": "stft/frame/GatherV2", "op": "GatherV2"}, {"input": ["^stft_1/frame/mul"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "ConstantFolding/stft_1/frame/concat/values_1_const_axis", "op": "Const"}, {"input": ["stft_1/frame/split", "stft_1/frame/concat_1/values_1", "stft_1/frame/split:2", "strided_slice_11/stack_1/1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}, "name": "stft_1/frame/concat_1", "op": "ConcatV2"}, {"input": ["concat_12/axis", "stft_1/frame/floordiv"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_1/frame/add_1", "op": "AddV2"}, {"input": ["mul_1", "Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "Pad_2", "op": "Pad"}, {"input": ["mul_1", "Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "Reshape_5", "op": "Reshape"}, {"input": ["stft/frame/GatherV2", "stft/frame/concat_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft/frame/Reshape_4", "op": "Reshape"}, {"input": ["stft_1/frame/mul", "ConstantFolding/stft_1/frame/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}, "name": "stft_1/frame/concat/values_1", "op": "ExpandDims"}, {"input": ["strided_slice_11/stack_1/1", "stft_1/frame/add_1"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_1/frame/Maximum", "op": "Maximum"}, {"input": ["Pad_2"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "stft_2/frame/Shape", "op": "Shape"}, {"input": ["Reshape_5", "concat_12/axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "convolution_2/ExpandDims", "op": "ExpandDims"}, {"input": ["stft/frame/Reshape_4", "stft/rfft/packed"], "name": "stft/rfft", "op": "RFFT"}, {"input": ["stft_1/frame/split", "stft_1/frame/concat/values_1", "stft_1/frame/split:2", "strided_slice_11/stack_1/1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}, "name": "stft_1/frame/concat", "op": "ConcatV2"}, {"input": ["strided_slice_11/stack_1/1", "stft_1/frame/Maximum", "concat_12/axis"], "attr": {"Tidx": {"type": "DT_INT32"}}, "name": "stft_1/frame/range_1", "op": "Range"}, {"input": ["stft_1/frame/Maximum", "concat_12/axis"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}, "name": "stft_1/frame/Reshape_2/shape", "op": "Pack"}, {"input": ["stft_1/frame/Maximum", "stft/frame/gcd/Const"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "name": "stft_1/frame/concat_2/values_1", "op": "Pack"}, {"input": ["stft_2/frame/Shape", "stft/frame/packed", "strided_slice_11/stack_1/1"], "attr": {"num_split": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tlen": {"type": "DT_INT32"}}, "name": "stft_2/frame/split", "op": "SplitV"}, {"device": "/device:CPU:0", "input": ["convolution_2/ExpandDims", "convolution/ExpandDims_1"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "convolution_2", "op": "Conv2D"}, {"input": ["stft/rfft"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}, "name": "Real", "op": "Real"}, {"input": ["stft/rfft"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}, "name": "Imag", "op": "Imag"}, {"input": ["Pad_1", "strided_slice/stack", "stft_1/frame/concat", "stft/frame/ones_like"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}}, "name": "stft_1/frame/StridedSlice", "op": "StridedSlice"}, {"input": ["stft_1/frame/range_1", "stft_1/frame/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft_1/frame/Reshape_2", "op": "Reshape"}, {"input": ["stft_1/frame/split", "stft_1/frame/concat_2/values_1", "stft_1/frame/split:2", "strided_slice_11/stack_1/1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}, "name": "stft_1/frame/concat_2", "op": "ConcatV2"}, {"input": ["stft_2/frame/split:1", "stft/frame/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft_2/frame/Reshape", "op": "Reshape"}, {"input": ["convolution_2"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}, "name": "convolution_2/Squeeze", "op": "Squeeze"}, {"input": ["Real", "Imag", "strided_slice_11/stack_1/1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}, "name": "concat_1", "op": "ConcatV2"}, {"input": ["stft_1/frame/StridedSlice", "stft_1/frame/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft_1/frame/Reshape_1", "op": "Reshape"}, {"input": ["stft_1/frame/Reshape_2", "stft_1/frame/Reshape_3"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_1/frame/add_2", "op": "AddV2"}, {"input": ["stft_2/frame/Reshape", "stft_2/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_2/frame/floordiv_3", "op": "FloorDiv"}, {"input": ["stft_2/frame/Reshape", "stft/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_2/frame/sub_2", "op": "Sub"}, {"input": ["convolution_2/Squeeze"], "attr": {"squeeze_dims": {"list": {}}, "T": {"type": "DT_FLOAT"}}, "name": "Squeeze_2", "op": "Squeeze"}, {"input": ["concat_1", "concat"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "MatMul", "op": "MatMul"}, {"input": ["stft_1/frame/Reshape_1", "stft_1/frame/add_2", "strided_slice_11/stack_1/1"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}, "name": "stft_1/frame/GatherV2", "op": "GatherV2"}, {"input": ["stft_2/frame/floordiv_3", "stft_2/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_2/frame/mul", "op": "Mul"}, {"input": ["stft_2/frame/floordiv_3", "stft_2/frame/gcd/Const"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "name": "stft_2/frame/concat_1/values_1", "op": "Pack"}, {"input": ["stft_2/frame/sub_2", "stft_2/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_2/frame/floordiv", "op": "FloorDiv"}, {"input": ["Squeeze_2", "mul_4/x"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "mul_2", "op": "Mul"}, {"input": ["concat_12/axis", "MatMul"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}, "name": "split", "op": "Split"}, {"input": ["stft_1/frame/GatherV2", "stft_1/frame/concat_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft_1/frame/Reshape_4", "op": "Reshape"}, {"input": ["^stft_2/frame/mul"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "ConstantFolding/stft_2/frame/concat/values_1_const_axis", "op": "Const"}, {"input": ["stft_2/frame/split", "stft_2/frame/concat_1/values_1", "stft_2/frame/split:2", "strided_slice_11/stack_1/1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}, "name": "stft_2/frame/concat_1", "op": "ConcatV2"}, {"input": ["concat_12/axis", "stft_2/frame/floordiv"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_2/frame/add_1", "op": "AddV2"}, {"input": ["mul_2", "Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "Pad_3", "op": "Pad"}, {"input": ["mul_2", "Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "Reshape_7", "op": "Reshape"}, {"input": ["strided_slice_11/stack_1/1", "split"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}, "name": "split_1", "op": "Split"}, {"input": ["strided_slice_11/stack_1/1", "split:1"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}, "name": "split_2", "op": "Split"}, {"input": ["stft_1/frame/Reshape_4", "stft/rfft/packed"], "name": "stft_1/rfft", "op": "RFFT"}, {"input": ["stft_2/frame/mul", "ConstantFolding/stft_2/frame/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}, "name": "stft_2/frame/concat/values_1", "op": "ExpandDims"}, {"input": ["strided_slice_11/stack_1/1", "stft_2/frame/add_1"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_2/frame/Maximum", "op": "Maximum"}, {"input": ["Pad_3"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "stft_3/frame/Shape", "op": "Shape"}, {"input": ["Reshape_7", "concat_12/axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "convolution_3/ExpandDims", "op": "ExpandDims"}, {"input": ["split_1", "split_2:1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "Sub", "op": "Sub"}, {"input": ["split_1:1", "split_2"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "Add", "op": "Add"}, {"input": ["stft_1/rfft"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}, "name": "Real_1", "op": "Real"}, {"input": ["stft_1/rfft"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}, "name": "Imag_1", "op": "Imag"}, {"input": ["stft_2/frame/split", "stft_2/frame/concat/values_1", "stft_2/frame/split:2", "strided_slice_11/stack_1/1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}, "name": "stft_2/frame/concat", "op": "ConcatV2"}, {"input": ["strided_slice_11/stack_1/1", "stft_2/frame/Maximum", "concat_12/axis"], "attr": {"Tidx": {"type": "DT_INT32"}}, "name": "stft_2/frame/range_1", "op": "Range"}, {"input": ["stft_2/frame/Maximum", "concat_12/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "name": "stft_2/frame/Reshape_2/shape", "op": "Pack"}, {"input": ["stft_2/frame/Maximum", "stft/frame/gcd/Const"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "name": "stft_2/frame/concat_2/values_1", "op": "Pack"}, {"input": ["stft_3/frame/Shape", "stft/frame/packed", "strided_slice_11/stack_1/1"], "attr": {"num_split": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tlen": {"type": "DT_INT32"}}, "name": "stft_3/frame/split", "op": "SplitV"}, {"device": "/device:CPU:0", "input": ["convolution_3/ExpandDims", "convolution/ExpandDims_1"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "convolution_3", "op": "Conv2D"}, {"input": ["Sub"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "Shape", "op": "Shape"}, {"input": ["Add"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "Shape_6", "op": "Shape"}, {"input": ["Real_1", "Imag_1", "strided_slice_11/stack_1/1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}, "name": "concat_3", "op": "ConcatV2"}, {"input": ["Pad_2", "strided_slice/stack", "stft_2/frame/concat", "stft/frame/ones_like"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}}, "name": "stft_2/frame/StridedSlice", "op": "StridedSlice"}, {"input": ["stft_2/frame/range_1", "stft_2/frame/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft_2/frame/Reshape_2", "op": "Reshape"}, {"input": ["stft_2/frame/split", "stft_2/frame/concat_2/values_1", "stft_2/frame/split:2", "strided_slice_11/stack_1/1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}, "name": "stft_2/frame/concat_2", "op": "ConcatV2"}, {"input": ["stft_3/frame/split:1", "stft/frame/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft_3/frame/Reshape", "op": "Reshape"}, {"input": ["convolution_3"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}, "name": "convolution_3/Squeeze", "op": "Squeeze"}, {"input": ["Shape", "strided_slice/stack", "stft/frame/ones_like", "stft/frame/ones_like"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}, "name": "strided_slice", "op": "StridedSlice"}, {"input": ["Shape_6", "strided_slice/stack", "stft/frame/ones_like", "stft/frame/ones_like"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}, "name": "strided_slice_13", "op": "StridedSlice"}, {"input": ["concat_3", "concat"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "MatMul_1", "op": "MatMul"}, {"input": ["stft_2/frame/StridedSlice", "stft_2/frame/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft_2/frame/Reshape_1", "op": "Reshape"}, {"input": ["stft_2/frame/Reshape_2", "stft_2/frame/Reshape_3"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_2/frame/add_2", "op": "AddV2"}, {"input": ["stft_3/frame/Reshape", "stft_3/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_3/frame/floordiv_3", "op": "FloorDiv"}, {"input": ["stft_3/frame/Reshape", "stft/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_3/frame/sub_2", "op": "Sub"}, {"input": ["convolution_3/Squeeze"], "attr": {"squeeze_dims": {"list": {}}, "T": {"type": "DT_FLOAT"}}, "name": "Squeeze_3", "op": "Squeeze"}, {"input": ["concat_12/axis", "MatMul_1"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}, "name": "split_3", "op": "Split"}, {"input": ["stft_2/frame/Reshape_1", "stft_2/frame/add_2", "strided_slice_11/stack_1/1"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}, "name": "stft_2/frame/GatherV2", "op": "GatherV2"}, {"input": ["stft_3/frame/floordiv_3", "stft_3/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_3/frame/mul", "op": "Mul"}, {"input": ["stft_3/frame/floordiv_3", "stft_3/frame/gcd/Const"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "name": "stft_3/frame/concat_1/values_1", "op": "Pack"}, {"input": ["stft_3/frame/sub_2", "stft_3/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_3/frame/floordiv", "op": "FloorDiv"}, {"input": ["Squeeze_3", "mul_4/x"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "mul_3", "op": "Mul"}, {"input": ["strided_slice_11/stack_1/1", "split_3"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}, "name": "split_4", "op": "Split"}, {"input": ["strided_slice_11/stack_1/1", "split_3:1"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}, "name": "split_5", "op": "Split"}, {"input": ["stft_2/frame/GatherV2", "stft_2/frame/concat_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft_2/frame/Reshape_4", "op": "Reshape"}, {"input": ["^stft_3/frame/mul"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "ConstantFolding/stft_3/frame/concat/values_1_const_axis", "op": "Const"}, {"input": ["stft_3/frame/split", "stft_3/frame/concat_1/values_1", "stft_3/frame/split:2", "strided_slice_11/stack_1/1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}, "name": "stft_3/frame/concat_1", "op": "ConcatV2"}, {"input": ["concat_12/axis", "stft_3/frame/floordiv"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_3/frame/add_1", "op": "AddV2"}, {"input": ["mul_3", "Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "Pad_4", "op": "Pad"}, {"input": ["mul_3", "Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "Reshape_9", "op": "Reshape"}, {"input": ["split_4", "split_5:1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "Sub_1", "op": "Sub"}, {"input": ["split_4:1", "split_5"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "Add_1", "op": "Add"}, {"input": ["stft_2/frame/Reshape_4", "stft/rfft/packed"], "name": "stft_2/rfft", "op": "RFFT"}, {"input": ["stft_3/frame/mul", "ConstantFolding/stft_3/frame/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}, "name": "stft_3/frame/concat/values_1", "op": "ExpandDims"}, {"input": ["strided_slice_11/stack_1/1", "stft_3/frame/add_1"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_3/frame/Maximum", "op": "Maximum"}, {"input": ["Pad_4"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "stft_4/frame/Shape", "op": "Shape"}, {"input": ["Reshape_9", "concat_12/axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "convolution_4/ExpandDims", "op": "ExpandDims"}, {"input": ["Sub_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "Shape_1", "op": "Shape"}, {"input": ["Add_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "Shape_7", "op": "Shape"}, {"input": ["stft_2/rfft"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}, "name": "Real_2", "op": "Real"}, {"input": ["stft_2/rfft"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}, "name": "Imag_2", "op": "Imag"}, {"input": ["stft_3/frame/split", "stft_3/frame/concat/values_1", "stft_3/frame/split:2", "strided_slice_11/stack_1/1"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}, "name": "stft_3/frame/concat", "op": "ConcatV2"}, {"input": ["strided_slice_11/stack_1/1", "stft_3/frame/Maximum", "concat_12/axis"], "attr": {"Tidx": {"type": "DT_INT32"}}, "name": "stft_3/frame/range_1", "op": "Range"}, {"input": ["stft_3/frame/Maximum", "concat_12/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "name": "stft_3/frame/Reshape_2/shape", "op": "Pack"}, {"input": ["stft_3/frame/Maximum", "stft/frame/gcd/Const"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "name": "stft_3/frame/concat_2/values_1", "op": "Pack"}, {"input": ["stft_4/frame/Shape", "stft/frame/packed", "strided_slice_11/stack_1/1"], "attr": {"num_split": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tlen": {"type": "DT_INT32"}}, "name": "stft_4/frame/split", "op": "SplitV"}, {"device": "/device:CPU:0", "input": ["convolution_4/ExpandDims", "convolution/ExpandDims_1"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "convolution_4", "op": "Conv2D"}, {"input": ["Shape_1", "strided_slice/stack", "stft/frame/ones_like", "stft/frame/ones_like"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}, "name": "strided_slice_1", "op": "StridedSlice"}, {"input": ["Shape_7", "strided_slice/stack", "stft/frame/ones_like", "stft/frame/ones_like"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}, "name": "strided_slice_14", "op": "StridedSlice"}, {"input": ["Real_2", "Imag_2", "strided_slice_11/stack_1/1"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "concat_5", "op": "ConcatV2"}, {"input": ["Pad_3", "strided_slice/stack", "stft_3/frame/concat", "stft/frame/ones_like"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}}, "name": "stft_3/frame/StridedSlice", "op": "StridedSlice"}, {"input": ["stft_3/frame/range_1", "stft_3/frame/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft_3/frame/Reshape_2", "op": "Reshape"}, {"input": ["stft_3/frame/split", "stft_3/frame/concat_2/values_1", "stft_3/frame/split:2", "strided_slice_11/stack_1/1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}, "name": "stft_3/frame/concat_2", "op": "ConcatV2"}, {"input": ["stft_4/frame/split:1", "stft/frame/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft_4/frame/Reshape", "op": "Reshape"}, {"input": ["convolution_4"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}, "name": "convolution_4/Squeeze", "op": "Squeeze"}, {"input": ["strided_slice", "strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}, "name": "Minimum", "op": "Minimum"}, {"input": ["strided_slice_13", "strided_slice_14"], "attr": {"T": {"type": "DT_INT32"}}, "name": "Minimum_5", "op": "Minimum"}, {"input": ["concat_5", "concat"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "MatMul_2", "op": "MatMul"}, {"input": ["stft_3/frame/StridedSlice", "stft_3/frame/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft_3/frame/Reshape_1", "op": "Reshape"}, {"input": ["stft_3/frame/Reshape_2", "stft_3/frame/Reshape_3"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_3/frame/add_2", "op": "AddV2"}, {"input": ["stft_4/frame/Reshape", "stft_4/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_4/frame/floordiv_3", "op": "FloorDiv"}, {"input": ["stft_4/frame/Reshape", "stft/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_4/frame/sub_2", "op": "Sub"}, {"input": ["convolution_4/Squeeze"], "attr": {"squeeze_dims": {"list": {}}, "T": {"type": "DT_FLOAT"}}, "name": "Squeeze_4", "op": "Squeeze"}, {"input": ["concat_12/axis", "MatMul_2"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}, "name": "split_6", "op": "Split"}, {"input": ["stft_3/frame/Reshape_1", "stft_3/frame/add_2", "strided_slice_11/stack_1/1"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}, "name": "stft_3/frame/GatherV2", "op": "GatherV2"}, {"input": ["stft_4/frame/floordiv_3", "stft_4/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_4/frame/mul", "op": "Mul"}, {"input": ["stft_4/frame/floordiv_3", "stft_4/frame/gcd/Const"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}, "name": "stft_4/frame/concat_1/values_1", "op": "Pack"}, {"input": ["stft_4/frame/sub_2", "stft_4/frame/gcd/Const"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_4/frame/floordiv", "op": "FloorDiv"}, {"input": ["Squeeze_4", "mul_4/x"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "mul_4", "op": "Mul"}, {"input": ["strided_slice_11/stack_1/1", "split_6"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}, "name": "split_7", "op": "Split"}, {"input": ["strided_slice_11/stack_1/1", "split_6:1"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}, "name": "split_8", "op": "Split"}, {"input": ["stft_3/frame/GatherV2", "stft_3/frame/concat_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "stft_3/frame/Reshape_4", "op": "Reshape"}, {"input": ["^stft_4/frame/mul"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "ConstantFolding/stft_4/frame/concat/values_1_const_axis", "op": "Const"}, {"input": ["stft_4/frame/split", "stft_4/frame/concat_1/values_1", "stft_4/frame/split:2", "strided_slice_11/stack_1/1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}, "name": "stft_4/frame/concat_1", "op": "ConcatV2"}, {"input": ["concat_12/axis", "stft_4/frame/floordiv"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_4/frame/add_1", "op": "AddV2"}, {"input": ["mul_4", "Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "Pad_5", "op": "Pad"}, {"input": ["split_7", "split_8:1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "Sub_2", "op": "Sub"}, {"input": ["split_7:1", "split_8"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "Add_2", "op": "Add"}, {"input": ["stft_3/frame/Reshape_4", "stft/rfft/packed"], "name": "stft_3/rfft", "op": "RFFT"}, {"input": ["stft_4/frame/mul", "ConstantFolding/stft_4/frame/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}, "name": "stft_4/frame/concat/values_1", "op": "ExpandDims"}, {"input": ["strided_slice_11/stack_1/1", "stft_4/frame/add_1"], "attr": {"T": {"type": "DT_INT32"}}, "name": "stft_4/frame/Maximum", "op": "Maximum"}, {"input": ["Pad_5"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "stft_5/frame/Shape", "op": "Shape"}, {"input": ["Sub_2"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "Shape_2", "op": "Shape"}, {"input": ["Add_2"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "Shape_8", "op": "Shape"}, {"input": ["stft_3/rfft"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}, "name": "Real_3", "op": "Real"}, {"input": ["stft_3/rfft"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}, "name": "Imag_3", "op": "Imag"}, {"input": ["stft_4/frame/split", "stft_4/frame/concat/values_1", "stft_4/frame/split:2", "strided_slice_11/stack_1/1"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}, "name": "stft_4/frame/concat", "op": "ConcatV2"}, {"input": ["strided_slice_11/stack_1/1", "stft_4/frame/Maximum", "concat_12/axis"], "attr": {"Tidx": {"type": "DT_INT32"}}, "name": "stft_4/frame/range_1", "op": "Range"}, {"input": ["stft_4/frame/Maximum", "concat_12/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "name": "stft_4/frame/Reshape_2/shape", "op": "Pack"}, {"input": ["stft_4/frame/Maximum", "stft/frame/gcd/Const"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "name": "stft_4/frame/concat_2/values_1", "op": "Pack"}, {"input": ["stft_5/frame/Shape", "stft/frame/packed", "strided_slice_11/stack_1/1"], "attr": {"num_split": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tlen": {"type": "DT_INT32"}}, "name": "stft_5/frame/split", "op": "SplitV"}, {"input": ["Shape_2", "strided_slice/stack", "stft/frame/ones_like", "stft/frame/ones_like"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}, "name": "strided_slice_2", "op": "StridedSlice"}, {"input": ["Shape_8", "strided_slice/stack", "stft/frame/ones_like", "stft/frame/ones_like"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}, "name": "strided_slice_15", "op": "StridedSlice"}, {"input": ["Real_3", "Imag_3", 