{
    "metadata": {
        "name": "Song lyrics",
        "language": "en"
    },
    "data": {
        "children": [
            "Twinkle, twinkle, little star, how I wonder what you are",
            "The wheels on the bus go round and round",
            "Mary had a little lamb. Its fleece was white as snow",
            "If you're happy and you know it, then your face will surely show it",
            "The simple bare necessities. Forget about your worries and your strife",
            "He played knick-knack on my thumb. Knick-knack paddywhack",
            "Baby beluga in the deep blue sea. Swim so wild and you swim so free",
            "For it's one, two, three strikes, you're out, at the old ball game",
            "When you wish upon a star, makes no difference who you are",
            "Do you want to build a snowman? Or ride our bike around the halls?",
            "Oh, do you know the muffin man, the muffin man, the muffin man",
            "You are my sunshine, my only sunshine, You make me happy when skies are gray",
            "Hush, little baby, don't say a word. Papa's gonna buy you a mockingbird",
            "I'm a little teapot. Short and stout. Here is my handle. Here is my spout",
            "London Bridge is falling down. Falling down, falling down",
            "Ring a ring a rosies. A pocket full of posies. A tissue, a tissue. We all fall down",
            "Row, row, row your boat. Gently down the stream",
            "Down came the rain and washed the spider out",
            "Who lives in a pineapple under the sea?",
            "F is for friends who do stuff together. U is for you and me. N is for anywhere and anytime at all",
            "It's a world of laughter, a world of tears. It's a world of hopes and a world of fears",
            "Hickory dickory dock. The mouse went up the clock",
            "Hot cross buns, hot cross buns, one a penny, two a penny",
            "Little miss Muffet she sat on her tuffet, eating her curds eating and whey",
            "Oh, I went down south for to see my Sal, singing Polly Wolly Doodle all the day",
            "Hey, diddle, diddle the cat and the fiddle, the cow jumped over the moon",
            "There was a farmer who had a dog, And Bingo was his name-o",
            "Rock a bye, baby, in the treetop. When the wind blows, the cradle will rock",
            "Can't you hear the whistle blowing. Rise up so early in the morn",
            "She'll be coming around the mountain when she comes",
            "Oh, give me a home where the buffalo roam, where the deer and the antelope play",
            "Half a pound of tuppenny rice, half a pound of treacle",
            "Humpty Dumpty sat on a wall, Humpty Dumpty had a great fall",
            "Baa, baa, black sheep, have you any wool? Yes sir, yes sir, three bags full!",
            "Boys and girls come out to play The moon does shine as bright as day",
            "This little piggy went Wee wee wee all the way home",
            "Little Bo Peep has lost her sheep and doesn't know where to find them",
            "Jack and Jill went up the hill To fetch a pail of water",
            "Old MacDonald had a farm Ee i ee i o and on his farm he had some cows",
            "Three blind mice. Three blind mice. See how they run. See how they run",
            "This land is your land, this land is my land",
            "But the one little duck with the feather on his back. He led the others with a quack, quack, quack",
            "Pat a cake, pat a cake baker's man. Bake me a cake as fast as you can",
            "Now put your right foot in. Your right foot out. Right foot in. Then you shake it all about",
            "Young man, there's no need to feel down. I said, young man, pick yourself off the ground",
            "The farmer in the dell. The farmer in the dell. Hi ho, the derry o",
            "Mama called the doctor and the doctor said, No more monkeys jumping on the bed!",
            "The ants go marching one by one, hurrah, hurrah. The ants go marching one by one",
            "Yankee Doodle went to town A Riding on a pony Stuck a feather in his cap and called it macaroni",
            "Head, Shoulders, Knees and Toes",
            "Baby shark, doo doo doo doo doo doo",
            "Paw patrol Paw patrol, when ever you're in trouble. Paw patrol Paw patrol will be there on the double",
            "We are the dinosaurs, marching, marching",
            "Down by the bay where the watermelons grow",
            "It's the best day ever (best day ever)",
            "Hot potato, hot potato (hot potato, hot potato)",
            "Blow me down, blow me down, blow me down give it your best shot",
            "Rain, rain, go away come again another day",
            "One, two, buckle my shoe three, four, shut the door",
            "I love you, you love me. We're a happy family with a great big hug and a kiss from me to you",
            "Under the sea Under the sea Darling it's better",
            "Reindeers are better than people. Sven, don't you think that's true?",
            "Is it the clumpy way he walks? Or the grumpy way he talks? Or the pear-shaped, square-shaped",
            "This will all make sense when I am older Someday I will see that this makes sense",
            "The sun will come out tomorrow. Bet your bottom dollar that tomorrow there'll be sun!",
            "Somewhere over the rainbow way up high There's a land that I heard of once in a lullaby",
            "Ding dong! The Witch is dead. Which old Witch? The Wicked Witch!",
            "Oompa, Loompa, doom pa dee do. I have a perfect puzzle for you",
            "Come with me and you'll be In a world of Pure imagination",
            "I never thought my life could be anything but catastrophe cut suddenly I begin to see a bit of good luck for me 'cause I've got a golden ticket"
        ],
        "top40": [
            "Cause the drinks bring back all the memories and the memories bring back, memories bring back you",
            "You promised the world and I fell for it. I put you first and you adored it",
            "I'd spend ten thousand hours and ten thousand more",
            "You're a sunflower. I think your love would be too much",
            "I'm a sucker for you. You say the word and I'll go anywhere blindly",
            "Youngblood. Say you want me. Say you want me. Out of your life",
            "Take a seat right over there, sat on the stairs. Stay or leave, the cabinets are bare and I'm unaware",
            "Moved to the city in a broke down car and four years, no calls",
            "The sun goes down. The stars come out. And all that counts is here and now",
            "Cause I knew you were trouble when you walked in",
            "Never had much faith in love or miracles (miracles) uh! Never wanna put my heart on the line, uh!",
            "Have your friends collect your records and then change your number",
            "Just keep breathin' and breathin' and breathin' and breathin'",
            "We could leave the Christmas lights up 'til January. This is our place, we make the rules",
            "I'm not looking for somebody with some superhuman gifts, some superhero, some fairytale bliss",
            "All you have to do is stay a minute. Just take your time. The clock is ticking, so stay",
            "Cause I got issues But you got 'em too So give 'em all to me And I'll give mine to you",
            "And you got me like, oh. What you want from me?",
            "Come on, come on, turn the radio on. It's Friday night and I won't be long",
            "I got this feelin' inside my bones. It goes electric, wavy when I turn it on",
            "I'm sorry if I seem uninterested Or I'm not listenin' or I'm indifferent",
            "Once I was seven years old my momma told me go make yourself some friends or you'll be lonely",
            "Hello from the other side, I must've called a thousand times",
            "Oh I don't know what you've been told but this gal right here's gonna rule the world",
            "So come on, let it go, just let it be, why don't you be you and I'll be me",
            "Cause space is just a word made up by someone who's afraid to get close",
            "I'm only one call away. I'll be there to save the day. Superman got nothing on me",
            "It's been a long day without you, my friend and I'll tell you all about it when I see you again",
            "Do you recall, not long ago, we would walk on the sidewalk. Innocent, remember?",
            "Take me into your loving arms. Kiss me under the light of a thousand stars",
            "Nice to meet you, where you been? I could show you incredible things",
            "Cause the players gonna play, play, play, play, play",
            "This is my fight song. Take back my life song. Prove I'm alright song",
            "Because I'm happy. Clap along if you feel like a room without a roof",
            "Lately I been, I been losing sleep dreaming about the things that we could be",
            "Wait 'til you're announced. We've not yet lost all our graces",
            "And we'll never be royals. It don't run in our blood. That kind of lux just ain't for us",
            "Written in these walls are the stories that I can't explain",
            "I wish that I could be like the cool kids 'Cause all the cool kids, they seem to fit in",
            "Who run the world? Girls! Who run the world? Girls!",
            "Who says? Who says you're not perfect? Who says you're not worth it?",
            "Oh there ain't no other way Baby I was born this way",
            "When I see your face there's not a thing that I would change 'cause you're amazing",
            "You would not believe your eyes. If ten million fireflies. Lit up the world as I fell asleep",
            "There's always gonna be another mountain. I'm always gonna wanna make it move",
            "It starts in my toes, and I crinkle my nose Where ever it goes I always know",
            "Oh, how 'bout a round of applause? Yeah. Standin' ovation. Ooh",
            "When I grow up, I wanna be famous, I wanna be a star, I wanna be in movies",
            "Keep bleeding, keep, keep bleeding love",
            "If I lay here. If I just lay here Would you lie with me and just forget the world?",
            "So we keep waiting (waiting) Waiting on the world to change",
            "Girl, put your records on, tell me your favorite song. You go ahead, let your hair down",
            "Forgive, sounds good Forget, I'm not sure I could",
            "Who else am I gon' lean on When times get rough?",
            "I'll spread my wings, and I'll learn how to fly. I'll do what it takes till I touch the sky",
            "I am beautiful. No matter what they say. Words can't bring me down",
            "Where is the love? (love) Where is the love? (the love)",
            "I took my love and I took it down, climbed a mountain then I turned around",
            "Miss independent. Miss self-sufficient Miss keep your distance. Miss unafraid",
            "If I could fall into the sky Do you think time would pass me by?",
            "I'm gonna soak up the sun. I'm gonna tell everyone to lighten up",
            "I keep on fallin' in and out of love With you",
            "Now that she's back in the atmosphere with drops of Jupiter in her hair, hey, hey",
            "Cause you're everywhere to me and when I close my eyes, it's you I see",
            "I know that I can't take no more. It ain't no lie. I want to see you out that door. Baby bye bye bye",
            "All the women, who are independent throw your hands up at me",
            "Oops, I did it again. I played with your heart, got lost in the game",
            "I can read your mind and I know your story I see what you're going through, yeah",
            "Sometimes I run, sometimes I hide, sometimes I'm scared of you",
            "All you people can't you see, can't you see How your love's affecting our reality"
        ]
    }
}
